#b522a95d819a5559b775deb9a490e49a
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "extra/creator/cn/skillDetail"

# 烈火燎原
# extra/creator/527cdc3ecca985e18ef819d456532b26
# b522a95d819a5559b775deb9a490e49a/527cdc3ecca985e18ef819d456532b26
class Skill0(PassiveSkill):
    """
        从地表生成火焰攻击敌人。\n
        按住鼠标左键的状态下拖动鼠标， 即可根据鼠标移动轨迹生成火墙。
    """
    name = "烈火燎原"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 5
    mp = [24, 252]
    uuid = "527cdc3ecca985e18ef819d456532b26"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 火焰攻击力 : {value0}
    # REMOVE: data0 = [0, 248, 273, 298, 323, 349, 374, 399, 424, 449, 474, 500, 525, 550, 575, 600, 625, 651, 676, 701, 726, 751, 776, 802, 827, 852, 877, 902, 927, 952, 978, 1003, 1028, 1053, 1078, 1103, 1129, 1154, 1179, 1204, 1229, 1254, 1280, 1305, 1330, 1355, 1380, 1405, 1430, 1456, 1481, 1506, 1531, 1556, 1581, 1607, 1632, 1657, 1682, 1707, 1732, 1758, 1783, 1808, 1833, 1858, 1883, 1909, 1934, 1959, 1984]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 火焰大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 炽炎星陨
# extra/creator/902a016f6978f13740f237e4740a5646
# b522a95d819a5559b775deb9a490e49a/902a016f6978f13740f237e4740a5646
class Skill1(PassiveSkill):
    """
        召唤燃烧烈焰的陨石攻击敌人。\n
        陨石将掉落在鼠标点击的位置。
    """
    name = "炽炎星陨"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 5
    mp = [3, 36]
    uuid = "902a016f6978f13740f237e4740a5646"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 陨石攻击力 : {value0}
    # REMOVE: data0 = [0, 1146, 1262, 1379, 1495, 1611, 1727, 1844, 1960, 2076, 2192, 2309, 2425, 2541, 2657, 2774, 2890, 3006, 3122, 3239, 3355, 3471, 3587, 3704, 3820, 3936, 4053, 4169, 4285, 4401, 4518, 4634, 4750, 4866, 4983, 5099, 5215, 5331, 5448, 5564, 5680, 5796, 5913, 6029, 6145, 6261, 6378, 6494, 6610, 6727, 6843, 6959, 7075, 7192, 7308, 7424, 7540, 7657, 7773, 7889, 8005, 8122, 8238, 8354, 8470, 8587, 8703, 8819, 8935, 9052, 9168]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 陨石大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 后跳
# extra/creator/7822d6d52e10964a6755f142c666b494
# b522a95d819a5559b775deb9a490e49a/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
        使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501


# 基础精通
# extra/creator/5a56514f35cf0270ae8d6c65f8fefd78
# b522a95d819a5559b775deb9a490e49a/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
        增加基本攻击的攻击力。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 0 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 受身蹲伏
# extra/creator/ce26c6b69d02a440a81b552bec94f03b
# b522a95d819a5559b775deb9a490e49a/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
        使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 烈炎
# extra/creator/ce7cd04a44e32212e80f120f4421996e
# b522a95d819a5559b775deb9a490e49a/ce7cd04a44e32212e80f120f4421996e
class Skill5(ActiveSkill):
    """
        激活后， 可以发动烈炎系列的从属技能。\n
        点击鼠标左键可以施放[烈火燎原]， 鼠标右键则可以施放[炽炎星陨]。
    """
    name = "烈炎"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 5
    uuid = "ce7cd04a44e32212e80f120f4421996e"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 烈炎系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 防具精通
# extra/creator/892ef624d8bf3d7fc045f84825fd6104
# b522a95d819a5559b775deb9a490e49a/892ef624d8bf3d7fc045f84825fd6104
class Skill6(PassiveSkill):
    """
        穿戴防具时， 可以增加各种属性。\n
        穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501


# 冰霜之球
# extra/creator/370586038cf40378f20d338d507a780c
# b522a95d819a5559b775deb9a490e49a/370586038cf40378f20d338d507a780c
class Skill7(PassiveSkill):
    """
        生成冰霜之球， 按角色面对方向滚向敌人。\n
        冰球在鼠标点击的位置生成。
    """
    name = "冰霜之球"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 10
    mp = [4, 40]
    uuid = "370586038cf40378f20d338d507a780c"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 冰球攻击力 : {value0}
    # REMOVE: data0 = [0, 262, 289, 315, 342, 368, 395, 421, 448, 475, 501, 528, 554, 581, 608, 634, 661, 687, 714, 740, 767, 794, 820, 847, 873, 900, 926, 953, 980, 1006, 1033, 1059, 1086, 1113, 1139, 1166, 1192, 1219, 1245, 1272, 1299, 1325, 1352, 1378, 1405, 1432, 1458, 1485, 1511, 1538, 1564, 1591, 1618, 1644, 1671, 1697, 1724, 1750, 1777, 1804, 1830, 1857, 1883, 1910, 1937, 1963, 1990, 2016, 2043, 2069, 2096]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 6
    # 冰球多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 能量消耗值 : {value2}
    # REMOVE: data2 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 冰球大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 冰天震地
# extra/creator/fa3ee243b36699e9d3fc34328adf6417
# b522a95d819a5559b775deb9a490e49a/fa3ee243b36699e9d3fc34328adf6417
class Skill8(PassiveSkill):
    """
        生成巨大的冰盘砸向敌人。\n
        冰盘将砸落在鼠标点击的位置。
    """
    name = "冰天震地"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 10
    mp = [9, 94]
    uuid = "fa3ee243b36699e9d3fc34328adf6417"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 冰盘攻击力 : {value0}
    # REMOVE: data0 = [0, 3082, 3395, 3707, 4020, 4333, 4645, 4958, 5271, 5583, 5896, 6209, 6521, 6834, 7147, 7459, 7772, 8085, 8397, 8710, 9023, 9335, 9648, 9961, 10273, 10586, 10899, 11211, 11524, 11837, 12149, 12462, 12775, 13087, 13400, 13713, 14025, 14338, 14651, 14963, 15276, 15589, 15901, 16214, 16527, 16839, 17152, 17465, 17777, 18090, 18403, 18715, 19028, 19341, 19653, 19966, 20279, 20591, 20904, 21217, 21529, 21842, 22155, 22467, 22780, 23093, 23405, 23718, 24031, 24343, 24656]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 冰盘大小 : {value2}px
    # REMOVE: data2 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 强化 - 后跳
# extra/creator/2b340542e776818b78f3212af184bd6b
# b522a95d819a5559b775deb9a490e49a/2b340542e776818b78f3212af184bd6b
class Skill9(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 跃翔
# extra/creator/1fea5a626f15230237946a11a9d11582
# b522a95d819a5559b775deb9a490e49a/1fea5a626f15230237946a11a9d11582
class Skill10(ActiveSkill):
    """
        增加自身20%的跳跃力， 效果持续一定时间。\n
        效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 寒冰
# extra/creator/f45301a5590cccefbe0becf2f8d029f5
# b522a95d819a5559b775deb9a490e49a/f45301a5590cccefbe0becf2f8d029f5
class Skill11(ActiveSkill):
    """
        激活后， 可以发动寒冰系列的从属技能。\n
        点击鼠标左键可以施放[冰霜之球]， 鼠标右键则可以施放[冰天震地]。
    """
    name = "寒冰"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 10
    uuid = "f45301a5590cccefbe0becf2f8d029f5"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 寒冰系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 时空之手
# extra/creator/b5e3d014f75f3d17abdea52cca57f7e9
# b522a95d819a5559b775deb9a490e49a/b5e3d014f75f3d17abdea52cca57f7e9
class Skill12(PassiveSkill):
    """
        抓取敌人后抛出。\n
        点击鼠标右键时， 一定范围内的敌人将被吸附到光标周围。\n
        抓取状态下， 可以按住鼠标右键拖动敌人抛向指定位置。\n
        对无法抓取的敌人不适用控制效果。
    """
    name = "时空之手"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 2
    cd = 10
    mp = [300, 300]
    uuid = "b5e3d014f75f3d17abdea52cca57f7e9"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 鼠标抓取范围 : {value0}px
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 99]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 树之屏障
# extra/creator/d110449993fb973f1a62c62c695003db
# b522a95d819a5559b775deb9a490e49a/d110449993fb973f1a62c62c695003db
class Skill13(PassiveSkill):
    """
        利用树木制作屏障， 限制敌人的活动范围。\n
        按住左键的状态下拖动鼠标， 即可根据鼠标移动轨迹生成屏障。\n
        敌人进入屏障领域时， 会生成藤条强制控制敌人。\n
        屏障的范围越密集， 藤条持续时间越久。
    """
    name = "树之屏障"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 2
    cd = 10
    mp = [300, 300]
    uuid = "d110449993fb973f1a62c62c695003db"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 树之屏障持续时间 : {value0}秒
    # REMOVE: data0 = [0, 1.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 不同范围的藤蔓束缚持续时间 : {value1}秒 ~ {value2}秒
    # REMOVE: data1 = [0, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # REMOVE: data2 = [0, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 能量消耗值 : {value3}
    # REMOVE: data3 = [0, 99]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 大小比率 : {value4}%
    # REMOVE: data4 = [0, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 暴击
# extra/creator/fc1262c19f3d0477ee8eda47b8db8696
# b522a95d819a5559b775deb9a490e49a/fc1262c19f3d0477ee8eda47b8db8696
class Skill14(PassiveSkill):
    """
        集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 控制
# extra/creator/5c00ce6d7dbbb5e9a0f6e1071d486832
# b522a95d819a5559b775deb9a490e49a/5c00ce6d7dbbb5e9a0f6e1071d486832
class Skill15(ActiveSkill):
    """
        激活后， 可以发动控制系列的从属技能。\n
        点击鼠标左键可以施放[树之屏障]， 鼠标右键则可以施放[时空之手]。
    """
    name = "控制"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 10
    uuid = "5c00ce6d7dbbb5e9a0f6e1071d486832"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 控制系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 幻想之境
# extra/creator/aa6dd52e1c925d87cdc0ca340056c543
# b522a95d819a5559b775deb9a490e49a/aa6dd52e1c925d87cdc0ca340056c543
class Skill16(PassiveSkill):
    """
        天马行空的想象力是缔造者的基本素养。 缔造者的想象力越丰富， 能力越强。\n
        增加独立攻击力； 装备扫把时， 增加施放速度和移动速度。
    """
    name = "幻想之境"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "aa6dd52e1c925d87cdc0ca340056c543"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 独立攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11.5, 13, 14.5, 16, 17.5, 19, 20.5, 22, 23.5, 25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # - [装备扫把时的效果] -
    # 移动速度增加 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 施放速度增加 : {value2}%
    # REMOVE: data2 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    associate = [{"data":data0,"type":"$*PAtkI"}]

# 具象强化
# extra/creator/ef9d26746effee9199b54541f01b8752
# b522a95d819a5559b775deb9a490e49a/ef9d26746effee9199b54541f01b8752
class Skill17(PassiveSkill):
    """
        对各领域的力量进行深入研究， 可以强化各系列技能的力量。\n
        增加各系列技能攻击力。
    """
    name = "具象强化"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "ef9d26746effee9199b54541f01b8752"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 各系列攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 7.5, 10, 12.5, 15, 17.5, 20, 22.5, 25, 27.5, 30, 32.5, 35, 37.5, 40, 42.5, 45, 47.5, 50, 52.5, 55]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 烈焰飓风
# extra/creator/e788de1a4498c99fcc790302c4d41fed
# b522a95d819a5559b775deb9a490e49a/e788de1a4498c99fcc790302c4d41fed
class Skill18(PassiveSkill):
    """
        以自身为中心， 生成烈焰飓风。\n
        施放过程中可以自由移动。 按跳跃键时， 可以强制中断该技能。
    """
    name = "烈焰飓风"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [43, 452]
    uuid = "e788de1a4498c99fcc790302c4d41fed"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 烈焰飓风攻击力 : {value0}
    # REMOVE: data0 = [0, 1303, 1435, 1567, 1699, 1831, 1963, 2096, 2228, 2360, 2492, 2624, 2756, 2889, 3021, 3153, 3285, 3417, 3549, 3681, 3814, 3946, 4078, 4210, 4342, 4474, 4607, 4739, 4871, 5003, 5135, 5267, 5399, 5532, 5664, 5796, 5928, 6060, 6192, 6325, 6457, 6589, 6721, 6853, 6985, 7117, 7250, 7382, 7514, 7646, 7778, 7910, 8043, 8175, 8307, 8439, 8571, 8703, 8835, 8968, 9100, 9232, 9364, 9496, 9628, 9761, 9893, 10025, 10157, 10289, 10421]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 12
    # 烈焰飓风多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 能量消耗值: {value2}
    # REMOVE: data2 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 烈焰飓风大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [烈焰飓风]\n
        施放守护技能时， 可以在一定范围内设置烈焰飓风\n
        烈焰飓风大小 +40%
        """
        ...

    def vp_2(self):
        """
        [烈焰飓风]\n
        技能施放过程中， 自动生成火墙\n
        - 火墙大小 +50%\n
        - 没有烈炎系列的能量值时无法生成\n
        以飓风为中心吸附敌人\n
        飓风发动期间的移动速度增加
        """
        ...

# 极冰护盾
# extra/creator/dd32a9825ec1af42a91f2223be6658e5
# b522a95d819a5559b775deb9a490e49a/dd32a9825ec1af42a91f2223be6658e5
class Skill19(PassiveSkill):
    """
        生成极冰护盾。\n
        生成时， 攻击周围敌人并击退敌人。\n
        护盾持续时间内进入无敌状态。
    """
    name = "极冰护盾"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [43, 452]
    uuid = "dd32a9825ec1af42a91f2223be6658e5"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 护盾持续时间 : {value0}秒
    # REMOVE: data0 = [0, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72, 2.72]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 护盾伤害吸收量 : {value1}
    # REMOVE: data1 = [0, 2866, 3471, 4156, 4924, 5779, 6724, 7764, 8909, 10154, 11513, 12981, 14570, 16285, 18125, 20098, 21746, 23528, 25305, 27081, 28863, 30640, 32418, 34196, 35976, 37753, 39531, 41311, 43089, 44868, 46648, 48424, 50203, 51980, 53760, 55539, 57316, 59095, 60874, 62653, 64431, 66210, 67988, 69765, 71545, 73324, 75101, 76881, 78659, 80436, 82216, 83995, 85773, 87550, 89330, 91108, 92886, 94666, 96444, 98221, 100001, 101779, 103558, 105336, 107115, 108893, 110671, 112450, 114229, 116008, 117786]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 护盾攻击力 : {value2}
    # REMOVE: data2 = [0, 11238, 12378, 13518, 14658, 15798, 16938, 18079, 19219, 20359, 21499, 22639, 23779, 24919, 26059, 27199, 28339, 29479, 30619, 31760, 32900, 34040, 35180, 36320, 37460, 38600, 39740, 40880, 42020, 43160, 44301, 45441, 46581, 47721, 48861, 50001, 51141, 52281, 53421, 54561, 55701, 56841, 57982, 59122, 60262, 61402, 62542, 63682, 64822, 65962, 67102, 68242, 69382, 70523, 71663, 72803, 73943, 75083, 76223, 77363, 78503, 79643, 80783, 81923, 83063, 84204, 85344, 86484, 87624, 88764, 89904]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 推开距离 : {value3}px
    # REMOVE: data3 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 能量消耗值 : {value4}
    # REMOVE: data4 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 护盾大小 : {value5}px
    # REMOVE: data5 = [0, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [极冰护盾]\n
        能量消耗量 +80\n
        总攻击力 +133%\n
        护盾大小 +40%
        """
        ...

    def vp_2(self):
        """
        [极冰护盾]\n
        生成冰屋形状的保护罩\n
        - 保护罩持续期间每秒恢复自身5%的生命值\n
        - 伤害吸收量上限 +25%
        """
        ...

# 守护
# extra/creator/b1732acfaf117f8e9ff130f47d3ed0e7
# b522a95d819a5559b775deb9a490e49a/b1732acfaf117f8e9ff130f47d3ed0e7
class Skill20(ActiveSkill):
    """
        激活后， 可以发动守护系列的从属技能。\n
        点击鼠标左键可以施放[烈焰飓风]， 鼠标右键则可以施放[极冰护盾]。
    """
    name = "守护"
    learnLv = 30
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 20
    uuid = "b1732acfaf117f8e9ff130f47d3ed0e7"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 守护系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 时空增幅
# extra/creator/2ff50c35efcf0f287c4c418c8454da48
# b522a95d819a5559b775deb9a490e49a/2ff50c35efcf0f287c4c418c8454da48
class Skill21(ActiveSkill):
    """
        增幅时空裂缝的力量， 可以使用更强大的力量。\n
        增加基本攻击力、 技能攻击力和魔法暴击率。
    """
    name = "时空增幅"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    cd = 5
    uuid = "2ff50c35efcf0f287c4c418c8454da48"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 魔法暴击率增加量 : {value1}%
    # REMOVE: data1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 超能旋风波
# extra/creator/5197b141332a65a89d452adf227c2f30
# b522a95d819a5559b775deb9a490e49a/5197b141332a65a89d452adf227c2f30
class Skill22(PassiveSkill):
    """
        聚集超能旋风的力量， 向前方快速发射旋风波。\n
        按住左键的状态下拖动鼠标， 即可向指定方向发射旋风波。
    """
    name = "超能旋风波"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [81, 680]
    uuid = "5197b141332a65a89d452adf227c2f30"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 旋风波攻击力 : {value0}
    # REMOVE: data0 = [0, 1079, 1189, 1298, 1408, 1517, 1627, 1736, 1846, 1955, 2065, 2174, 2284, 2393, 2503, 2612, 2722, 2831, 2941, 3050, 3160, 3269, 3379, 3488, 3598, 3707, 3817, 3926, 4035, 4145, 4254, 4364, 4473, 4583, 4692, 4802, 4911, 5021, 5130, 5240, 5349, 5459, 5568, 5678, 5787, 5897, 6006, 6116, 6225, 6335, 6444, 6554, 6663, 6773, 6882, 6992, 7101, 7211, 7320, 7430, 7539, 7649, 7758, 7868, 7977, 8087, 8196, 8306, 8415, 8525, 8634]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 旋风波发射距离 : {value2}px
    # REMOVE: data2 = [0, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [超能旋风波]\n
        固定发动强化[超能旋风波]\n
        - 总攻击力相同\n
        强化旋风波大小 +50%
        """
        ...

    def vp_2(self):
        """
        [超能旋风波]\n
        在两侧生成旋风波风墙并向中心位置聚拢\n
        - 能量消耗量 : 35\n
        - 总攻击力相同\n
        - 不适用[创世]效果
        """
        ...

# 风暴漩涡
# extra/creator/75747c67e14eec6088ce67f63ea41628
# b522a95d819a5559b775deb9a490e49a/75747c67e14eec6088ce67f63ea41628
class Skill23(PassiveSkill):
    """
        生成风暴。\n
        可将敌人吸附到风暴中心。\n
        按住鼠标右键时， 每隔一定时间生成风暴。
    """
    name = "风暴漩涡"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [243, 2041]
    uuid = "75747c67e14eec6088ce67f63ea41628"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 风暴攻击力 : {value0}
    # REMOVE: data0 = [0, 4899, 5396, 5893, 6390, 6887, 7384, 7881, 8378, 8876, 9373, 9870, 10367, 10864, 11361, 11858, 12355, 12852, 13349, 13846, 14343, 14840, 15337, 15834, 16331, 16828, 17325, 17822, 18319, 18816, 19313, 19810, 20307, 20804, 21301, 21798, 22295, 22792, 23289, 23786, 24283, 24780, 25277, 25775, 26272, 26769, 27266, 27763, 28260, 28757, 29254, 29751, 30248, 30745, 31242, 31739, 32236, 32733, 33230, 33727, 34224, 34721, 35218, 35715, 36212, 36709, 37206, 37703, 38200, 38697, 39194]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 能量消耗值 : {value1}
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 风暴大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122, 124, 126, 128, 130, 132, 134, 136, 138, 140, 142, 144, 146, 148, 150, 152, 154, 156, 158, 160, 162, 164, 166, 168, 170, 172, 174, 176, 178, 180, 182, 184, 186, 188, 190, 192, 194, 196, 198, 200, 202, 204, 206, 208, 210, 212, 214, 216, 218, 220, 222, 224, 226, 228, 230, 232, 234, 236, 238]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [风暴漩涡]\n
        生成风暴时立即强力吸附敌人\n
        风暴大小 +40%\n
        [风暴]系列技能使用范围 +20%
        """
        ...

    def vp_2(self):
        """
        [风暴漩涡]\n
        利用裂缝的力量， 生成追踪最强敌人的次元风暴\n
        - 能量消耗量 : 70\n
        - 次元风暴持续时间上限 : 6秒\n
        - 次元风暴多段攻击次数 : 20次\n
        - 总攻击力相同\n
        - 不适用[创世]效果
        """
        ...

# 风暴
# extra/creator/d204ec03a0aed2f20211fb6ccc48d46d
# b522a95d819a5559b775deb9a490e49a/d204ec03a0aed2f20211fb6ccc48d46d
class Skill24(ActiveSkill):
    """
        激活后， 可以发动风暴系列的从属技能。\n
        点击鼠标左键可以施放[超能旋风波]， 鼠标右键则可以施放[风暴漩涡]。
    """
    name = "风暴"
    learnLv = 40
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 25
    uuid = "d204ec03a0aed2f20211fb6ccc48d46d"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 风暴系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 洞悉
# extra/creator/68062215e75d92575958873ac8ede31a
# b522a95d819a5559b775deb9a490e49a/68062215e75d92575958873ac8ede31a
class Skill25(PassiveSkill):
    """
        深刻洞悉时空之力， 可以制造强大的异次元裂缝。\n
        学习该技能后， 增加基本攻击力和技能攻击力， 并增加烈炎、 寒冰、 守护、 风暴系列的能量。
    """
    name = "洞悉"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    uuid = "68062215e75d92575958873ac8ede31a"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 烈炎、 寒冰、 守护、 风暴系列能量增加量 : {value1}
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)


    associate = [ {"data":data0,"type":"*skillDamage"}]

# 自我觉醒
# extra/creator/845e0ce3235e19f60cc82a082d072cba
# b522a95d819a5559b775deb9a490e49a/845e0ce3235e19f60cc82a082d072cba
class Skill26(PassiveSkill):
    """
        领悟自我觉醒的力量， 可以使用强大的时空之力。\n
        第一次和第二次自我觉醒时， 增加攻击速度、 移动速度、 施放速度和独立攻击力。
    """
    name = "自我觉醒"
    learnLv = 50
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "845e0ce3235e19f60cc82a082d072cba"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # - [第一次自我觉醒时] -
    # 攻击速度增加 : {value0}%
    # REMOVE: data0 = [0, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 移动速度增加 : {value1}%
    # REMOVE: data1 = [0, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 施放速度增加 : {value2}%
    # REMOVE: data2 = [0, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # - [第二次自我觉醒时] -
    # 独立攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 11]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    associate = [{"data":data3,"type":"$*PAtkI"}]

# 终末狂想
# extra/creator/5536486eaf9b13c9a8283447cb5e77ab
# b522a95d819a5559b775deb9a490e49a/5536486eaf9b13c9a8283447cb5e77ab
class Skill27(ActiveSkill):
    """
        激活后， 可以发动终末狂想系列的从属技能。\n
        点击鼠标左键或右键可以施放[末日虫洞]。
    """
    name = "终末狂想"
    learnLv = 50
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 45
    uuid = "5536486eaf9b13c9a8283447cb5e77ab"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 终末狂想系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 末日虫洞
# extra/creator/dec8961c485edb02036ba00c789010f0
# b522a95d819a5559b775deb9a490e49a/dec8961c485edb02036ba00c789010f0
class Skill28(PassiveSkill):
    """
        生成虫洞， 连接阿拉德最后的时空。\n
        在鼠标点击位置生成虫洞。\n
        生成的虫洞中坠落阿拉德行星碎片， 同时虫洞通道会逐渐压缩。\n
        虫洞通道压缩到极限时力量爆发， 引发剧烈爆炸。
    """
    name = "末日虫洞"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    cube = 2
    cd = 45
    mp = [464, 3897]
    uuid = "dec8961c485edb02036ba00c789010f0"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 行星碎片攻击力 : {value0}
    # REMOVE: data0 = [0, 807, 936, 1064, 1193, 1321, 1450, 1579, 1707, 1836, 1965, 2093, 2222, 2351, 2479, 2608, 2737, 2865, 2994, 3122, 3251, 3380, 3508, 3637, 3766, 3894, 4023, 4152, 4280, 4409, 4537, 4666, 4795, 4923, 5052, 5181, 5309, 5438, 5567, 5695, 5824, 5953, 6081, 6210, 6338, 6467, 6596, 6724, 6853, 6982, 7110]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 20
    # 行星碎片多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 虫洞大爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 39512, 45810, 52109, 58408, 64707, 71006, 77305, 83604, 89903, 96202, 102501, 108800, 115099, 121398, 127697, 133996, 140294, 146593, 152892, 159191, 165490, 171789, 178088, 184387, 190686, 196985, 203284, 209583, 215882, 222181, 228480, 234778, 241077, 247376, 253675, 259974, 266273, 272572, 278871, 285170, 291469, 297768, 304067, 310366, 316665, 322964, 329263, 335561, 341860, 348159]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 能量消耗值 : {value3}
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 虫洞大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

    def vp_1(self):
        """
        [末日虫洞]\n
        能量消耗量 -50\n
        单次攻击力 -50%\n
        施放时强力吸附范围内敌人
        """
        ...

    def vp_2(self):
        """
        [末日虫洞]\n
        召唤[终末之钟]展开隔离时间领域\n
        - 领域持续时间 : 5秒\n
        - 领域持续时间内， 敌人进入控制状态\n
        - 领域持续时间结束时爆炸大小 +30%\n
        - 领域持续时间结束或持续时间内再次按[终末狂想]技能时立即爆炸\n
        - 总攻击力相同
        """
        ...

# 构造
# extra/creator/3aacd652747f6729f079bc48747724a4
# b522a95d819a5559b775deb9a490e49a/3aacd652747f6729f079bc48747724a4
class Skill29(ActiveSkill):
    """
        激活后， 可以发动构造系列的从属技能。\n
        点击鼠标左键或右键可以施放[冰雪降临]。
    """
    name = "构造"
    learnLv = 60
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 31.5
    uuid = "3aacd652747f6729f079bc48747724a4"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 构造系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 冰雪降临
# extra/creator/d8ff976e2aaa4720272a5175d1eb9126
# b522a95d819a5559b775deb9a490e49a/d8ff976e2aaa4720272a5175d1eb9126
class Skill30(PassiveSkill):
    """
        重现冰河时代的酷寒地带。\n
        使领域内的敌人进行减速状态。\n
        按住鼠标左键或右键的状态下进行拖动， 即可手动设置冰河地带的范围。\n
        冰河地带的范围越小， 攻击力越高。\n
        冰河地带持续期间无法设置其他冰河地带。
    """
    name = "冰雪降临"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    cube = 1
    cd = 31.5
    mp = [619, 1733]
    uuid = "d8ff976e2aaa4720272a5175d1eb9126"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 冰河地带攻击力 : {value0}
    # REMOVE: data0 = [0, 1486, 1723, 1960, 2197, 2434, 2670, 2907, 3144, 3381, 3618, 3855, 4092, 4329, 4566, 4803, 5039, 5276, 5513, 5750, 5987, 6224, 6461, 6698, 6935, 7172, 7408, 7645, 7882, 8119, 8356, 8593, 8830, 9067, 9304, 9541, 9777, 10014, 10251, 10488, 10725, 10962, 11199, 11436, 11673, 11910, 12146, 12383, 12620, 12857, 13094]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 21
    # 冰河地带多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21, 21]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 不同范围的攻击力增加率 : 0%~{value2}%
    # REMOVE: data2 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 能量消耗值 : {value3}
    # REMOVE: data3 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [减速效果]
    # 减速几率 : {value4}%
    # REMOVE: data4 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 减速持续时间 : {value5}秒
    # REMOVE: data5 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 减速状态移动速度减少率 : {value6}%
    # REMOVE: data6 = [0, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 减速状态攻击速度减少率 : {value7}%
    # REMOVE: data7 = [0, 16, 16.3, 16.6, 16.9, 17.2, 17.5, 17.8, 18.1, 18.4, 18.7, 19, 19.3, 19.6, 19.9, 20.2, 20.5, 20.8, 21.1, 21.4, 21.7, 22, 22.3, 22.6, 22.9, 23.2, 23.5, 23.8, 24.1, 24.4, 24.7, 25, 25.3, 25.6, 25.9, 26.2, 26.5, 26.8, 27.1, 27.4, 27.7, 28, 28.3, 28.6, 28.9, 29.2, 29.5, 29.8, 30.1, 30.4, 30.7]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [范围信息]
    # 冰河地带大小比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)

    skillDamage = 1.2

    def vp_1(self):
        """
        [冰雪降临]\n
        按住鼠标键拖动时， 根据鼠标移动轨迹生成冰河地带\n
        - 能量消耗量 -48\n
        - 总攻击力相同\n
        不适用不同范围的攻击力增加率效果
        """
        ...

    def vp_2(self):
        """
        [冰雪降临]\n
        直接点击敌人， 生成追踪敌人的冰河地带\n
        - 没有敌人存在时无法生成\n
        - 可以重复布置\n
        - 减速持续时间 +4秒
        """
        ...

# 同调
# extra/creator/b1ccbd90d0b40f543ece3b18fcef827f
# b522a95d819a5559b775deb9a490e49a/b1ccbd90d0b40f543ece3b18fcef827f
class Skill31(ActiveSkill):
    """
        激活后， 可以发动同调系列的从属技能。\n
        点击鼠标左键可以召唤卡巴拉， 鼠标右键则可以激活[时空链接]。
    """
    name = "同调"
    learnLv = 70
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 54
    uuid = "b1ccbd90d0b40f543ece3b18fcef827f"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 同调系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 时空链接
# extra/creator/394e2f09c1f37ae61d831d8567707170
# b522a95d819a5559b775deb9a490e49a/394e2f09c1f37ae61d831d8567707170
class Skill32(PassiveSkill):
    """
        在空地点击鼠标左键可以召唤时间妖精“卡巴拉”实现连接。\n
        点击右键会跟被连接的角色以红色实线连接。\n
        可以通过点击鼠标左键连接队员。\n
        在没有卡巴拉的情况下无法连接。
    """
    name = "时空链接"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 2
    cube = 3
    cd = 54
    mp = [1098, 2305]
    uuid = "394e2f09c1f37ae61d831d8567707170"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 红色实线攻击力 : {value0}
    # REMOVE: data0 = [0, 1924, 2119, 2314, 2509, 2705, 2900, 3095, 3290, 3485, 3681, 3876, 4071, 4266, 4461, 4656, 4852, 5047, 5242, 5437, 5632, 5828, 6023, 6218, 6413, 6608, 6803, 6999, 7194, 7389, 7584, 7779, 7974, 8170, 8365, 8560, 8755, 8950, 9146, 9341, 9536, 9731, 9926, 10121, 10317, 10512, 10707, 10902, 11097, 11293, 11488]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 35
    # 红色实线多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [时空链接]连接线持续时间 : {value2}秒
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 卡巴拉持续时间 : {value3}秒
    # REMOVE: data3 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 能量消耗值 : {value4}
    # REMOVE: data4 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

    def vp_1(self):
        """
        [时空链接]\n
        可以通过直接点击敌人进行连接\n
        - 可以通过点击鼠标左键选择敌人\n
        - 没有卡巴拉时无法选择敌人\n
        - 敌人选择数量上限 : 2个\n
        连接期间适用回避率增益及减益效果\n
        - 自身回避率 +15%\n
        - 连接的敌人回避率 -15%
        """
        ...

    def vp_2(self):
        """
        [时空链接]\n
        连接队友时， 自身和队友获得所受伤害减少增益\n
        - 能量消耗量 +50\n
        - 连接线持续时间 +5秒\n
        - 总攻击力 +100%\n
        - 连接1名队友时， 所受伤害 -5%\n
        - 连接2名队友时， 所受伤害 -10%\n
        - 连接3名队友时， 所受伤害 -15%
        """
        ...

# 创世之力
# extra/creator/9376d04c476cd41d60ed1974ca69ab95
# b522a95d819a5559b775deb9a490e49a/9376d04c476cd41d60ed1974ca69ab95
class Skill33(PassiveSkill):
    """
        缔造者完全恢复时空之力， 获得创世的力量。\n
        增加基本攻击力和技能攻击力， 并增加烈炎、 寒冰、 守护、 风暴系列的能量。
    """
    name = "创世之力"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    uuid = "9376d04c476cd41d60ed1974ca69ab95"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 烈炎、 寒冰、 守护、 风暴系列能量增加量 : {value1}
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 虚空
# extra/creator/dacd5c2848a1eb33489e5471f1a73759
# b522a95d819a5559b775deb9a490e49a/dacd5c2848a1eb33489e5471f1a73759
class Skill34(ActiveSkill):
    """
        激活后， 可以发动虚空系列的从属技能。\n
        点击鼠标左键或右键可以施放[时空禁制]。
    """
    name = "虚空"
    learnLv = 80
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 45
    uuid = "dacd5c2848a1eb33489e5471f1a73759"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 虚空系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 时空禁制
# extra/creator/bae12a6dc7d22a5cf149673e88ddda28
# b522a95d819a5559b775deb9a490e49a/bae12a6dc7d22a5cf149673e88ddda28
class Skill35(PassiveSkill):
    """
        通过时间妖精“卡巴拉”之力， 使时间加速， 限制周围目标行动。\n
        在鼠标左键点击的位置召唤“卡巴拉”，在持续时间内强制控制敌人， 最后随着爆炸消失。
    """
    name = "时空禁制"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    cube = 5
    cd = 45
    mp = [1317, 9877]
    uuid = "bae12a6dc7d22a5cf149673e88ddda28"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 卡巴拉领域攻击力 : {value0}
    # REMOVE: data0 = [0, 2149, 2491, 2834, 3176, 3519, 3862, 4204, 4547, 4889, 5232, 5574, 5917, 6260, 6602, 6945, 7287, 7630, 7972, 8315, 8657, 9000, 9343, 9685, 10028, 10370, 10713, 11055, 11398, 11741, 12083, 12426, 12768, 13111, 13453, 13796, 14138, 14481, 14824, 15166, 15509, 15851, 16194, 16536, 16879, 17222, 17564, 17907, 18249, 18592, 18934]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 30
    # 卡巴拉领域多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 卡巴拉爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 64464, 74741, 85018, 95295, 105571, 115848, 126125, 136402, 146679, 156956, 167233, 177510, 187786, 198063, 208340, 218617, 228894, 239171, 249448, 259725, 270001, 280278, 290555, 300832, 311109, 321386, 331663, 341939, 352216, 362493, 372770, 383047, 393324, 403601, 413878, 424154, 434431, 444708, 454985, 465262, 475539, 485816, 496093, 506369, 516646, 526923, 537200, 547477, 557754, 568031]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 卡巴拉召唤持续时间 : {value3}秒
    # REMOVE: data3 = [0, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 能量消耗值 : {value4}
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 领域大小比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [时空禁制]\n
        卡巴拉出现后立即爆炸\n
        - 总攻击力相同\n
        卡巴拉大小 +20%
        """
        ...

    def vp_2(self):
        """
        [时空禁制]\n
        在卡巴拉领域内时， 获得速度增益\n
        - 卡巴拉召唤持续时间 +2.5秒\n
        - 移动速度 +50%\n
        卡巴拉领域会附加减速异常状态\n
        - 移动速度减少量 : 70%\n
        - 攻击速度减少量 : 25%
        """
        ...

# 缔造
# extra/creator/c47b66efd27845ef14954928ea2f95c8
# b522a95d819a5559b775deb9a490e49a/c47b66efd27845ef14954928ea2f95c8
class Skill36(ActiveSkill):
    """
        激活后， 可以发动缔造系列的从属技能。\n
        点击鼠标左键可以施放[创世]， 点击鼠标右键可以施放[生命之树]。
    """
    name = "缔造"
    learnLv = 85
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 180
    uuid = "c47b66efd27845ef14954928ea2f95c8"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 缔造系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 创世
# extra/creator/1c1a9606eb702ebe5a7bb4397f3aeae0
# b522a95d819a5559b775deb9a490e49a/1c1a9606eb702ebe5a7bb4397f3aeae0
class Skill37(PassiveSkill):
    """
        召唤蕴含创世之力的卡巴拉， 强化烈炎、 寒冰、 风暴系列技能。 \n
        缔造状态下用烈炎、 寒冰、 风暴系列技能命中时， 减少[创世]的冷却时间。
    """
    name = "创世"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [3727, 7454]
    uuid = "1c1a9606eb702ebe5a7bb4397f3aeae0"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # [烈火燎原]能量消耗值增加 : {value0}%
    # REMOVE: data0 = [0, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650, 1650]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 强化[烈火燎原]持续时间 : {value1}秒
    # REMOVE: data1 = [0, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [炽炎星陨]能量消耗值增加 : {value2}%
    # REMOVE: data2 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 强化[炽炎星陨]陨石数量 : {value3}
    # REMOVE: data3 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [冰霜之球]能量消耗值增加 : {value4}%
    # REMOVE: data4 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 强化[冰霜之球]发射数量 : {value5}
    # REMOVE: data5 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [冰天震地]能量消耗值增加率 : {value6}%
    # REMOVE: data6 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 强化[冰天震地]冰盘数量 : {value7}
    # REMOVE: data7 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [超能旋风波]能量消耗值增加 : {value8}%
    # REMOVE: data8 = [0, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050, 1050]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 强化[超能旋风波]持续时间 : {value9}秒
    # REMOVE: data9 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # [风暴漩涡]能量消耗值增加 : {value10}%
    # REMOVE: data10 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 强化[风暴漩涡]持续时间 : {value11}秒
    # REMOVE: data11 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 时间妖精持续时间 : {value12}秒
    # REMOVE: data12 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 生命之树持续时间 : {value13}秒
    # REMOVE: data13 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)
    # 使用强化系列技能命中时， [创世]冷却时间减少量 : {value14}秒
    # REMOVE: data14 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14)
    # 使用强化系列技能命中时， [创世]冷却时间减少量上限 : {value15}秒
    # REMOVE: data15 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15)
    # 能量消耗值 : {value16}
    # REMOVE: data16 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data16 = get_data(f'{prefix}/{uuid}', 16)

# 生命之树
# extra/creator/66a9967e677651d0def34c475795ccde
# b522a95d819a5559b775deb9a490e49a/66a9967e677651d0def34c475795ccde
class Skill38(PassiveSkill):
    """
        召唤蕴含创世之力的卡巴拉， 创造出长有烈炎、 寒冰、 风暴之果实的生命之树并使其爆炸。\n
        可以通过按住鼠标左键拖拽或右键点击， 使元素果实向指定的位置投掷或爆炸。\n
        在树上时， 按跳跃键可以引爆全部果实。\n
        爆炸的攻击力与树上剩余果实数量成正比。\n
        烈炎和寒冰果实会额外受到武器攻击属性影响。
    """
    name = "生命之树"
    learnLv = 85
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [4000, 4000]
    uuid = "66a9967e677651d0def34c475795ccde"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 每个元素果实爆炸攻击力 : {value0}
    # REMOVE: data0 = [0, 86027]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 0
    # 元素果实同时爆炸攻击力 : {value1} X 剩余果实数
    # REMOVE: data1 = [0, 77424]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 6
    # 能量消耗值 : {value2}
    # REMOVE: data2 = [0, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    mode = ["秒炸","常规"]

    def setMode(self, mode):
        if mode == "秒炸":
            self.hit0 = 0
            self.hit1 = 6
        elif mode == "常规":
            self.hit0 = 6
            self.hit1 = 0

# 天工开物
# extra/creator/8eeca98333667959c403104f6d24da34
# b522a95d819a5559b775deb9a490e49a/8eeca98333667959c403104f6d24da34
class Skill39(PassiveSkill):
    """
        知源·缔造者通过创世神器， 重塑时空之力。\n
        增加基本攻击力和技能攻击力， 寒冰系列技能附加特殊效果。\n
    [冰霜之球]\n
        增加冰霜之球的大小和攻击范围， 多段攻击次数固定为3次。\n
        [创世]法米利尔出现时， 增加冰霜岩石的大小和攻击范围， 多段攻击次数固定为10次。\n
    [冰天震地]\n
        将[冰天震地]消耗能量的一定数值转化为[冰霜之球]的能量。
    """
    name = "天工开物"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 3
    uuid = "8eeca98333667959c403104f6d24da34"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [冰霜之球]攻击力增加率 : 100%
    # 强化[冰霜之球]攻击力增加率 : 105%
    # [冰霜之球]能量恢复率 :  {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 创生
# extra/creator/1bf9711f3f15865e38d7dce51c6b5a8c
# b522a95d819a5559b775deb9a490e49a/1bf9711f3f15865e38d7dce51c6b5a8c
class Skill40(ActiveSkill):
    """
        激活后， 可以发动创生系列的从属技能。\n
        点击鼠标左键或右键可以施放[创世之光]。
    """
    name = "创生"
    learnLv = 95
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    cd = 60
    uuid = "1bf9711f3f15865e38d7dce51c6b5a8c"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 创生系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 创世之光
# extra/creator/bcbaa4338139bc9342c8a8415dfbe39a
# b522a95d819a5559b775deb9a490e49a/bcbaa4338139bc9342c8a8415dfbe39a
class Skill41(PassiveSkill):
    """
        发动创世神器的力量， 生成与太初时间相连的魔法门。\n
        魔法门持续期间内输入创生系列技能时， 注入创世能量， 立即引发爆炸。\n
        如果没有注入能量， 则一段时间后自动爆炸。\n
        注入能量时， 增加创世之光的爆炸范围。
    """
    name = "创世之光"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [773, 6000]
    uuid = "bcbaa4338139bc9342c8a8415dfbe39a"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 魔法门持续时间 : {value0}秒
    # REMOVE: data0 = [0, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 太初之光爆炸攻击力 : {value1}
    # REMOVE: data1 = [0, 235481, 259370, 283260, 307149, 331039, 354928, 378817, 402707, 426596, 450485, 474375, 498264, 522154, 546043, 569932, 593822, 617711, 641600, 665490, 689379, 713269, 737158, 761047, 784937, 808826, 832715, 856605, 880494, 904384, 928273, 952162, 976052, 999941, 1023830, 1047720, 1071609, 1095499, 1119388, 1143277, 1167167, 1191056, 1214945, 1238835, 1262724, 1286614, 1310503, 1334392, 1358282, 1382171, 1406060]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 能量消耗量 : {value2}
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 命运
# extra/creator/3736fe00a26b0086c23db9a4426a5641
# b522a95d819a5559b775deb9a490e49a/3736fe00a26b0086c23db9a4426a5641
class Skill43(ActiveSkill):
    """
        激活后， 可以发动命运系列的从属技能。\n
        点击鼠标左键或右键可以施放[时之终末 : 归烬]。\n
    [三次自我觉醒]\n
        使用三次自我觉醒技能时， 与关联的技能共享冷却时间。\n
        若关联的技能还在冷却中， 则无法使用三次自我觉醒技能。
    """
    name = "命运"
    learnLv = 100
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 5
    cd = 290
    uuid = "3736fe00a26b0086c23db9a4426a5641"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 命运系列的能量值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 时之终末 : 归烬
# extra/creator/03bd172c9c50cfdcf9d7e83a3ef82842
# b522a95d819a5559b775deb9a490e49a/03bd172c9c50cfdcf9d7e83a3ef82842
class Skill44(PassiveSkill):
    """
        展开创世魔法书， 对时间进行干涉， 移动到时之终末。\n
        卡巴拉变成巨型钟表指向12点时， 次元爆炸， 湮灭敌人。\n
    [三次自我觉醒]\n
        使用三次自我觉醒技能时， 与关联的技能共享冷却时间。\n
        若关联的技能还在冷却中， 则无法使用三次自我觉醒技能。
    """
    name = "时之终末 : 归烬"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "03bd172c9c50cfdcf9d7e83a3ef82842"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 时间加速攻击力 : {value0}
    # REMOVE: data0 = [0, 21264, 26195, 31126, 36057, 40988, 45919, 50850, 55781, 60711, 65642, 70573, 75504, 80435, 85366, 90297, 95228, 100158, 105089, 110020, 114951, 119882, 124813, 129744, 134675, 139605, 144536, 149467, 154398, 159329, 164260, 169191, 174122, 179052, 183983, 188914, 193845, 198776, 203707, 208638, 213569, 218499, 223430, 228361, 233292, 238223, 243154, 248085, 253016, 257946, 262877]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 9
    # 时间加速多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 次元爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 446552, 550101, 653649, 757198, 860746, 964294, 1067843, 1171391, 1274939, 1378488, 1482036, 1585585, 1689133, 1792681, 1896230, 1999778, 2103327, 2206875, 2310423, 2413972, 2517520, 2621068, 2724617, 2828165, 2931714, 3035262, 3138810, 3242359, 3345907, 3449455, 3553004, 3656552, 3760101, 3863649, 3967197, 4070746, 4174294, 4277843, 4381391, 4484939, 4588488, 4692036, 4795584, 4899133, 5002681, 5106230, 5209778, 5313326, 5416875, 5520423]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 能量消耗量 : {value3}
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'creator'
        self.nameCN = '知源·缔造者'
        self.role = 'extra'
        self.角色 = '外传1'
        self.职业 = '缔造者'
        self.jobId = 'b522a95d819a5559b775deb9a490e49a'
        self.jobGrowId = '0a49d9c8b5e1358efff324e5cb11d41e'

        self.武器选项 = ['扫把','魔杖', '法杖', '矛', '棍棒'] # TODO
        self.输出类型选项 = ["魔法固伤"] # TODO
        self.输出类型 = '魔法固伤' # TODO
        self.防具精通属性 = ['智力'] # TODO
        self.防具类型 = '板甲'
        self.buff = 1.729 # TODO

        super().__init__(equVersion, __name__)
