from core.basic.property import CharacterProperty
import core.equipment.entry_0.params as pa

asrahan_infos = [{
    "type":0,
    "name":"雷电",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>技能伤害 +{2}%<br/><br/>@[天雷加速]@<br/>接收天雷之力，所有速度 +{3}%<br/><br/>@[过度填充]@<br/>天雷超负荷状态下攻击时，会发动电击。 (冷却时间{4}秒)<br/>- 电击伤害量{5}%",
    "lvinfo": [
        {"lv":1,"params":[380,0,3,15,0,0]},
        {"lv":2,"params":[399,35,3,15,0,0]},
        {"lv":3,"params":[418,70,3,15,0,0]},
        {"lv":4,"params":[437,105,3,15,0,0]},
        {"lv":5,"params":[817,105,5,25,0,0]},
        {"lv":6,"params":[836,140,5,25,0,0]},
        {"lv":7,"params":[855,175,5,25,0,0]},
        {"lv":8,"params":[874,210,5,25,0,0]},
        {"lv":9,"params":[893,245,5,25,0,0]},
        {"lv":10,"params":[1273,245,7,25,5,3053]},
        {"lv":11,"params":[1292,280,7,25,5,3053]},
        {"lv":12,"params":[1311,315,7,25,5,3053]},
        {"lv":13,"params":[1330,350,7,25,5,3053]},
        {"lv":14,"params":[1349,385,7,25,5,3053]},
        {"lv":15,"params":[1729,385,9,25,3,3053]},
        {"lv":16,"params":[1748,420,9,25,3,3053]},
        {"lv":17,"params":[1767,455,9,25,3,3053]},
        {"lv":18,"params":[1786,490,9,25,3,3053]},
        {"lv":19,"params":[1805,525,9,25,3,3053]},
        {"lv":20,"params":[1824,525,9,25,3,3053]},
    ],
    "prefix":"雷 : ",
    "max":"增益量 380<br/><br/>@[狂舞之雷]@<br/>进入地下城时，重现狂舞之雷。<br/>- 技能伤害 +5%<br/>- 所有速度 +30%<br/>- 电击发动冷却时间 -2秒"
  },{
    "type":1,
    "name":"清风",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>50、85、100级主动技能攻击力 +{2}%<br/><br/>@[肆虐风暴]@<br/>施放觉醒技能时，生成{5}个攻击敌人的肆虐风暴。<br>- 肆虐风暴伤害量{3}%<br/><br/>@[风神庇佑]@<br/>受到风神庇佑，所有速度 +{4}%",
    "lvinfo": [
        {"lv":1,"params":[380,0,10,4585,0,1]},
        {"lv":2,"params":[399,35,10,4585,0,1]},
        {"lv":3,"params":[418,70,10,4585,0,1]},
        {"lv":4,"params":[437,105,10,4585,0,1]},
        {"lv":5,"params":[817,105,17,4585,15,1]},
        {"lv":6,"params":[836,140,17,4585,15,1]},
        {"lv":7,"params":[855,175,17,4585,15,1]},
        {"lv":8,"params":[874,210,17,4585,15,1]},
        {"lv":9,"params":[893,245,17,4585,15,1]},
        {"lv":10,"params":[1273,245,24,9170,15,1]},
        {"lv":11,"params":[1292,280,24,9170,15,1]},
        {"lv":12,"params":[1311,315,24,9170,15,1]},
        {"lv":13,"params":[1330,350,24,9170,15,1]},
        {"lv":14,"params":[1349,385,24,9170,15,1]},
        {"lv":15,"params":[1729,385,31,9170,15,2]},
        {"lv":16,"params":[1748,420,31,9170,15,2]},
        {"lv":17,"params":[1767,455,31,9170,15,2]},
        {"lv":18,"params":[1786,490,31,9170,15,2]},
        {"lv":19,"params":[1805,525,31,9170,15,2]},
        {"lv":20,"params":[1824,525,31,9170,15,2]}
    ],
    "prefix":"风 : ",
    "max":"增益量 380<br/><br/>@[苍穹之风]@<br/>进入地下城时，重现苍穹之风。<br/>- 技能伤害 +2%<br/>- 50、85、100级主动技能攻击力 +7%<br/>- 获得生命值最大值30%数值的保护罩<br/>- 攻击时，生成肆虐风暴。 (冷却时间3秒)"
  },
  {
    "type":2,
    "name":"白雪",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>技能冷却时间恢复速度 +{2}% (觉醒技能除外)<br/>所有速度 +10%<br/><br/>@[命运卡牌]@<br/>每10秒抽取一次命运卡牌，根据卡牌赋予效果。<br/><br/>* 红日之命运(50%)<br/>  - 回避率 +{3}%<br/><br/>* 蓝月之命运(50%)<br/>  - 物理/魔法所受伤害 -{4}%<br/><br/>* 耀星之命运 ({5}%)<br/>  - 回避率 +20%<br/>  - 物理/魔法所受伤害 -20%",
    "lvinfo": [
        {"lv":1,"params":[380,0,11,10,10,0]},
        {"lv":2,"params":[399,35,11,10,10,0]},
        {"lv":3,"params":[418,70,11,10,10,0]},
        {"lv":4,"params":[437,105,11,10,10,0]},
        {"lv":5,"params":[817,105,21,15,15,0]},
        {"lv":6,"params":[836,140,21,15,15,0]},
        {"lv":7,"params":[855,175,21,15,15,0]},
        {"lv":8,"params":[874,210,21,15,15,0]},
        {"lv":9,"params":[893,245,21,15,15,0]},
        {"lv":10,"params":[1273,245,31,15,15,10]},
        {"lv":11,"params":[1292,280,31,15,15,10]},
        {"lv":12,"params":[1311,315,31,15,15,10]},
        {"lv":13,"params":[1330,350,31,15,15,10]},
        {"lv":14,"params":[1349,385,31,15,15,10]},
        {"lv":15,"params":[1729,385,41,15,15,30]},
        {"lv":16,"params":[1748,420,41,15,15,30]},
        {"lv":17,"params":[1767,455,41,15,15,30]},
        {"lv":18,"params":[1786,490,41,15,15,30]},
        {"lv":19,"params":[1805,525,41,15,15,30]},
        {"lv":20,"params":[1824,525,41,15,15,30]}
    ],
    "prefix":"霜 : ",
    "max":"增益量 380<br/><br/>@[命运之雪]@<br/>进入地下城时，重现命运之雪。<br/>- 技能伤害 +2%<br/>- 技能冷却时间恢复速度 +20% (觉醒技能除外)<br/>- 适用耀星之命运效果"
  },{
    "type":3,
    "name":"业火",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>技能伤害 +{2}%<br/><br/>@[火焰绽裂]@<br/>攻击时，施放火焰绽裂。 (冷却时间{3}秒)<br>- 火焰绽裂伤害量{4}%<br/><br/>@[火焰回响]@<br/>施放3次火焰绽裂时，追加施放{5}次火焰绽裂。",
    "lvinfo": [
        {"lv":1,"params":[380,0,3,3,2751,0]},
        {"lv":2,"params":[399,35,3,3,2751,0]},
        {"lv":3,"params":[418,70,3,3,2751,0]},
        {"lv":4,"params":[437,105,3,3,2751,0]},
        {"lv":5,"params":[817,105,5,3,5502,0]},
        {"lv":6,"params":[836,140,5,3,5502,0]},
        {"lv":7,"params":[855,175,5,3,5502,0]},
        {"lv":8,"params":[874,210,5,3,5502,0]},
        {"lv":9,"params":[893,245,5,3,5502,0]},
        {"lv":10,"params":[1273,245,7,3,5502,1]},
        {"lv":11,"params":[1292,280,7,3,5502,1]},
        {"lv":12,"params":[1311,315,7,3,5502,1]},
        {"lv":13,"params":[1330,350,7,3,5502,1]},
        {"lv":14,"params":[1349,385,7,3,5502,1]},
        {"lv":15,"params":[1729,385,9,2,5502,1]},
        {"lv":16,"params":[1748,420,9,2,5502,1]},
        {"lv":17,"params":[1767,455,9,2,5502,1]},
        {"lv":18,"params":[1786,490,9,2,5502,1]},
        {"lv":19,"params":[1805,525,9,2,5502,1]},
        {"lv":20,"params":[1824,525,9,2,5502,1]}
    ],
    "prefix":"焰 : ",
    "max":"增益量 380<br/><br/>@[爆裂之火]@<br/>进入地下城时，重现爆裂之火。<br/>- 技能伤害 +5%<br/>- 技能范围 +30%<br/>- 强化的火焰绽裂冷却时间 -1秒"
  },
  {
    "type":4,
    "name":"流水",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>技能伤害 +{2}%<br/><br/>@[四季的祝福]@<br/>激活四季的祝福，强化自身并给所有队员赋予50%效果的祝福。<br/>- 相同的祝福无法叠加<br/><br/>* 暖春的祝福<br/>  - 技能伤害 +{3}%<br/><br/>* 盛夏的祝福<br/>  - 每10秒恢复{4}%的生命值和魔法值，持续10秒。<br/><br/>* 金秋的祝福<br/>  - 物理/魔法所受伤害 -{5}%<br/><br/>* 凛冬的祝福<br/>  - 所有速度 +{6}%",
    "lvinfo": [
        {"lv":1,"params":[380,0,2,1,0,0,0]},
        {"lv":2,"params":[399,35,2,1,0,0,0]},
        {"lv":3,"params":[418,70,2,1,0,0,0]},
        {"lv":4,"params":[437,105,2,1,0,0,0]},
        {"lv":5,"params":[817,105,4,1,10,0,0]},
        {"lv":6,"params":[836,140,4,1,10,0,0]},
        {"lv":7,"params":[855,175,4,1,10,0,0]},
        {"lv":8,"params":[874,210,4,1,10,0,0]},
        {"lv":9,"params":[893,245,4,1,10,0,0]},
        {"lv":10,"params":[1273,245,6,1,10,10,0]},
        {"lv":11,"params":[1292,280,6,1,10,10,0]},
        {"lv":12,"params":[1311,315,6,1,10,10,0]},
        {"lv":13,"params":[1330,350,6,1,10,10,0]},
        {"lv":14,"params":[1349,385,6,1,10,10,0]},
        {"lv":15,"params":[1729,385,8,1,10,10,10]},
        {"lv":16,"params":[1748,420,8,1,10,10,10]},
        {"lv":17,"params":[1767,455,8,1,10,10,10]},
        {"lv":18,"params":[1786,490,8,1,10,10,10]},
        {"lv":19,"params":[1805,525,8,1,10,10,10]},
        {"lv":20,"params":[1824,525,8,1,10,10,10]},
    ],
    "prefix":"雨 : ",
    "max":"增益量 380<br/><br/>@[四季之歌]@<br/>进入地下城时，重现四季之歌。<br/>- 技能伤害 +5%<br/>- 韧性条减少量 +10%<br/>- 赋予队友100%效果的[四季的祝福]"
  },  {
    "type":5,
    "name":"失衡",
    "desc": "增益量 {0}<br/>攻击强化 +{1}%<br/>技能伤害 +{2}%<br/><br/>物理/魔法暴击率 +{3}%<br/><br/>移动速度 +{4}%<br/><br/>攻击速度 +{5}%<br/>施放速度 +{5}%<br/><br/>所有属性强化 +{6}",
    "lvinfo": [
        {"lv":1,"params":[380,0,3,5,0,0,0]},
        {"lv":2,"params":[399,35,3,5,0,0,0]},
        {"lv":3,"params":[418,70,3,5,0,0,0]},
        {"lv":4,"params":[437,105,3,5,0,0,0]},
        {"lv":5,"params":[817,105,5,5,15,0,0]},
        {"lv":6,"params":[836,140,5,5,15,0,0]},
        {"lv":7,"params":[855,175,5,5,15,0,0]},
        {"lv":8,"params":[874,210,5,5,15,0,0]},
        {"lv":9,"params":[893,245,5,5,15,0,0]},
        {"lv":10,"params":[1273,245,7,5,15,15,0]},
        {"lv":11,"params":[1292,280,7,5,15,15,0]},
        {"lv":12,"params":[1311,315,7,5,15,15,0]},
        {"lv":13,"params":[1330,350,7,5,15,15,0]},
        {"lv":14,"params":[1349,385,7,5,15,15,0]},
        {"lv":15,"params":[1729,385,7,5,15,15,14]},
        {"lv":16,"params":[1748,420,7,5,15,15,14]},
        {"lv":17,"params":[1767,455,7,5,15,15,14]},
        {"lv":18,"params":[1786,490,7,5,15,15,14]},
        {"lv":19,"params":[1805,525,7,5,15,15,14]},
        {"lv":20,"params":[1824,525,7,5,15,15,14]}
    ],
    "prefix":"失衡 : ",
    "max":"增益量 380<br/><br/>@[失衡之契]@<br/>进入地下城时，重现失衡之契。<br/>- 技能伤害 +5%<br/>- 攻击时，恢复1%的生命值和魔法值。 (冷却时间1秒)"
  }
]

def asrahan_effect(char: CharacterProperty = {}, type=-1,lv = 0,additional=0):
    if type < 0 or lv + additional == 0:
        return
    char.技能攻击力加成(0.01*additional)
    char.辅助属性加成(buff量=190*additional)
    lastLv = lv + additional
    params = asrahan_infos[type]["lvinfo"][lastLv-1]["params"]
    # 基础属性部分
    char.辅助属性加成(buff量=params[0])
    char.攻击强化加成(params[1])
    # 金
    if type == 0:
        char.技能攻击力加成(params[2]/100)
        if lastLv >= 1:
            char.所有速度增加(0.15,'武器')
        if lastLv >= 5:
            char.所有速度增加(0.1,'武器')
        if lastLv >= 20:
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
            char.技能攻击力加成( 0.05)
            char.所有速度增加(0.3,'武器')
    # 木
    if type == 1:
        for i in [50,85,100]:
            char.技能倍率加成(i,i,params[2]/100)
        if lastLv >= 5:
            char.所有速度增加(0.15,'武器')
        if lastLv >= 20:
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
            char.技能攻击力加成(0.02)
            for i in [50,85,100]:
                char.技能倍率加成(i,i,0.07*pa.ws_rate)
    # 水
    if type == 2:
        char.技能恢复加成(1,100,params[2]/100, excName=char.觉醒技能)
        if lastLv >= 1:
            char.所有速度增加(0.1,'武器')
        if lastLv >= 20:
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
            char.技能攻击力加成(0.02)
            char.技能恢复加成(1,100,0.2, excName=char.觉醒技能)
    # 火
    if type == 3:
        char.技能攻击力加成(params[2]/100)
        if lastLv >= 20:
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
            char.技能攻击力加成(0.05)
            char.set_eq_params('skill_range', char.get_eq_params('skill_range')+ 0.3)
            char.multiply_eq_params('skill_range_multi',1+ 0.3)
    # 土
    if type == 4:
        char.技能攻击力加成(params[2]/100)
        if lastLv >= 1:
            char.技能攻击力加成(0.01)
            if char.类型 == '辅助':
                char.被动增伤倍率 *= 1 + 0.005 + 0.005 * (pa.ws_rate if lastLv >= 20 else 0)
        if lastLv >= 15:
            char.所有速度增加(0.1,'武器')
        if lastLv >= 20:
            char.技能攻击力加成( 0.05)
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
    # 失调
    if type == 5:
        char.技能攻击力加成(params[2]/100)
        if lastLv >= 5:
            char.移动速度增加(0.15)
        if lastLv >= 10:
            char.施放速度增加(0.15)
            char.攻击速度增加(0.15,'武器')
        if lastLv >= 15:
            char.所有属性强化加成(14)
        if lastLv >= 20:
            char.技能攻击力加成(0.05)
            if char.类型 == '辅助':
                char.辅助属性加成(buff量=380)
            # char.所有速度增加( 0.3,'武器')