from core.basic.character import Character
from core.basic.skill import 主动技能, 技能, 被动技能


class 缔造主动技能(主动技能):
    def 手搓CD(self):
        cdr = 0
        if self.手搓:
            if self.所在等级 >= 15 and self.所在等级 <= 30:
                cdr = 0.01 * self.手搓收益
            if self.所在等级 >= 35 and self.所在等级 <= 70:
                cdr = 0.02 * self.手搓收益
            if self.所在等级 >= 75 and self.所在等级 <= 100:
                cdr = 0.05 * self.手搓收益
            if self.所在等级 in [85, 100]:
                cdr = 0.05 * self.手搓收益
        return cdr

    国服特色 = 1.065


class 技能0(缔造主动技能):
    名称 = "烈火燎原"
    所在等级 = 1
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 5
    MP = [24, 252]
    无色消耗 = 0
    data0 = [0, 38, 52, 69, 82, 100, 106, 120, 136, 150, 163, 181, 194, 209, 220, 235, 251, 266, 281, 290, 303, 319, 333, 346, 364, 375, 392, 405, 418, 434, 448, 464, 474, 486, 503, 516, 530, 544, 559, 573, 588, 602, 618, 631, 648, 656, 670, 687, 699, 714, 727, 742, 758, 772, 784, 802, 816, 823, 839, 854, 869, 883, 894, 910, 923, 942, 958, 969, 987, 1000, 1005]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 7

    power0 = 0
    能量 = 140
    最小值 = 4
    持续秒数 = 6.0
    硬直时长百分比 = 0

    国服特色 = 1.05

    形态 = ['普通', '觉醒']

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 70
            self.power0 = 觉醒后能量消耗 / self.最小值
#            self.data0 = [int(x * 觉醒后能量消耗 / self.最小值) for x in self.data0]
#            self.data0 = [0.5*x for x in data0]
            # self.最小值 = 觉醒后能量消耗


class 技能1(缔造主动技能):
    名称 = "炽炎星陨"
    所在等级 = 1
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 5
    MP = [3, 36]
    无色消耗 = 0
    data0 = [0, 195, 267, 337, 405, 474, 544, 614, 684, 753, 822, 890, 962, 1031, 1100, 1170, 1236, 1309, 1377, 1447, 1517, 1588, 1656, 1726, 1793, 1864, 1936, 2004, 2073, 2141, 2211, 2282, 2351, 2421, 2487, 2556, 2629, 2695, 2767, 2833, 2904, 2976, 3044, 3112, 3184, 3255, 3321, 3393, 3460, 3530, 3603, 3669, 3737, 3807, 3879, 3948, 4018, 4083, 4156, 4226, 4294, 4365, 4432, 4501, 4574, 4643, 4710, 4781, 4850, 4920, 4990]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 7

    power0 = 0
    能量 = 140
    最小值 = 20
    持续秒数 = 1.0
    硬直时长百分比 = 0

    形态 = ['普通', '觉醒']

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 70
            self.power0 = 觉醒后能量消耗 / self.最小值


class 技能2(缔造主动技能):
    名称 = "冰霜之球"
    所在等级 = 10
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 10
    MP = [4, 40]
    无色消耗 = 0
    data0 = [0, 112, 128, 144, 159, 178, 193, 209, 227, 243, 257, 275, 292, 308, 323, 341, 357, 373, 392, 406, 423, 442, 455, 471, 490, 507, 523, 539, 555, 572, 589, 607, 623, 638, 654, 670, 688, 705, 720, 737, 752, 770, 787, 802, 818, 836, 850, 866, 884, 900, 917, 933, 949, 966, 982, 1000, 1015, 1032, 1049, 1064, 1083, 1101, 1114, 1131, 1146, 1164, 1182, 1197, 1213, 1230, 1245]
    hit0 = 6
    TP成长 = 0.1
    TP上限 = 7

    # 能量消耗值：20
    能量 = 140
    最小值 = 20
    持续秒数 = 3.0
    硬直时长百分比 = 0

    MP = [4, 40]

    形态 = ['普通', '觉醒']
    power0 = 0

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
            self.最小值 = 20
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 70
            self.power0 = 觉醒后能量消耗 / self.最小值


class 技能3(缔造主动技能):
    名称 = "冰天震地"
    所在等级 = 10
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 10
    MP = [9, 94]
    无色消耗 = 0
    data0 = [0, 1324, 1518, 1712, 1903, 2099, 2291, 2486, 2676, 2870, 3064, 3258, 3452, 3645, 3838, 4032, 4223, 4417, 4610, 4807, 4999, 5190, 5382, 5575, 5772, 5963, 6158, 6349, 6542, 6735, 6932, 7123, 7316, 7512, 7705, 7895, 8090, 8283, 8477, 8670, 8865, 9056, 9251, 9444, 9636, 9829, 10027, 10218, 10412, 10602, 10792, 10992, 11183, 11375, 11568, 11762, 11954, 12152, 12343, 12537, 12727, 12924, 13115, 13308, 13503, 13697, 13889, 14085, 14278, 14469, 14662]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 7

    # 能量消耗值：40
    能量 = 140
    最小值 = 40
    持续秒数 = 1.0
    硬直时长百分比 = 0

    MP = [9, 94]

    形态 = ['普通', '觉醒']
    power0 = 0

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 140
            self.power0 = 觉醒后能量消耗 / self.最小值


class 技能4(被动技能):
    名称 = '幻想之境'
    所在等级 = 20

    等级上限 = 20
    基础等级 = 10

    def 独立攻击力倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        elif self.等级 <= 10:
            return round(1 + 0.01 * self.等级, 5)
        else:
            return round(1.1 + 0.015 * (self.等级 - 10), 5)


class 技能5(被动技能):
    名称 = '具象强化'
    所在等级 = 25

    等级上限 = 20
    基础等级 = 10

    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.05 + 0.025 * self.等级, 5)


class 技能6(缔造主动技能):
    名称 = "烈焰飓风"
    所在等级 = 30
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 20
    MP = [43, 452]
    无色消耗 = 1
    data0 = [0, 774, 850, 930, 1007, 1085, 1163, 1242, 1323, 1398, 1478, 1558, 1635, 1714, 1791, 1871, 1950, 2032, 2103, 2185, 2264, 2342, 2417, 2497, 2576, 2655, 2732, 2810, 2889, 2971, 3048, 3125, 3204, 3282, 3360, 3438, 3517, 3597, 3676, 3755, 3833, 3911, 3991, 4065, 4144, 4222, 4302, 4381, 4457, 4538, 4617, 4694, 4774, 4849, 4931, 5007, 5087, 5165, 5246, 5320, 5400, 5480, 5558, 5639, 5714, 5792, 5872, 5950, 6026, 6104, 6186]
    hit0 = 12
    TP成长 = 0.1
    TP上限 = 5

    # 烈焰飓风持续时间：3秒
    # 能量消耗值：60
    能量 = 140
    最小值 = 60
    持续秒数 = 4.0

    硬直时长百分比 = 0.05
    是否有护石 = 1

    def 装备护石(self, char):
        self.CDR *= 0.85
        self.power0 *= 1.09


class 技能7(缔造主动技能):
    名称 = "极冰护盾"
    所在等级 = 30
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 20
    MP = [43, 452]
    无色消耗 = 1
    data0 = [0, 5062, 5576, 6090, 6602, 7120, 7632, 8145, 8659, 9173, 9689, 10198, 10711, 11227, 11741, 12254, 12767, 13283, 13796, 14309, 14823, 15335, 15853, 16366, 16879, 17391, 17904, 18421, 18931, 19446, 19960, 20476, 20986, 21500, 22015, 22528, 23045, 23556, 24072, 24583, 25101, 25611, 26123, 26639, 27153, 27668, 28179, 28692, 29208, 29720, 30234, 30749, 31261, 31778, 32291, 32803, 33316, 33831, 34345, 34857, 35371, 35885, 36400, 36910, 37427, 37941, 38455, 38969, 39479, 39994, 40506]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 5

    持续秒数 = 1.0
    能量 = 140
    最小值 = 60
    硬直时长百分比 = 0.1


class 技能8(缔造主动技能):
    名称 = "超能旋风波"
    所在等级 = 40
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 25
    MP = [81, 680]
    无色消耗 = 1
    data0 = [0, 621, 686, 745, 807, 873, 934, 997, 1062, 1125, 1189, 1253, 1313, 1378, 1441, 1503, 1566, 1632, 1694, 1755, 1820, 1882, 1943, 2006, 2072, 2135, 2199, 2258, 2325, 2387, 2450, 2512, 2573, 2638, 2700, 2763, 2827, 2891, 2954, 3017, 3082, 3142, 3207, 3270, 3333, 3395, 3460, 3522, 3586, 3648, 3710, 3772, 3836, 3898, 3963, 4026, 4087, 4153, 4218, 4279, 4341, 4404, 4468, 4530, 4592, 4658, 4721, 4786, 4846, 4908, 4971]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 5

    持续秒数 = 5.0
    能量 = 140
    最小值 = 4

    硬直时长百分比 = 0
    是否有护石 = 1
    护石选项 = ['圣痕']

    形态 = ['普通', '觉醒']
    power0 = 0

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 46
            self.power0 = 觉醒后能量消耗 / self.最小值

    def 装备护石(self, char):
        self.倍率 *= 1.32


class 技能9(缔造主动技能):
    名称 = "风暴漩涡"
    所在等级 = 40
    等级上限 = 70
    学习间隔 = 2
    等级精通 = 60
    CD = 25
    MP = [243, 2041]
    无色消耗 = 1
    data0 = [0, 2530, 2789, 3044, 3302, 3560, 3817, 4073, 4330, 4590, 4846, 5104, 5359, 5616, 5872, 6129, 6385, 6644, 6902, 7158, 7417, 7671, 7931, 8187, 8443, 8699, 8958, 9213, 9469, 9727, 9983, 10242, 10499, 10757, 11011, 11271, 11525, 11782, 12041, 12297, 12555, 12811, 13068, 13324, 13584, 13840, 14098, 14352, 14609, 14867, 15125, 15381, 15639, 15897, 16152, 16409, 16666, 16925, 17182, 17436, 17694, 17951, 18208, 18464, 18721, 18978, 19237, 19494, 19750, 20007, 20264]
    hit0 = 1
    TP成长 = 0.1
    TP上限 = 5

    能量 = 140
    最小值 = 20
    持续秒数 = 5.0
    硬直时长百分比 = 0
    是否有护石 = 1

    形态 = ['普通', '觉醒']

    def 形态变更(self, 形态, char: Character):
        if (形态 == '' or 形态 not in self.形态) and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == '普通':
            self.power0 = 1
        elif 形态 == '觉醒':
            觉醒后能量消耗 = 70
            self.power0 = 觉醒后能量消耗 / self.最小值
#            self.data0 = [int(x * 觉醒后能量消耗 / self.最小值) for x in self.data0]
            # self.最小值 = 觉醒后能量消耗

    def 装备护石(self, char):
        self.CDR *= 0.85
        self.倍率 *= 1.22


class 技能10(被动技能):
    名称 = '洞悉'
    所在等级 = 48

    学习间隔 = 3
    等级上限 = 50
    等级精通 = 40

    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.025 + 0.02 * self.等级, 5)


class 技能11(缔造主动技能):
    名称 = "末日虫洞"
    所在等级 = 50
    等级上限 = 50
    学习间隔 = 3
    等级精通 = 40
    CD = 45
    MP = [464, 3897]
    无色消耗 = 2
    data0 = [0, 460, 535, 609, 683, 757, 832, 908, 980, 1054, 1126, 1202, 1274, 1351, 1424, 1496, 1571, 1644, 1718, 1790, 1867, 1941, 2012, 2087, 2162, 2234, 2308, 2385, 2459, 2530, 2603, 2678, 2750, 2825, 2901, 2976, 3047, 3123, 3193, 3268, 3341, 3418, 3491, 3563, 3639, 3711, 3786, 3858, 3935, 4007, 4081]
    hit0 = 19
    data1 = [0, 22591, 26197, 29800, 33403, 36999, 40606, 44209, 47810, 51412, 55012, 58618, 62219, 65818, 69423, 73025, 76626, 80229, 83832, 87432, 91038, 94637, 98239, 101842, 105444, 109047, 112649, 116250, 119853, 123455, 127057, 130658, 134260, 137863, 141469, 145068, 148671, 152269, 155876, 159480, 163079, 166680, 170284, 173887, 177489, 181093, 184691, 188293, 191899, 195500, 199101]
    hit1 = 1

    TP成长 = 0.10
    TP上限 = 5

    持续秒数 = 3.0
    能量 = 100
    最小值 = 100
    硬直时长百分比 = 0
    是否有护石 = 1


    def 装备护石(self, char):
        self.倍率 *= 1.28


class 技能12(缔造主动技能):
    名称 = "冰雪降临"
    所在等级 = 60
    等级上限 = 50
    学习间隔 = 3
    等级精通 = 40
    CD = 31.5
    MP = [619, 1733]
    无色消耗 = 1
    data0 = [0, 991, 1148, 1304, 1463, 1620, 1778, 1936, 2093, 2252, 2409, 2569, 2727, 2887, 3042, 3200, 3358, 3515, 3676, 3831, 3990, 4149, 4306, 4463, 4620, 4778, 4936, 5095, 5253, 5411, 5566, 5727, 5884, 6043, 6202, 6357, 6518, 6672, 6833, 6988, 7148, 7307, 7464, 7624, 7780, 7938, 8093, 8252, 8408, 8569, 8726]
    hit0 = 21
    TP成长 = 0.1
    TP上限 = 5

    # 范围大小 1.2~1的倍率
    power0 = 1.2
    持续秒数 = 3.0
    能量 = 100
    最小值 = 50
    硬直时长百分比 = 0
    是否有护石 = 1

    def 装备护石(self, char):
        能量消耗 = 2
        self.data0 = [int(x * 能量消耗 / self.最小值) for x in self.data0]
        self.最小值 = 能量消耗
        self.power0 *= 1.37
        self.持续秒数 = 0.5
        self.硬直时长百分比 = 0.15


class 技能13(缔造主动技能):
    名称 = "时空链接"
    所在等级 = 70
    等级上限 = 50
    学习间隔 = 2
    等级精通 = 40
    CD = 54
    MP = [1098, 2305]
    无色消耗 = 3
    data0 = [0, 1210, 1331, 1454, 1577, 1699, 1822, 1948, 2070, 2191, 2315, 2437, 2561, 2682, 2805, 2927, 3049, 3174, 3297, 3422, 3541, 3664, 3786, 3910, 4034, 4155, 4279, 4403, 4524, 4647, 4769, 4892, 5015, 5139, 5260, 5384, 5504, 5627, 5753, 5875, 5999, 6120, 6243, 6366, 6488, 6611, 6733, 6858, 6979, 7103, 7226]
    hit0 = 34
    TP成长 = 0.1
    TP上限 = 5

    持续秒数 = 5.0
    能量 = 100
    最小值 = 50
    硬直时长百分比 = 0.05
    是否有护石 = 1


    def 装备护石(self, char):
        self.倍率 *= 1.32


class 技能14(被动技能):
    名称 = '创世之力'
    所在等级 = 75

    学习间隔 = 3
    等级上限 = 50
    等级精通 = 40

    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.22 + 0.02 * self.等级, 5)


class 技能15(缔造主动技能):
    名称 = "时空禁制"
    所在等级 = 80
    等级上限 = 50
    学习间隔 = 3
    等级精通 = 40
    CD = 45
    MP = [1317, 9877]
    无色消耗 = 5
    data0 = [0, 1317, 1523, 1736, 1945, 2154, 2366, 2573, 2786, 2993, 3205, 3414, 3624, 3835, 4041, 4253, 4460, 4674, 4883, 5092, 5303, 5510, 5722, 5933, 6143, 6351, 6564, 6772, 6980, 7190, 7400, 7613, 7821, 8031, 8240, 8449, 8658, 8868, 9080, 9287, 9502, 9709, 9918, 10130, 10337, 10551, 10758, 10969, 11179, 11387, 11598]
    hit0 = 30
    data1 = [0, 39489, 45785, 52080, 58374, 64670, 70967, 77262, 83556, 89854, 96149, 102444, 108738, 115034, 121329, 127624, 133921, 140216, 146512, 152804, 159102, 165398, 171693, 177991, 184284, 190580, 196876, 203172, 209467, 215764, 222057, 228351, 234648, 240942, 247239, 253536, 259832, 266123, 272422, 278716, 285012, 291309, 297604, 303900, 310193, 316489, 322785, 329082, 335374, 341671, 347966]
    hit1 = 1


    持续秒数 = 7.0
    能量 = 100
    最小值 = 100
    硬直时长百分比 = 0
    是否有护石 = 1

    def 装备护石(self, char):
        self.倍率 *= 0.5 * 2.74


class 技能16(缔造主动技能):
    名称 = "创世"
    所在等级 = 85
    等级上限 = 50
    学习间隔 = 5
    等级精通 = 40
    CD = 180
    MP = [3727, 7454]
    无色消耗 = 10
    data0 = [0, 35975, 44314, 52658, 61001, 69340, 77685, 86026, 94371, 102710, 111052, 119395, 127739, 136079, 144421, 152762, 161105, 169447, 177789, 186129, 194477, 202816, 211161, 219503, 227844, 236185, 244529, 252870, 261212, 269552, 277896, 286239, 294579, 302921, 311267, 319606, 327950, 336290, 344634, 352975, 361318, 369658, 378003, 386343, 394685, 403025, 411371, 419710, 428055, 436393, 444741]
    hit0 = 6

    持续秒数 = 1
    能量 = 100
    最小值 = 100
    硬直时长百分比 = 0



class 技能17(被动技能):
    名称 = '天工开物'
    所在等级 = 95

    等级上限 = 50
    学习间隔 = 3
    等级精通 = 40

    关联技能 = ['所有']

    def 加成倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.18 + 0.02 * self.等级, 5)


class 技能18(缔造主动技能):
    名称 = "创世之光"
    所在等级 = 95
    等级上限 = 50
    学习间隔 = 2
    等级精通 = 40
    CD = 60
    MP = [773, 6000]
    无色消耗 = 7
    data0 = [0, 188838, 207995, 227149, 246308, 265466, 284624, 303781, 322941, 342094, 361257, 380412, 399568, 418727, 437882, 457043, 476200, 495358, 514514, 533674, 552829, 571991, 591148, 610301, 629462, 648618, 667777, 686933, 706091, 725249, 744410, 763566, 782719, 801880, 821036, 840197, 859352, 878509, 897665, 916827, 935984, 955138, 974298, 993454, 1012615, 1031770, 1050931, 1070085, 1089247, 1108399, 1127555]
    hit0 = 1

    持续秒数 = 3.5
    能量 = 100
    最小值 = 100
    硬直时长百分比 = 0


# def 加成倍率(self, 武器类型):
#        return 0.0


class 技能19(缔造主动技能):
    名称 = "时之终末：归烬"
    所在等级 = 100
    等级上限 = 50
    学习间隔 = 5
    等级精通 = 40
    CD = 290
    MP = [4028, 8056]
    无色消耗 = 15
    data0 = [0, 20646, 25432, 30218, 35005, 39794, 44580, 49368, 54153, 58941, 63730, 68515, 73304, 78091, 82878, 87664, 92453, 97240, 102026, 106813, 111601, 116387, 121176, 125962, 130750, 135535, 140323, 145112, 149898, 154685, 159471, 164259, 169048, 173832, 178622, 183408, 188194, 192984, 197770, 202558, 207344, 212131, 216917, 221707, 226492, 231279, 236068, 240853, 245640, 250431, 255215]
    hit0 = 9
    data1 = [0, 433537, 534067, 634597, 735129, 835658, 936187, 1036719, 1137248, 1237780, 1338310, 1438840, 1539373, 1639904, 1740433, 1840963, 1941491, 2042026, 2142556, 2243084, 2343616, 2444146, 2544676, 2645205, 2745737, 2846269, 2946798, 3047328, 3147860, 3248389, 3348918, 3449449, 3549980, 3650512, 3751043, 3851573, 3952103, 4052634, 4153165, 4253693, 4354223, 4454758, 4555286, 4655818, 4756349, 4856878, 4957409, 5057938, 5158468, 5258998, 5359532]
    hit1 = 1

    持续秒数 = 6
    能量 = 100
    最小值 = 100
    硬直时长百分比 = 0


#    def 加成倍率(self, 武器类型):
#        return 0.0


class 技能20(被动技能):
    名称 = '自我觉醒'
    所在等级 = 50
    等级上限 = 1
    基础等级 = 1

    def 独立攻击力倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return 1.11


class 技能21(主动技能):
    名称 = "创世Buff"
    所在等级 = 85
    等级上限 = 1
    学习间隔 = 1
    等级精通 = 1
    CD = 180
    MP = [3727, 7454]
    无色消耗 = 10

    def 等效CD(self, **argv):
        return super().等效CD(**argv) - 40


class classChange(Character):
    def __init__(self, equVersion=""):
        self.实际名称 = 'creator'
        self.名称 = '知源·缔造者'
        self.角色 = '魔法师(女)'
        self.职业 = '缔造者'
        # 用来筛CP武器的
        self.转职 = '缔造者'
        self.武器选项 = ['魔杖', '扫把']
        self.输出类型选项 = ['魔法固伤']
        self.防具精通属性 = ['智力']
        self.类型 = '魔法固伤'
        self.武器类型 = '扫把'
        self.防具类型 = '板甲'
        技能列表 = []
        技能序号 = {}
        i = 0
        while i >= 0:
            try:
                tem = eval('技能'+str(i)+'()')
                tem.基础等级计算()
                技能序号[tem.名称] = i
                技能列表.append(tem)
                i += 1
            except Exception:
                i = -1
        self.技能栏 = 技能列表
        self.技能序号 = 技能序号
        self.buff = 1.66

        super().__init__(equVersion)

    def 设置觉醒技能(self):
        self.觉醒技能 = []
        for i in self.技能栏:
            if i.是否有伤害 == 1 and i.所在等级 in [85,100]:
                self.觉醒技能.append(i.名称)

    def set_skill_info(self, info, rune_except=[], clothes_pants=[], rune_start_lv=20) -> None:
        super().set_skill_info(info, rune_except, clothes_pants, rune_start_lv)
        info['rune'].append("末日虫洞")