#3deb7be5f01953ac8b1ecaa1e25e0420
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "demonic_lancer/dragoon/cn/skillDetail"

# 刺击
# demonic_lancer/dragoon/9dda3f4a849dba1a288dd65e116860f2
# 3deb7be5f01953ac8b1ecaa1e25e0420/9dda3f4a849dba1a288dd65e116860f2
class Skill0(ActiveSkill):
    """
    向前方进行普通的刺击。 用枪头击打敌人时， 可以造成更多的伤害。\n
    近距离攻击和枪头攻击不会同时命中敌人， 相应的判定重叠时， 优先判定为枪头攻击。
    """
    name = "刺击"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    mp = [6, 40]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = False

    # 近距离攻击力 : {value0}%
    # REMOVE: data0 = [0, 3754, 4135, 4516, 4896, 5277, 5658, 6039, 6420, 6801, 7181, 7562, 7943, 8324, 8705, 9086, 9466, 9847, 10228, 10609, 10990, 11370, 11751, 12132, 12513, 12894, 13275, 13655, 14036, 14417, 14798, 15179, 15560, 15940, 16321, 16702, 17083, 17464, 17845, 18225, 18606, 18987, 19368, 19749, 20130, 20510, 20891, 21272, 21653, 22034, 22415, 22795, 23176, 23557, 23938, 24319, 24700, 25080, 25461, 25842, 26223, 26604, 26985, 27365, 27746, 28127, 28508, 28889, 29270, 29650, 30031]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 枪头攻击力 : {value1}%
    # REMOVE: data1 = [0, 4153, 4574, 4996, 5417, 5838, 6260, 6681, 7102, 7524, 7945, 8366, 8788, 9209, 9630, 10051, 10473, 10894, 11315, 11737, 12158, 12579, 13001, 13422, 13843, 14265, 14686, 15107, 15529, 15950, 16371, 16793, 17214, 17635, 18057, 18478, 18899, 19320, 19742, 20163, 20584, 21006, 21427, 21848, 22270, 22691, 23112, 23534, 23955, 24376, 24798, 25219, 25640, 26062, 26483, 26904, 27326, 27747, 28168, 28589, 29011, 29432, 29853, 30275, 30696, 31117, 31539, 31960, 32381, 32803, 33224]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 枪头攻击判定距离 : {value2}px
    # REMOVE: data2 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    
    mode = ["枪头","近距离"]    

    def setMode(self, mode):
        if mode == "枪头":
            self.hit0 = 0
            self.hit1 = 1
        elif mode == "近距离":
            self.hit0 = 1
            self.hit1 = 0

# 枪挑
# demonic_lancer/dragoon/0969cd4054d93da07708108c0cc1c4b5
# 3deb7be5f01953ac8b1ecaa1e25e0420/0969cd4054d93da07708108c0cc1c4b5
class Skill1(ActiveSkill):
    """
    从下往上挑击， 使敌人浮空。
    """
    name = "枪挑"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 8 #TODO
    rangeLv = 3
    cd = 2
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = False

    # 挑击攻击力 : {value0}%
    # REMOVE: data0 = [0, 136, 158, 179, 201, 223, 244, 266, 288, 309, 331, 353, 374, 396, 418, 440, 461, 483, 505, 526, 548]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 浮空力增加率 : {value1}%
    # REMOVE: data1 = [0, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 后跳
# demonic_lancer/dragoon/7822d6d52e10964a6755f142c666b494
# 3deb7be5f01953ac8b1ecaa1e25e0420/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 基础精通
# demonic_lancer/dragoon/5a56514f35cf0270ae8d6c65f8fefd78
# 3deb7be5f01953ac8b1ecaa1e25e0420/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [枪挑]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 190
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["猎杀枪"]}]


# 受身蹲伏
# demonic_lancer/dragoon/ce26c6b69d02a440a81b552bec94f03b
# 3deb7be5f01953ac8b1ecaa1e25e0420/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# demonic_lancer/dragoon/892ef624d8bf3d7fc045f84825fd6104
# 3deb7be5f01953ac8b1ecaa1e25e0420/892ef624d8bf3d7fc045f84825fd6104
class Skill5(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 回旋钩
# demonic_lancer/dragoon/eb71e1d82d92c7e1d40500a0dcd77aa6
# 3deb7be5f01953ac8b1ecaa1e25e0420/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill6(ActiveSkill):
    """
    用枪把敌人钩过来后， 再次扔出。\n
    被扔出的敌人会受到冲撞伤害， 并且碰到墙壁时， 会反弹回来。\n
    对无法抓取的敌人不适用控制效果。
    """
    name = "回旋钩"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 9 #TODO
    rangeLv = 2
    cd = 7
    mp = [20, 300]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 被扔时的冲撞伤害 : {value0}%
    # REMOVE: data0 = [0, 3060, 3369, 3680, 3993, 4301, 4612, 4923, 5233, 5542, 5856, 6166, 6475, 6788, 7098, 7405, 7720, 8029, 8338, 8650, 8961, 9270, 9583, 9894, 10203, 10514, 10824, 11133, 11444, 11757, 12067, 12376, 12689, 12998, 13308, 13620, 13930, 14239, 14549, 14861, 15171, 15482, 15795, 16104, 16414, 16726, 17034, 17345, 17658, 17967, 18277, 18588, 18899, 19210, 19521, 19832, 20142, 20449, 20762, 21073, 21383, 21695, 22005, 22314, 22627, 22936, 23248, 23557, 23868, 24177, 24487]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 撞到墙壁、 地面时的冲撞伤害 : {value1}%
    # REMOVE: data1 = [0, 3060, 3370, 3681, 3991, 4302, 4612, 4923, 5233, 5543, 5854, 6164, 6475, 6785, 7096, 7406, 7717, 8027, 8337, 8648, 8958, 9269, 9579, 9890, 10200, 10510, 10821, 11131, 11442, 11752, 12063, 12373, 12683, 12994, 13304, 13615, 13925, 14236, 14546, 14857, 15167, 15477, 15788, 16098, 16409, 16719, 17030, 17340, 17650, 17961, 18271, 18582, 18892, 19203, 19513, 19823, 20134, 20444, 20755, 21065, 21376, 21686, 21997, 22307, 22617, 22928, 23238, 23549, 23859, 24170, 24480]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [学习帝国枪术后]
    # 可抓取的敌人数量 : {value2}
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    mode = ["可抓取","不可抓取"]    

    def setMode(self, mode):
        if mode == "可抓取":
            self.hit0 = 1
        elif mode == "不可抓取":
            self.hit0 = 0  

# 格挡反击
# demonic_lancer/dragoon/4655101518604f874721b3cc249aae10
# 3deb7be5f01953ac8b1ecaa1e25e0420/4655101518604f874721b3cc249aae10
class Skill7(ActiveSkill):
    """
    斜架长枪抵抗来自前方的攻击。\n
    受到的伤害越多， 接受攻击时被推开的距离越远。\n
    被推开一定距离后， 按下X键可以进行反击。
    """
    name = "格挡反击"
    learnLv = 10
    masterLv = 1
    maxLv = 10
    position = 8 #TODO
    rangeLv = 2
    cd = 6
    mp = [4, 5]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = False

    # 反击的攻击力 : {value0}%
    # REMOVE: data0 = [0, 737, 812, 887, 961, 1036, 1111, 1186, 1260, 1335, 1410]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 所受伤害减少率 : {value1}%
    # REMOVE: data1 = [0, 10, 15, 20, 25, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 落凤枪
# demonic_lancer/dragoon/c9664191611af31142e052dfaef84530
# 3deb7be5f01953ac8b1ecaa1e25e0420/c9664191611af31142e052dfaef84530
class Skill8(ActiveSkill):
    """
    从空中快速地斜向落地， 刺向敌人。
    """
    name = "落凤枪"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 4.5
    mp = [12, 125]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = False

    # 落地攻击力 : {value0}%
    # REMOVE: data0 = [0, 3480, 3833, 4186, 4539, 4892, 5245, 5598, 5951, 6304, 6657, 7010, 7363, 7716, 8070, 8423, 8776, 9129, 9482, 9835, 10188, 10541, 10894, 11247, 11600, 11953, 12306, 12659, 13012, 13365, 13718, 14071, 14424, 14777, 15130, 15483, 15836, 16189, 16543, 16896, 17249, 17602, 17955, 18308, 18661, 19014, 19367, 19720, 20073, 20426, 20779, 21132, 21485, 21838, 22191, 22544, 22897, 23250, 23603, 23956, 24309, 24663, 25016, 25369, 25722, 26075, 26428, 26781, 27134, 27487, 27840]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 地面爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 1873, 2063, 2253, 2443, 2633, 2823, 3013, 3203, 3393, 3583, 3773, 3963, 4153, 4343, 4533, 4723, 4913, 5103, 5293, 5483, 5673, 5863, 6053, 6243, 6433, 6623, 6813, 7003, 7193, 7383, 7573, 7764, 7954, 8144, 8334, 8524, 8714, 8904, 9094, 9284, 9474, 9664, 9854, 10044, 10234, 10424, 10614, 10804, 10994, 11184, 11374, 11564, 11754, 11944, 12134, 12324, 12514, 12704, 12894, 13084, 13274, 13464, 13654, 13844, 14034, 14224, 14414, 14604, 14794, 14984]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 爆炸范围 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 横扫
# demonic_lancer/dragoon/fc7a3f4c2852c832a2f20af63d5d212f
# 3deb7be5f01953ac8b1ecaa1e25e0420/fc7a3f4c2852c832a2f20af63d5d212f
class Skill9(ActiveSkill):
    """
    向前方快速横斩， 击飞敌人。
    """
    name = "横扫"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 4
    mp = [8, 70]
    uuid = "fc7a3f4c2852c832a2f20af63d5d212f"
    hasVP = False
    hasUP = False

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 5092, 5609, 6125, 6642, 7158, 7675, 8191, 8708, 9225, 9741, 10258, 10774, 11291, 11808, 12324, 12841, 13357, 13874, 14390, 14907, 15424, 15940, 16457, 16973, 17490, 18006, 18523, 19040, 19556, 20073, 20589, 21106, 21623, 22139, 22656, 23172, 23689, 24205, 24722, 25239, 25755, 26272, 26788, 27305, 27822, 28338, 28855, 29371, 29888, 30404, 30921, 31438, 31954, 32471, 32987, 33504, 34020, 34537, 35054, 35570, 36087, 36603, 37120, 37637, 38153, 38670, 39186, 39703, 40219, 40736]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1

# 魔枪发射
# demonic_lancer/dragoon/51a08fd0c90f0a5276cd552047fac93d
# 3deb7be5f01953ac8b1ecaa1e25e0420/51a08fd0c90f0a5276cd552047fac93d
class Skill10(ActiveSkill):
    """
    将气息聚集到魔枪尖端， 然后投掷魔枪。\n
    魔法枪对命中的敌人造成多段伤害后消失。
    """
    name = "魔枪发射"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 4.5
    mp = [10, 115]
    uuid = "51a08fd0c90f0a5276cd552047fac93d"
    hasVP = False
    hasUP = False

    # 魔法枪多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 1155, 1272, 1389, 1507, 1624, 1741, 1858, 1975, 2092, 2210, 2327, 2444, 2561, 2678, 2795, 2913, 3030, 3147, 3264, 3381, 3498, 3616, 3733, 3850, 3967, 4084, 4202, 4319, 4436, 4553, 4670, 4787, 4905, 5022, 5139, 5256, 5373, 5490, 5608, 5725, 5842, 5959, 6076, 6193, 6311, 6428, 6545, 6662, 6779, 6897, 7014, 7131, 7248, 7365, 7482, 7600, 7717, 7834, 7951, 8068, 8185, 8303, 8420, 8537, 8654, 8771, 8888, 9006, 9123, 9240]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 4
    # 魔法枪多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 强化 - 后跳
# demonic_lancer/dragoon/2b340542e776818b78f3212af184bd6b
# 3deb7be5f01953ac8b1ecaa1e25e0420/2b340542e776818b78f3212af184bd6b
class Skill11(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# demonic_lancer/dragoon/1fea5a626f15230237946a11a9d11582
# 3deb7be5f01953ac8b1ecaa1e25e0420/1fea5a626f15230237946a11a9d11582
class Skill12(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 连环枪
# demonic_lancer/dragoon/717f1e2104fe4b796f800352fa143ecc
# 3deb7be5f01953ac8b1ecaa1e25e0420/717f1e2104fe4b796f800352fa143ecc
class Skill13(ActiveSkill):
    """
    使用长枪进行连续攻击。 命中敌人时按下技能键， 即刻发动下一次攻击。
    """
    name = "连环枪"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 1 #TODO
    rangeLv = 2
    cd = 6
    mp = [13, 120]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = True

    # 命中敌人后， 即刻发动下一攻击所需的按键间隔 : 0.5秒
    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 1480, 1630, 1780, 1930, 2080, 2230, 2380, 2530, 2681, 2831, 2981, 3131, 3281, 3431, 3581, 3731, 3882, 4032, 4182, 4332, 4482, 4632, 4782, 4932, 5082, 5233, 5383, 5533, 5683, 5833, 5983, 6133, 6283, 6433, 6584, 6734, 6884, 7034, 7184, 7334, 7484, 7634, 7784, 7935, 8085, 8235, 8385, 8535, 8685, 8835, 8985, 9136, 9286, 9436, 9586, 9736, 9886, 10036, 10186, 10336, 10487, 10637, 10787, 10937, 11087, 11237, 11387, 11537, 11687, 11838]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 上挑攻击力 : {value1}%
    # REMOVE: data1 = [0, 1742, 1919, 2095, 2272, 2449, 2625, 2802, 2979, 3156, 3332, 3509, 3686, 3862, 4039, 4216, 4393, 4569, 4746, 4923, 5099, 5276, 5453, 5630, 5806, 5983, 6160, 6336, 6513, 6690, 6867, 7043, 7220, 7397, 7573, 7750, 7927, 8104, 8280, 8457, 8634, 8810, 8987, 9164, 9341, 9517, 9694, 9871, 10047, 10224, 10401, 10577, 10754, 10931, 11108, 11284, 11461, 11638, 11814, 11991, 12168, 12345, 12521, 12698, 12875, 13051, 13228, 13405, 13582, 13758, 13935]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 向上攻击力 : {value2}%
    # REMOVE: data2 = [0, 1901, 2094, 2287, 2480, 2673, 2866, 3059, 3252, 3444, 3637, 3830, 4023, 4216, 4409, 4602, 4795, 4988, 5180, 5373, 5566, 5759, 5952, 6145, 6338, 6531, 6724, 6916, 7109, 7302, 7495, 7688, 7881, 8074, 8267, 8460, 8652, 8845, 9038, 9231, 9424, 9617, 9810, 10003, 10196, 10388, 10581, 10774, 10967, 11160, 11353, 11546, 11739, 11932, 12124, 12317, 12510, 12703, 12896, 13089, 13282, 13475, 13668, 13860, 14053, 14246, 14439, 14632, 14825, 15018, 15211]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 下刺攻击力 : {value3}%
    # REMOVE: data3 = [0, 2060, 2269, 2478, 2687, 2896, 3105, 3314, 3523, 3732, 3941, 4150, 4359, 4568, 4777, 4986, 5195, 5404, 5613, 5822, 6031, 6240, 6449, 6658, 6867, 7076, 7285, 7494, 7703, 7912, 8121, 8330, 8539, 8748, 8957, 9166, 9375, 9584, 9793, 10002, 10211, 10420, 10629, 10838, 11047, 11256, 11465, 11674, 11883, 12092, 12301, 12510, 12719, 12928, 13137, 13346, 13555, 13764, 13973, 14182, 14391, 14600, 14809, 15018, 15227, 15436, 15645, 15854, 16063, 16272, 16481]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 敌人的僵直增加量 : {value4}%
    # REMOVE: data4 = [0, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290, 300, 310, 320, 330, 340, 350, 360, 370, 380, 390, 400, 410, 420, 430, 440, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640, 650, 660, 670, 680, 690, 700, 710, 720, 730, 740, 750, 760, 770, 780, 790]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 扫堂枪
# demonic_lancer/dragoon/128b9ddef2262f40723deae4407bdb42
# 3deb7be5f01953ac8b1ecaa1e25e0420/128b9ddef2262f40723deae4407bdb42
class Skill14(ActiveSkill):
    """
    攻击敌人足部， 使之倒地。
    """
    name = "扫堂枪"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 5
    mp = [12, 120]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = False
    hasUP = True

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 7043, 7758, 8472, 9187, 9901, 10616, 11330, 12045, 12759, 13474, 14188, 14903, 15617, 16332, 17046, 17761, 18475, 19190, 19904, 20619, 21333, 22048, 22762, 23477, 24191, 24906, 25620, 26335, 27049, 27764, 28478, 29193, 29907, 30622, 31336, 32051, 32765, 33480, 34194, 34909, 35623, 36338, 37052, 37767, 38481, 39196, 39910, 40625, 41339, 42054, 42768, 43483, 44197, 44912, 45626, 46341, 47055, 47770, 48484, 49199, 49913, 50628, 51342, 52057, 52771, 53486, 54200, 54915, 55629, 56344]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1

# 狩猎技艺
# demonic_lancer/dragoon/147d005ac868e0de52b1f255eea35d62
# 3deb7be5f01953ac8b1ecaa1e25e0420/147d005ac868e0de52b1f255eea35d62
class Skill15(PassiveSkill):
    """
    基本攻击、 前冲攻击、 后跳、 跳跃攻击变更为狩猎魔兽专用的狩猎者固有枪术。 
    """
    name = "狩猎技艺"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 2
    uuid = "147d005ac868e0de52b1f255eea35d62"
    hasVP = False
    hasUP = False

# 光枪精通
# demonic_lancer/dragoon/47bd4871f29defc2a0021ee9261d7a5b
# 3deb7be5f01953ac8b1ecaa1e25e0420/47bd4871f29defc2a0021ee9261d7a5b
class Skill16(PassiveSkill):
    """
    增加武器的魔法攻击力， 装备光枪时， 提升对武器的熟练度， 增加攻击速度和魔法暴击率。
    """
    name = "光枪精通"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 9 #TODO
    rangeLv = 3
    uuid = "47bd4871f29defc2a0021ee9261d7a5b"
    hasVP = False
    hasUP = False

    # 魔法武器攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击速度增加 : {value1}%
    # REMOVE: data1 = [0, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法暴击率增加 : {value2}%
    # REMOVE: data2 = [0, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
	    
    associate = [ {"type":"$*PAtkPM","data":data0}, ]

# 猎杀枪
# demonic_lancer/dragoon/8510294202d0e042dd29a2422fc6770d
# 3deb7be5f01953ac8b1ecaa1e25e0420/8510294202d0e042dd29a2422fc6770d
class Skill17(ActiveSkill):
    """
    生成基本攻击或施放技能时可以发射的魔法枪。\n
    施放[鹰坠]和1、 2、 3次觉醒技能时无法发射， 有生成数量限制和发射冷却时间。\n
    魔法枪击中敌人或飞出一定距离后消失。\n
    魔法枪享受[基础精通]的加成。\n
    可利用On/Off功能自动发射魔法枪。\n
    在决斗场中无法自动发射魔法枪， 且施放[格挡反击]时无法发射。
    """
    name = "猎杀枪"
    learnLv = 15
    masterLv = 1
    maxLv = 5
    position = 7 #TODO
    rangeLv = 2
    mp = [6, 140]
    uuid = "8510294202d0e042dd29a2422fc6770d"
    hasVP = False
    hasUP = False

    # 魔法枪再次生成时间 : {value0}秒
    # REMOVE: data0 = [0, 0.85, 0.85, 0.85, 0.85, 0.85]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 恢复的魔法枪数量 : {value1}个
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 基本攻击时一次射出的魔法枪数量 : {value2}个
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 施放技能时一次射出的魔法枪数量 : {value3}个
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 发射冷却时间 : {value4}秒
    # REMOVE: data4 = [0, 1, 1, 1, 1, 1]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法枪攻击力 : {value5}%
    # REMOVE: data5 = [0, 409, 450, 492, 533, 575]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    hit5 = 1

    #恢复冷却原本为1秒，1觉被动-0.15s，所以是0.85秒

# 隐鼠之袭
# demonic_lancer/dragoon/38612d8f2561edc2eb68d5057a837bfa
# 3deb7be5f01953ac8b1ecaa1e25e0420/38612d8f2561edc2eb68d5057a837bfa
class Skill18(ActiveSkill):
    """
    从地面攻击， 释放强大的能量。\n
    被击中的敌人会浮空一定高度。\n
    对倒地的敌人也适用同样的浮空力。
    """
    name = "隐鼠之袭"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    mp = [35, 350]
    uuid = "38612d8f2561edc2eb68d5057a837bfa"
    hasVP = False
    hasUP = True

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 6253, 6887, 7522, 8156, 8790, 9425, 10059, 10694, 11328, 11962, 12597, 13231, 13865, 14500, 15134, 15768, 16403, 17037, 17672, 18306, 18940, 19575, 20209, 20843, 21478, 22112, 22746, 23381, 24015, 24650, 25284, 25918, 26553, 27187, 27821, 28456, 29090, 29724, 30359, 30993, 31627, 32262, 32896, 33531, 34165, 34799, 35434, 36068, 36702, 37337, 37971, 38605, 39240, 39874, 40509, 41143, 41777, 42412, 43046, 43680, 44315, 44949, 45583, 46218, 46852, 47487, 48121, 48755, 49390, 50024]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2, 114.2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 攻击范围扩大率 : {value2}%
    # REMOVE: data2 = [0, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114, 114]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 光焰飞枪
# demonic_lancer/dragoon/6a1d1f08a6572be420bb3a256c44c015
# 3deb7be5f01953ac8b1ecaa1e25e0420/6a1d1f08a6572be420bb3a256c44c015
class Skill19(ActiveSkill):
    """
    投掷多支魔法枪， 对敌人造成多段伤害， 并将敌人推向后方。
    """
    name = "光焰飞枪"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 6
    mp = [50, 550]
    uuid = "6a1d1f08a6572be420bb3a256c44c015"
    hasVP = False
    hasUP = True

    # 多段攻击次数 : {value0}次
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法攻击力 : {value1}%
    # REMOVE: data1 = [0, 1561, 1719, 1878, 2036, 2194, 2353, 2511, 2670, 2828, 2986, 3145, 3303, 3461, 3620, 3778, 3936, 4095, 4253, 4412, 4570, 4728, 4887, 5045, 5203, 5362, 5520, 5678, 5837, 5995, 6154, 6312, 6470, 6629, 6787, 6945, 7104, 7262, 7420, 7579, 7737, 7895, 8054, 8212, 8371, 8529, 8687, 8846, 9004, 9162, 9321, 9479, 9637, 9796, 9954, 10113, 10271, 10429, 10588, 10746, 10904, 11063, 11221, 11379, 11538, 11696, 11855, 12013, 12171, 12330, 12488]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 5
    # [范围信息]
    # 攻击范围扩大率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 狩猎本能
# demonic_lancer/dragoon/e0a072e8cef2d77893aad5f68aeed56a
# 3deb7be5f01953ac8b1ecaa1e25e0420/e0a072e8cef2d77893aad5f68aeed56a
class Skill20(PassiveSkill):
    """
    发挥猎人长期养成的狩猎本能， 增加暴击伤害和命中率。
    """
    name = "狩猎本能"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 8 #TODO
    rangeLv = 3
    uuid = "e0a072e8cef2d77893aad5f68aeed56a"
    hasVP = False
    hasUP = False

    # 暴击伤害增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    associate = [ {"data":data0,"type":"*skillRation"}]

# 暴击
# demonic_lancer/dragoon/fc1262c19f3d0477ee8eda47b8db8696
# 3deb7be5f01953ac8b1ecaa1e25e0420/fc1262c19f3d0477ee8eda47b8db8696
class Skill21(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 能量萃取
# demonic_lancer/dragoon/669f1428193f61f9d92c743b72438c4d
# 3deb7be5f01953ac8b1ecaa1e25e0420/669f1428193f61f9d92c743b72438c4d
class Skill22(ActiveSkill):
    """
    集中精神提取魔法的力量， 提升基本攻击力和技能攻击力。
    """
    name = "能量萃取"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 2
    cd = 5
    uuid = "669f1428193f61f9d92c743b72438c4d"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 猎杀枪 : 掠食
# demonic_lancer/dragoon/b3659936a9a74c4ed6f7faf07cca1f9e
# 3deb7be5f01953ac8b1ecaa1e25e0420/b3659936a9a74c4ed6f7faf07cca1f9e
class Skill23(ActiveSkill):
    """
    在基本攻击或技能施放过程中使用， 可以将敌人强制控制一定时间。\n
    可以在地面或空中施放。\n
    [地面版本]\n
    融合猎杀枪生成一个掠食魔法枪后， 向前方射出。\n
    魔法枪命中时能强制控制枪范围内的所有敌人。\n
    [空中版本]\n
    在空中施放时， 猎杀枪从空中坠落， 以落地位置为中心强制控制一定范围内的敌人。\n
    在决斗场中， 施放[落凤枪]时无法使用[猎杀枪 : 掠食]， 且无法在空中施放该技能。
    """
    name = "猎杀枪 : 掠食"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 9
    mp = [30, 500]
    uuid = "b3659936a9a74c4ed6f7faf07cca1f9e"
    hasVP = False
    hasUP = True

    # 地面发射攻击力 : {value0}%
    # REMOVE: data0 = [0, 10226, 11263, 12301, 13338, 14376, 15413, 16451, 17488, 18525, 19563, 20600, 21638, 22675, 23712, 24750, 25787, 26825, 27862, 28900, 29937, 30974, 32012, 33049, 34087, 35124, 36162, 37199, 38236, 39274, 40311, 41349, 42386, 43423, 44461, 45498, 46536, 47573, 48611, 49648, 50685, 51723, 52760, 53798, 54835, 55872, 56910, 57947, 58985, 60022, 61060, 62097, 63134, 64172, 65209, 66247, 67284, 68322, 69359, 70396, 71434, 72471, 73509, 74546, 75583, 76621, 77658, 78696, 79733, 80771, 81808]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 地面发射控制时间 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 空中发射控制时间 : {value2}秒
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 空中发射攻击力 : {value3}%
    # REMOVE: data3 = [0, 10504, 11570, 12635, 13701, 14767, 15832, 16898, 17964, 19029, 20095, 21161, 22226, 23292, 24357, 25423, 26489, 27554, 28620, 29686, 30751, 31817, 32883, 33948, 35014, 36079, 37145, 38211, 39276, 40342, 41408, 42473, 43539, 44605, 45670, 46736, 47801, 48867, 49933, 50998, 52064, 53130, 54195, 55261, 56327, 57392, 58458, 59524, 60589, 61655, 62720, 63786, 64852, 65917, 66983, 68049, 69114, 70180, 71246, 72311, 73377, 74442, 75508, 76574, 77639, 78705, 79771, 80836, 81902, 82968, 84033]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 0
    
    mode = ["地面","空中"]    

    def setMode(self, mode):
        if mode == "地面":
            self.hit0 = 1
            self.hit3 = 0
        elif mode == "空中":
            self.hit0 = 0
            self.hit3 = 1
			
# 蛮横冲撞
# demonic_lancer/dragoon/a2d943797daca862a6f321aca6ac9bfa
# 3deb7be5f01953ac8b1ecaa1e25e0420/a2d943797daca862a6f321aca6ac9bfa
class Skill24(ActiveSkill):
    """
    向前方突进， 用枪刺穿敌人并将其击退， 然后将敌人下刺向地面。\n
    突进过程中击中敌人时， 再次按技能键可以立即将敌人刺倒在地。\n
    如果突进攻击未击中敌人， 则无法追加下刺攻击。
    """
    name = "蛮横冲撞"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 8
    mp = [65, 650]
    uuid = "a2d943797daca862a6f321aca6ac9bfa"
    hasVP = False
    hasUP = True

    # 突进距离 : {value0}px
    # REMOVE: data0 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 按前方向键施放时突进距离 : {value1}px
    # REMOVE: data1 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 突进攻击力 : {value2}%
    # REMOVE: data2 = [0, 3201, 3526, 3850, 4175, 4500, 4825, 5149, 5474, 5799, 6124, 6448, 6773, 7098, 7422, 7747, 8072, 8397, 8721, 9046, 9371, 9696, 10020, 10345, 10670, 10995, 11319, 11644, 11969, 12293, 12618, 12943, 13268, 13592, 13917, 14242, 14567, 14891, 15216, 15541, 15866, 16190, 16515, 16840, 17164, 17489, 17814, 18139, 18463, 18788, 19113, 19438, 19762, 20087, 20412, 20736, 21061, 21386, 21711, 22035, 22360, 22685, 23010, 23334, 23659, 23984, 24309, 24633, 24958, 25283, 25607]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 下刺攻击力 : {value3}%
    # REMOVE: data3 = [0, 3898, 4294, 4689, 5084, 5480, 5875, 6271, 6666, 7062, 7457, 7853, 8248, 8644, 9039, 9434, 9830, 10225, 10621, 11016, 11412, 11807, 12203, 12598, 12994, 13389, 13785, 14180, 14575, 14971, 15366, 15762, 16157, 16553, 16948, 17344, 17739, 18135, 18530, 18925, 19321, 19716, 20112, 20507, 20903, 21298, 21694, 22089, 22485, 22880, 23276, 23671, 24066, 24462, 24857, 25253, 25648, 26044, 26439, 26835, 27230, 27626, 28021, 28416, 28812, 29207, 29603, 29998, 30394, 30789, 31185]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 生成的魔法枪攻击力 : {value4}%
    # REMOVE: data4 = [0, 1299, 1431, 1563, 1694, 1826, 1958, 2090, 2221, 2353, 2485, 2617, 2749, 2880, 3012, 3144, 3276, 3408, 3539, 3671, 3803, 3935, 4066, 4198, 4330, 4462, 4594, 4725, 4857, 4989, 5121, 5252, 5384, 5516, 5648, 5780, 5911, 6043, 6175, 6307, 6438, 6570, 6702, 6834, 6966, 7097, 7229, 7361, 7493, 7625, 7756, 7888, 8020, 8152, 8283, 8415, 8547, 8679, 8811, 8942, 9074, 9206, 9338, 9469, 9601, 9733, 9865, 9997, 10128, 10260, 10392]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 3

# 光焰枪
# demonic_lancer/dragoon/c7bf7ccab413009640e65ca6f2f0263a
# 3deb7be5f01953ac8b1ecaa1e25e0420/c7bf7ccab413009640e65ca6f2f0263a
class Skill25(ActiveSkill):
    """
    向前方投掷贯穿一切的魔法枪， 并将敌人击飞。
    """
    name = "光焰枪"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 12
    mp = [47, 700]
    uuid = "c7bf7ccab413009640e65ca6f2f0263a"
    hasVP = False
    hasUP = False

    # 魔法枪攻击力 : {value0}%
    # REMOVE: data0 = [0, 15868, 17478, 19088, 20697, 22307, 23917, 25527, 27137, 28746, 30356, 31966, 33576, 35186, 36795, 38405, 40015, 41625, 43235, 44844, 46454, 48064, 49674, 51284, 52893, 54503, 56113, 57723, 59333, 60942, 62552, 64162, 65772, 67382, 68991, 70601, 72211, 73821, 75430, 77040, 78650, 80260, 81870, 83479, 85089, 86699, 88309, 89919, 91528, 93138, 94748, 96358, 97968, 99577, 101187, 102797, 104407, 106017, 107626, 109236, 110846, 112456, 114066, 115675, 117285, 118895, 120505, 122115, 123724, 125334, 126944]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1

# 猎杀枪 : 穿心
# demonic_lancer/dragoon/ecc23c980ea71450c0ad0c3fd232f329
# 3deb7be5f01953ac8b1ecaa1e25e0420/ecc23c980ea71450c0ad0c3fd232f329
class Skill26(ActiveSkill):
    """
    向前方发射猎杀枪。\n
    旋转的猎杀枪对敌人造成多段伤害， 移动到最远位置后返回并将敌人拉到特定位置。\n
    施放技能时无施放动作， 立即施放。\n
    可以在施放其他技能过程中使用， 但[落凤枪]、 [鹰坠]和1、 2、 3次觉醒技除外。\n
    跳跃时也可以使用。\n
    决斗场中无法在跳跃时使用。
    """
    name = "猎杀枪 : 穿心"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 10
    mp = [30, 500]
    uuid = "ecc23c980ea71450c0ad0c3fd232f329"
    hasVP = False
    hasUP = True

    # 旋转多段攻击次数 : {value0}次
    # REMOVE: data0 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋转时攻击力 : {value1}%
    # REMOVE: data1 = [0, 1239, 1365, 1490, 1616, 1742, 1867, 1993, 2119, 2244, 2370, 2496, 2621, 2747, 2873, 2999, 3124, 3250, 3376, 3501, 3627, 3753, 3878, 4004, 4130, 4255, 4381, 4507, 4633, 4758, 4884, 5010, 5135, 5261, 5387, 5512, 5638, 5764, 5889, 6015, 6141, 6266, 6392, 6518, 6644, 6769, 6895, 7021, 7146, 7272, 7398, 7523, 7649, 7775, 7900, 8026, 8152, 8277, 8403, 8529, 8655, 8780, 8906, 9032, 9157, 9283, 9409, 9534, 9660, 9786, 9911]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 6
    # 返回时攻击力 : {value2}%
    # REMOVE: data2 = [0, 4947, 5449, 5951, 6453, 6955, 7457, 7959, 8461, 8963, 9465, 9967, 10469, 10970, 11472, 11974, 12476, 12978, 13480, 13982, 14484, 14986, 15488, 15990, 16491, 16993, 17495, 17997, 18499, 19001, 19503, 20005, 20507, 21009, 21511, 22013, 22514, 23016, 23518, 24020, 24522, 25024, 25526, 26028, 26530, 27032, 27534, 28036, 28537, 29039, 29541, 30043, 30545, 31047, 31549, 32051, 32553, 33055, 33557, 34059, 34560, 35062, 35564, 36066, 36568, 37070, 37572, 38074, 38576, 39078, 39580]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 攻击范围扩大率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 利刃收割
# demonic_lancer/dragoon/1b1cfab062e0768bcc889e33e1f30dbf
# 3deb7be5f01953ac8b1ecaa1e25e0420/1b1cfab062e0768bcc889e33e1f30dbf
class Skill27(ActiveSkill):
    """
    生成魔法枪， 大范围挥舞魔法枪将敌人聚集起来， 然后将敌人向前方击退； 如果施放时按上方向键， 则会使敌人向上浮空。
    """
    name = "利刃收割"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [45, 850]
    uuid = "1b1cfab062e0768bcc889e33e1f30dbf"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 挥击攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 2383, 2624, 2866, 3108, 3349, 3591, 3833, 4075, 4316, 4558, 4800, 5041, 5283, 5525, 5767, 6008, 6250, 6492, 6734, 6975, 7217, 7459, 7700, 7942, 8184, 8426, 8667, 8909, 9151, 9392, 9634, 9876, 10118, 10359, 10601, 10843, 11084, 11326, 11568, 11810, 12051, 12293, 12535, 12776, 13018, 13260, 13502, 13743, 13985, 14227, 14468, 14710, 14952, 15194, 15435, 15677, 15919, 16160, 16402, 16644, 16886, 17127, 17369, 17611, 17852, 18094, 18336, 18578, 18819, 19061]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 4
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 击退攻击力 : {value2}%
    # REMOVE: data2 = [0, 9531, 10497, 11464, 12431, 13398, 14365, 15332, 16299, 17265, 18232, 19199, 20166, 21133, 22100, 23067, 24033, 25000, 25967, 26934, 27901, 28868, 29835, 30801, 31768, 32735, 33702, 34669, 35636, 36603, 37570, 38536, 39503, 40470, 41437, 42404, 43371, 44338, 45304, 46271, 47238, 48205, 49172, 50139, 51106, 52072, 53039, 54006, 54973, 55940, 56907, 57874, 58840, 59807, 60774, 61741, 62708, 63675, 64642, 65609, 66575, 67542, 68509, 69476, 70443, 71410, 72377, 73343, 74310, 75277, 76244]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 上升攻击力 : {value3}%
    # REMOVE: data3 = [0, 9656, 10636, 11616, 12595, 13575, 14554, 15534, 16514, 17493, 18473, 19453, 20432, 21412, 22391, 23371, 24351, 25330, 26310, 27290, 28269, 29249, 30228, 31208, 32188, 33167, 34147, 35127, 36106, 37086, 38065, 39045, 40025, 41004, 41984, 42964, 43943, 44923, 45902, 46882, 47862, 48841, 49821, 50801, 51780, 52760, 53739, 54719, 55699, 56678, 57658, 58638, 59617, 60597, 61576, 62556, 63536, 64515, 65495, 66475, 67454, 68434, 69413, 70393, 71373, 72352, 73332, 74312, 75291, 76271, 77250]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 0
    # [范围信息]
    # 攻击范围扩大率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    
    mode = ["击退","上升"]    

    def setMode(self, mode):
        if mode == "击退":
            self.hit0 = 4
            self.hit2 = 1
            self.hit3 = 0
        elif mode == "上升":
            self.hit0 = 4
            self.hit2 = 0
            self.hit3 = 1

    def vp_1(self):
        """
        [利刃收割]\n
        无法进行上升动作\n
        变更为挥动3次攻击\n
        - 每次攻击都会聚集敌人\n
        - 吸附范围 : 400px\n
        总攻击力相同
        """
        self.setMode("击退")

    def vp_2(self):
        """
        [利刃收割]\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 7.5秒\n
        - 攻击力 -50%\n
        地面施放时快速发动上升动作\n
        可以在空中施放
        """
        self.cd = 7.5
        self.skillRation *= 0.5

# 光焰囚杀
# demonic_lancer/dragoon/c77a417c43de80c4ce32c1ed405d174a
# 3deb7be5f01953ac8b1ecaa1e25e0420/c77a417c43de80c4ce32c1ed405d174a
class Skill28(ActiveSkill):
    """
    向空中释放枪的气息， 然后使其在前方落下， 生成屏障。 屏障对敌人造成多段伤害， 逐渐向中央合拢， 最后爆炸。
    """
    name = "光焰囚杀"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [45, 850]
    uuid = "c77a417c43de80c4ce32c1ed405d174a"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 屏障生成位置 : {value0}px
    # REMOVE: data0 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 屏障多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 10311, 11357, 12403, 13449, 14495, 15541, 16587, 17633, 18679, 19725, 20771, 21817, 22864, 23910, 24956, 26002, 27048, 28094, 29140, 30186, 31232, 32278, 33324, 34370, 35416, 36462, 37508, 38554, 39600, 40646, 41692, 42738, 43784, 44830, 45876, 46923, 47969, 49015, 50061, 51107, 52153, 53199, 54245, 55291, 56337, 57383, 58429, 59475, 60521, 61567, 62613, 63659, 64705, 65751, 66797, 67843, 68889, 69935, 70982, 72028, 73074, 74120, 75166, 76212, 77258, 78304, 79350, 80396, 81442, 82488]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 屏障爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 10311, 11357, 12403, 13449, 14495, 15541, 16587, 17633, 18679, 19725, 20771, 21817, 22864, 23910, 24956, 26002, 27048, 28094, 29140, 30186, 31232, 32278, 33324, 34370, 35416, 36462, 37508, 38554, 39600, 40646, 41692, 42738, 43784, 44830, 45876, 46923, 47969, 49015, 50061, 51107, 52153, 53199, 54245, 55291, 56337, 57383, 58429, 59475, 60521, 61567, 62613, 63659, 64705, 65751, 66797, 67843, 68889, 69935, 70982, 72028, 73074, 74120, 75166, 76212, 77258, 78304, 79350, 80396, 81442, 82488]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1

    def vp_1(self):
        """
        [光焰囚杀]\n
        可以在其他动作中施放\n
        - 跳跃状态会被视为其他动作
        """
        ...

    def vp_2(self):
        """
        [光焰囚杀]\n
        变更为向前突进和返回动作\n
        路径上的敌人会被吸附到狩猎者的前方\n
        施放技能时进入无敌状态\n
        总攻击力相同
        """
        ...

# 鹰坠
# demonic_lancer/dragoon/0b8db1e10b3abbd24d38564e708675d5
# 3deb7be5f01953ac8b1ecaa1e25e0420/0b8db1e10b3abbd24d38564e708675d5
class Skill29(ActiveSkill):
    """
    跳到空中期间， 可以用方向键调整降落位置， 然后降落到指定位置。\n
    再次按技能键可以立即降落。\n
    在跳跃过程中也可以施放该技能， 被魔法枪击中的敌人将被强制控制一定时间， 无法移动。\n
    在决斗场中， 无法强制控制被魔法枪击中的敌人， 且无法通过再次按技能键发动终结攻击。
    """
    name = "鹰坠"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [150, 1260]
    uuid = "0b8db1e10b3abbd24d38564e708675d5"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 基本降落位置 : {value0}px
    # REMOVE: data0 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 空中施放技能所需最低高度 : {value1}px
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 降落冲撞攻击力 : {value2}%
    # REMOVE: data2 = [0, 26880, 29607, 32334, 35061, 37788, 40515, 43242, 45969, 48696, 51423, 54150, 56877, 59603, 62330, 65057, 67784, 70511, 73238, 75965, 78692, 81419, 84146, 86873, 89600, 92327, 95054, 97781, 100508, 103235, 105962, 108689, 111416, 114143, 116870, 119597, 122323, 125050, 127777, 130504, 133231, 135958, 138685, 141412, 144139, 146866, 149593, 152320, 155047, 157774, 160501, 163228, 165955, 168682, 171409, 174136, 176863, 179590, 182317, 185043, 187770, 190497, 193224, 195951, 198678, 201405, 204132, 206859, 209586, 212313, 215040]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 强制控制时间 : {value3}秒
    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 冲击波范围扩大率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [鹰坠]\n
        变更为猎杀枪发射动作\n
        - 发射出的猎杀枪会追踪前方的敌人
        """
        ...

    def vp_2(self):
        """
        [鹰坠]\n
        攻击力和冷却时间 +100%\n
        落地后短暂维持无敌状态
        """
        self.cd = 50
        self.skillRation *= 2

# 龙鳞碎割
# demonic_lancer/dragoon/852f8ad797db4dca1405cb3e77198401
# 3deb7be5f01953ac8b1ecaa1e25e0420/852f8ad797db4dca1405cb3e77198401
class Skill30(ActiveSkill):
    """
    生成多支魔法枪， 向前方敌人射出。\n
    发射指定数量的魔法枪后， 向正面的敌人发动终结攻击。\n
    终结攻击时， 按前方向键可以增加终结攻击发动距离。\n
    可以在跳跃中使用， 施放过程中可以按跳跃键强制中断。\n
    在决斗场中， 不可以在跳跃中使用。
    """
    name = "龙鳞碎割"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [250, 2500]
    uuid = "852f8ad797db4dca1405cb3e77198401"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 魔法枪发射次数 : {value0}次
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法枪攻击力 : {value1}%
    # REMOVE: data1 = [0, 953, 1050, 1146, 1243, 1340, 1436, 1533, 1630, 1726, 1823, 1920, 2016, 2113, 2210, 2307, 2403, 2500, 2597, 2693, 2790, 2887, 2983, 3080, 3177, 3273, 3370, 3467, 3563, 3660, 3757, 3853, 3950, 4047, 4143, 4240, 4337, 4434, 4530, 4627, 4724, 4820, 4917, 5014, 5110, 5207, 5304, 5400, 5497, 5594, 5690, 5787, 5884, 5980, 6077, 6174, 6270, 6367, 6464, 6561, 6657, 6754, 6851, 6947, 7044, 7141, 7237, 7334, 7431, 7527, 7624]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 20
    # 终结攻击力 : {value2}%
    # REMOVE: data2 = [0, 28614, 31517, 34420, 37323, 40225, 43128, 46031, 48934, 51837, 54740, 57643, 60545, 63448, 66351, 69254, 72157, 75060, 77963, 80865, 83768, 86671, 89574, 92477, 95380, 98283, 101186, 104088, 106991, 109894, 112797, 115700, 118603, 121506, 124408, 127311, 130214, 133117, 136020, 138923, 141826, 144728, 147631, 150534, 153437, 156340, 159243, 162146, 165048, 167951, 170854, 173757, 176660, 179563, 182466, 185369, 188271, 191174, 194077, 196980, 199883, 202786, 205689, 208591, 211494, 214397, 217300, 220203, 223106, 226009, 228911]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 攻击范围扩大率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [龙鳞碎割]\n
        删除终结攻击\n
        可以在其他动作中施放\n
        总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [龙鳞碎割]\n
        删除猎杀枪攻击\n
        可以强制中断施放后僵直， 并连接部分技能\n
        [可连接技能]\n
        - [光焰枪]\n
        - [天龙破]\n
        - [凌空之狩]\n
        - [无尽毁灭]\n
        总攻击力相同 
        """
        ...

# 枪魂感知
# demonic_lancer/dragoon/28b583c75a49103a1d8aabf799c000a4
# 3deb7be5f01953ac8b1ecaa1e25e0420/28b583c75a49103a1d8aabf799c000a4
class Skill31(PassiveSkill):
    """
    增加狩猎者的技能攻击力， 减少猎杀枪的重新生成时间。
    """
    name = "枪魂感知"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "28b583c75a49103a1d8aabf799c000a4"
    hasVP = False
    hasUP = False

    # 猎杀枪重新生成时间 : {value0}秒
    # REMOVE: data0 = [0, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    associate = [ {"data":data1,"type":"*skillRation"}]

# 逐云灭龙杀
# demonic_lancer/dragoon/4f2e001e9a19eb7bae50ad1840dfb329
# 3deb7be5f01953ac8b1ecaa1e25e0420/4f2e001e9a19eb7bae50ad1840dfb329
class Skill32(ActiveSkill):
    """
    射出猎杀枪， 对前方魔法阵内的敌人造成伤害并强控敌人； 然后， 跳到高空中， 以极快的速度降落， 使敌人受到巨大冲撞爆炸伤害。\n
    按住方向键可以调整降落位置。\n
    在最后的冲撞爆炸之前， 被猎杀枪击中并被强制控制的敌人会一直处于强制控制状态。
    """
    name = "逐云灭龙杀"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [980, 8232]
    uuid = "4f2e001e9a19eb7bae50ad1840dfb329"
    hasVP = False
    hasUP = False

    # 直接攻击力 : {value0}%
    # REMOVE: data0 = [0, 4598, 5664, 6730, 7796, 8862, 9928, 10995, 12061, 13127, 14193, 15259, 16325, 17391, 18458, 19524, 20590, 21656, 22722, 23788, 24855, 25921, 26987, 28053, 29119, 30185, 31251, 32318, 33384, 34450, 35516, 36582, 37648, 38714, 39781, 40847, 41913, 42979, 44045, 45111, 46177, 47244, 48310, 49376, 50442, 51508, 52574, 53640, 54707, 55773, 56839]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 猎杀枪多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 3218, 3965, 4711, 5457, 6204, 6950, 7696, 8443, 9189, 9935, 10681, 11428, 12174, 12920, 13667, 14413, 15159, 15906, 16652, 17398, 18144, 18891, 19637, 20383, 21130, 21876, 22622, 23369, 24115, 24861, 25607, 26354, 27100, 27846, 28593, 29339, 30085, 30832, 31578, 32324, 33070, 33817, 34563, 35309, 36056, 36802, 37548, 38295, 39041, 39787]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 10
    # 降落冲撞爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 55182, 67978, 80774, 93570, 106366, 119162, 131957, 144753, 157549, 170345, 183141, 195937, 208733, 221529, 234324, 247120, 259916, 272712, 285508, 298304, 311100, 323895, 336691, 349487, 362283, 375079, 387875, 400671, 413467, 426262, 439058, 451854, 464650, 477446, 490242, 503038, 515834, 528629, 541425, 554221, 567017, 579813, 592609, 605405, 618201, 630996, 643792, 656588, 669384, 682180]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 长按前方向键时降落位置 : 中间位置的前方300px
    # 长按后方向键时降落位置 : 中间位置的后方300px

# 天龙破
# demonic_lancer/dragoon/dcb31a63ef58954f44ff2070c42a9a98
# 3deb7be5f01953ac8b1ecaa1e25e0420/dcb31a63ef58954f44ff2070c42a9a98
class Skill33(ActiveSkill):
    """
    生成魔法枪发动乱舞攻击。\n
    乱舞后跳起将魔枪插入地面， 并使魔枪爆炸。\n
    跳跃中可以使用， 但只发动地面爆炸攻击。\n
    在地面上按住后方向键施放技能时， 在原地施放技能。
    """
    name = "天龙破"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [400, 1620]
    uuid = "dcb31a63ef58954f44ff2070c42a9a98"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 魔法枪乱舞攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 6126, 6748, 7369, 7991, 8612, 9234, 9855, 10477, 11098, 11720, 12341, 12963, 13584, 14206, 14827, 15449, 16070, 16692, 17313, 17935, 18556, 19178, 19799, 20421, 21042, 21663, 22285, 22906, 23528, 24149, 24771, 25392, 26014, 26635, 27257, 27878, 28500, 29121, 29743, 30364, 30986, 31607, 32229, 32850, 33472, 34093, 34715, 35336, 35958, 36579]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 4
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 地面爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 16336, 17994, 19651, 21308, 22966, 24623, 26280, 27938, 29595, 31252, 32910, 34567, 36224, 37882, 39539, 41196, 42853, 44511, 46168, 47825, 49483, 51140, 52797, 54455, 56112, 57769, 59427, 61084, 62741, 64399, 66056, 67713, 69371, 71028, 72685, 74342, 76000, 77657, 79314, 80972, 82629, 84286, 85944, 87601, 89258, 90916, 92573, 94230, 95888, 97545]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 地面爆炸范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [天龙破]\n
        乱舞攻击次数 -2次\n
        最后一击攻击范围增加\n
        空中施放时， 适用地面攻击力100%的攻击力\n
        总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [天龙破]\n
        无法在空中施放\n
        初始化[猎杀枪 : 掠食]、 [猎杀枪 : 穿心]技能的冷却时间， 并自动发动\n
        - 穿心攻击力 : 基础攻击力的74%\n
        - 掠食攻击力 : 基础攻击力的74%
        """
    def effect(self, old, new):
        if self.vp == 2:
            self.associate = [{"type":"*skillRation","data":[0] + [-26]*self.maxLv,"skills":["猎杀枪 : 穿心", "猎杀枪 : 掠食"]}]
        return super().effect(old, new)

# 地龙狩
# demonic_lancer/dragoon/8572675ec6a1f50b6eff6a867376c2de
# 3deb7be5f01953ac8b1ecaa1e25e0420/8572675ec6a1f50b6eff6a867376c2de
class Skill34(ActiveSkill):
    """
    蓄力后立即向前方突进， 突进中途撞到敌人会发出强烈的爆炸攻击， 同时狩猎者向后方跳起。\n
    施放时， 按方向键可以调整跳起的方向。\n
    跳跃中可以使用该技能， 但只能向前方地面突进， 撞到敌人也不会跳起。
    """
    name = "地龙狩"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [800, 1680]
    uuid = "8572675ec6a1f50b6eff6a867376c2de"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 突进攻击力 : {value0}%
    # REMOVE: data0 = [0, 63956, 70444, 76933, 83421, 89909, 96397, 102886, 109374, 115862, 122351, 128839, 135327, 141815, 148304, 154792, 161280, 167769, 174257, 180745, 187234, 193722, 200210, 206698, 213187, 219675, 226163, 232652, 239140, 245628, 252116, 258605, 265093, 271581, 278070, 284558, 291046, 297534, 304023, 310511, 316999, 323488, 329976, 336464, 342952, 349441, 355929, 362417, 368906, 375394, 381882]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 攻击范围扩大率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [地龙狩]\n
        变更为可填充2次的技能\n
        - 冷却时间 -50%\n
        - 攻击力 -50%\n
        攻击范围 +50%
        """
        self.cd = 20
        self.skillRation *= 0.5

    def vp_2(self):
        """
        [地龙狩]\n
        未命中时冷却时间缩短为 : 5秒\n
        命中时， 初始化[光焰枪]技能的冷却时间\n
        - [光焰枪]攻击力 : 基础攻击力的77%\n
        突进过程中所受伤害 -75%
        """
    def effect(self, old, new):
        if self.vp == 2:
            self.associate = [{"type":"*skillRation","data":[0] + [-23]*self.maxLv,"skills":["光焰枪"]}]
        return super().effect(old, new)
    
# 狩猎之心
# demonic_lancer/dragoon/2a0a39184de92acf1c1375e00b77404c
# 3deb7be5f01953ac8b1ecaa1e25e0420/2a0a39184de92acf1c1375e00b77404c
class Skill35(PassiveSkill):
    """
    领悟狩猎之心的狩猎者可以更高效地使用魔兽之力。\n
    提高基本攻击力和技能攻击力， 并增加命中率和攻击速度。
    """
    name = "狩猎之心"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "2a0a39184de92acf1c1375e00b77404c"
    hasVP = False
    hasUP = False

    # 基本攻击和技能攻击力增加率量 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击速度增加 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    
    associate = [ {"data":data0,"type":"*skillRation"}]

# 凌空之狩
# demonic_lancer/dragoon/9dc8438e4572d39243c97da31c113acc
# 3deb7be5f01953ac8b1ecaa1e25e0420/9dc8438e4572d39243c97da31c113acc
class Skill36(ActiveSkill):
    """
    狩猎者向前方高高跃起， 并生成一把猎杀枪进行投掷。\n
    投掷的猎杀枪插入地面， 对周围的敌人造成伤害， 随后从空中突进到猎杀枪的位置， 拔出猎杀枪并大幅度挥斩， 对周围的敌人造成伤害。\n
    施放技能时， 按向前方向键， 可以在拔枪挥斩的同时前进。\n
    跳跃期间也可以施放。
    """
    name = "凌空之狩"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "9dc8438e4572d39243c97da31c113acc"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 投掷攻击力 : {value0}%
    # REMOVE: data0 = [0, 23642, 26041, 28439, 30837, 33236, 35634, 38033, 40431, 42830, 45228, 47627, 50025, 52424, 54822, 57221, 59619, 62018, 64416, 66815, 69213, 71612, 74010, 76408, 78807, 81205, 83604, 86002, 88401, 90799, 93198, 95596, 97995, 100393, 102792, 105190, 107589, 109987, 112386, 114784, 117182, 119581, 121979, 124378, 126776, 129175, 131573, 133972, 136370, 138769, 141167]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0  = 1
    # 拔枪挥斩攻击力 : {value1}%
    # REMOVE: data1 = [0, 53873, 59338, 64804, 70269, 75734, 81200, 86665, 92131, 97596, 103061, 108527, 113992, 119457, 124923, 130388, 135853, 141319, 146784, 152250, 157715, 163180, 168646, 174111, 179576, 185042, 190507, 195973, 201438, 206903, 212369, 217834, 223299, 228765, 234230, 239695, 245161, 250626, 256092, 261557, 267022, 272488, 277953, 283418, 288884, 294349, 299815, 305280, 310745, 316211, 321676]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    
    def vp_1(self):
        """
        [凌空之狩]\n
        从空中向地面突进时进入无敌状态\n
        命中时初始化[利刃收割]的冷却时间\n
        - [利刃收割]攻击力 : 基础攻击力的73%
        """
        ...

    def vp_2(self):
        """
        [凌空之狩]\n
        变更为可多次发动的技能\n
        - 每次填充冷却时间 -50%\n
        - 每次填充攻击力 -50%\n
        施放结束时维持跳跃状态
        """
        self.cd = 20
        self.skillRation *= 0.5

    def effect(self, old, new):
        if self.vp == 1:
            self.associate = [{"type":"*skillRation","data":[0] + [-27]*self.maxLv,"skills":["利刃收割"]}]
        return super().effect(old, new)
    
# 无尽毁灭
# demonic_lancer/dragoon/3fb8395ae3b81bd608e0c4223a8eb534
# 3deb7be5f01953ac8b1ecaa1e25e0420/3fb8395ae3b81bd608e0c4223a8eb534
class Skill37(ActiveSkill):
    """
    快速旋转魔法枪， 生成利刃风车粉碎敌人。\n
    生成的利刃风车造成多段攻击伤害后， 飞向前方并爆炸。\n
    可以在跳跃中使用。
    """
    name = "无尽毁灭"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [600, 5000]
    uuid = "3fb8395ae3b81bd608e0c4223a8eb534"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 移动距离上限 : {value0}px
    # REMOVE: data0 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 利刃风车多段攻击攻击力 : {value1}% X {value2}
    # REMOVE: data1 = [0, 2806, 3091, 3375, 3660, 3945, 4229, 4514, 4799, 5083, 5368, 5653, 5937, 6222, 6507, 6791, 7076, 7361, 7645, 7930, 8215, 8499, 8784, 9069, 9353, 9638, 9923, 10207, 10492, 10777, 11061, 11346, 11631, 11915, 12200, 12485, 12769, 13054, 13339, 13623, 13908, 14193, 14477, 14762, 15047, 15331, 15616, 15901, 16185, 16470, 16755]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 11
    # REMOVE: data2 = [0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 利刃风车爆炸攻击力 : {value3}% X {value4}
    # REMOVE: data3 = [0, 59412, 65439, 71467, 77494, 83521, 89548, 95576, 101603, 107630, 113658, 119685, 125712, 131740, 137767, 143794, 149821, 155849, 161876, 167903, 173931, 179958, 185985, 192013, 198040, 204067, 210094, 216122, 222149, 228176, 234204, 240231, 246258, 252286, 258313, 264340, 270367, 276395, 282422, 288449, 294477, 300504, 306531, 312559, 318586, 324613, 330640, 336668, 342695, 348722, 354750]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # REMOVE: data4 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 利刃风车大小比率 : {value5}%
    # data5 = None # TOCHECK    # REMOVE: data5 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [无尽毁灭]\n
        投掷出两把魔法枪\n
        总攻击力相同\n
        吸附力 +20%\n
        施放过程中所受伤害 -75%
        """
        ...

    def vp_2(self):
        """
        [无尽毁灭]\n
        变更为猎杀枪空中发射动作\n
        - 追踪前方的敌人\n
        可以在其他动作中施放
        """
        ...

# 绝命猎杀 : 死亡穿刺
# demonic_lancer/dragoon/5806440d21e7546d50007a5ba11f8024
# 3deb7be5f01953ac8b1ecaa1e25e0420/5806440d21e7546d50007a5ba11f8024
class Skill38(ActiveSkill):
    """
    融合猎杀枪和光枪生成突击枪， 给最强敌人种下印记并强制控制敌人， 然后光速跃起并发动穿刺攻击。\n
    最后将突击枪插入敌人体内， 并引发爆炸造成伤害。\n
    跳跃时也可以使用。
    """
    name = "绝命猎杀 : 死亡穿刺"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "5806440d21e7546d50007a5ba11f8024"
    hasVP = False
    hasUP = False

    # 探测范围 : {value0}px
    # REMOVE: data0 = [0, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 穿刺攻击力 : {value1}%
    # REMOVE: data1 = [0, 114968, 141627, 168287, 194946, 221605, 248265, 274924, 301583, 328242, 354902, 381561, 408220, 434879, 461539, 488198, 514857, 541517, 568176, 594835, 621494, 648154, 674813, 701472, 728132, 754791, 781450, 808109, 834769, 861428, 888087, 914746, 941406, 968065, 994724, 1021384, 1048043, 1074702, 1101361, 1128021, 1154680, 1181339, 1207999, 1234658, 1261317, 1287976, 1314636, 1341295, 1367954, 1394613, 1421273]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 97739, 120403, 143067, 165731, 188395, 211059, 233723, 256387, 279052, 301716, 324380, 347044, 369708, 392372, 415036, 437700, 460364, 483028, 505692, 528356, 551021, 573685, 596349, 619013, 641677, 664341, 687005, 709669, 732333, 754997, 777661, 800326, 822990, 845654, 868318, 890982, 913646, 936310, 958974, 981638, 1004302, 1026966, 1049630, 1072295, 1094959, 1117623, 1140287, 1162951, 1185615, 1208279]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1

# 狩魔之魂
# demonic_lancer/dragoon/002cbdd9bfd0f0b970451ae8d48d029e
# 3deb7be5f01953ac8b1ecaa1e25e0420/002cbdd9bfd0f0b970451ae8d48d029e
class Skill39(PassiveSkill):
    """
    千魂·狩猎者成功控制暴走的利维坦之力， 将力量注入猎杀枪， 锻造出更加强大的光枪。\n
    强化在地面和空中狩猎的能力， 部分技能附加特殊效果。\n
    [蛮横冲撞] : 删除下刺攻击， 下刺攻击力并入突进攻击。 魔法枪会追踪突进攻击命中的敌人中最强大的敌人， 对该位置进行攻击。 按向前方向键可额外增加前进距离。\n
    [光焰枪] : 可以在空中施放。
    """
    name = "狩魔之魂"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "002cbdd9bfd0f0b970451ae8d48d029e"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [蛮横冲撞]按向前方向键时前进距离额外增加 : 30%

    associate = [ {"data":data0,"type":"*skillRation"}]

# 瞬光猎杀枪
# demonic_lancer/dragoon/31823197cc0b04d4c5dcf8f928d9220c
# 3deb7be5f01953ac8b1ecaa1e25e0420/31823197cc0b04d4c5dcf8f928d9220c
class Skill40(ActiveSkill):
    """
     召唤新锻造的猎杀枪后， 发射猎杀枪， 对前方多个敌人造成多段伤害。 然后， 发射的猎杀枪冲向天空， 形成巨型猎杀枪插入地面。 除觉醒技能和部分技能之外， 基本攻击和其他动作过程中也可以施放该技能。
    """
    name = "瞬光猎杀枪"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [800, 6666]
    uuid = "31823197cc0b04d4c5dcf8f928d9220c"
    hasVP = False
    hasUP = False

    # 猎杀枪多段攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 6082, 6699, 7316, 7933, 8550, 9167, 9784, 10401, 11018, 11635, 12252, 12869, 13486, 14103, 14720, 15337, 15954, 16571, 17188, 17805, 18422, 19039, 19656, 20273, 20890, 21507, 22124, 22740, 23357, 23974, 24591, 25208, 25825, 26442, 27059, 27676, 28293, 28910, 29527, 30144, 30761, 31378, 31995, 32612, 33229, 33846, 34463, 35080, 35697, 36314]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0  = 10
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 巨型猎杀枪攻击力 : {value2}%
    # REMOVE: data2 = [0, 91226, 100481, 109736, 118991, 128246, 137501, 146756, 156010, 165265, 174520, 183775, 193030, 202285, 211539, 220794, 230049, 239304, 248559, 257814, 267069, 276323, 285578, 294833, 304088, 313343, 322598, 331853, 341107, 350362, 359617, 368872, 378127, 387382, 396637, 405891, 415146, 424401, 433656, 442911, 452166, 461420, 470675, 479930, 489185, 498440, 507695, 516950, 526204, 535459, 544714]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1

# 红月·狂狩盛宴
# demonic_lancer/dragoon/dac8d8207618150c162e4c6f9e168527
# 3deb7be5f01953ac8b1ecaa1e25e0420/dac8d8207618150c162e4c6f9e168527
class Skill41(ActiveSkill):
    """
    释放已吸收的所有魔兽之力， 重塑红月升起之日曾遭遇的最强劲敌。\n
    将自身的力量向天空发射， 化作大量猎杀枪插入地面。 然后， 捕捉最强的猎物， 释放全部力量， 以极限速度贯穿猎物。\n
    可以在跳跃中使用。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。\n
    [无数狩猎者的牺牲， 化作了我的力量。]
    """
    name = "红月·狂狩盛宴"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4027, 8055]
    uuid = "dac8d8207618150c162e4c6f9e168527"
    hasVP = False
    hasUP = False

    # 猎杀枪多段攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 37318, 45972, 54625, 63279, 71932, 80586, 89239, 97893, 106547, 115200, 123854, 132507, 141161, 149814, 158468, 167121, 175775, 184428, 193082, 201735, 210389, 219042, 227696, 236349, 245003, 253656, 262310, 270964, 279617, 288271, 296924, 305578, 314231, 322885, 331538, 340192, 348845, 357499, 366152, 374806, 383459, 392113, 400766, 409420, 418074, 426727, 435381, 444034, 452688, 461341]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 3
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 贯穿攻击力 : {value2}%
    # REMOVE: data2 = [0, 447820, 551662, 655505, 759347, 863189, 967032, 1070874, 1174716, 1278559, 1382401, 1486243, 1590086, 1693928, 1797770, 1901612, 2005455, 2109297, 2213139, 2316982, 2420824, 2524666, 2628509, 2732351, 2836193, 2940036, 3043878, 3147720, 3251563, 3355405, 3459247, 3563090, 3666932, 3770774, 3874617, 3978459, 4082301, 4186143, 4289986, 4393828, 4497670, 4601513, 4705355, 4809197, 4913040, 5016882, 5120724, 5224567, 5328409, 5432251, 5536094]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1

class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'dragoon'
        self.nameCN = '千魂·狩猎者'
        self.role = 'demonic_lancer'
        self.角色 = '魔枪士'
        self.职业 = '狩猎者'
        self.jobId = '3deb7be5f01953ac8b1ecaa1e25e0420'
        self.jobGrowId = '6d459bc74ba73ee4fe5cdc4655400193'

        self.武器选项 = ['长枪','战戟','光枪','暗矛'] # TODO
        self.输出类型选项 = ['魔法百分比'] # TODO
        self.输出类型 = '魔法百分比' # TODO
        self.防具精通属性 = ['智力'] # TODO
        self.防具类型 = '重甲'
        self.buff = 1.85 # TODO

        super().__init__(equVersion, __name__)
