#3deb7be5f01953ac8b1ecaa1e25e0420
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "demonic_lancer/vanguard/cn/skillDetail"

# 刺击
# demonic_lancer/vanguard/9dda3f4a849dba1a288dd65e116860f2
# 3deb7be5f01953ac8b1ecaa1e25e0420/9dda3f4a849dba1a288dd65e116860f2
class Skill0(ActiveSkill):
    """
    向前方进行普通的刺击。 用枪头击打敌人时， 可以造成更多的伤害。\n
    近距离攻击和枪头攻击不会同时命中敌人， 相应的判定重叠时， 优先判定为枪头攻击。
    """
    name = "刺击"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 5
    mp = [6, 40]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = False

    # 近距离攻击力 : {value0}%
    # REMOVE: data0 = [0, 3754, 4135, 4516, 4896, 5277, 5658, 6039, 6420, 6801, 7181, 7562, 7943, 8324, 8705, 9086, 9466, 9847, 10228, 10609, 10990, 11370, 11751, 12132, 12513, 12894, 13275, 13655, 14036, 14417, 14798, 15179, 15560, 15940, 16321, 16702, 17083, 17464, 17845, 18225, 18606, 18987, 19368, 19749, 20130, 20510, 20891, 21272, 21653, 22034, 22415, 22795, 23176, 23557, 23938, 24319, 24700, 25080, 25461, 25842, 26223, 26604, 26985, 27365, 27746, 28127, 28508, 28889, 29270, 29650, 30031]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 0
    # 枪头攻击力 : {value1}%
    # REMOVE: data1 = [0, 4153, 4574, 4996, 5417, 5838, 6260, 6681, 7102, 7524, 7945, 8366, 8788, 9209, 9630, 10051, 10473, 10894, 11315, 11737, 12158, 12579, 13001, 13422, 13843, 14265, 14686, 15107, 15529, 15950, 16371, 16793, 17214, 17635, 18057, 18478, 18899, 19320, 19742, 20163, 20584, 21006, 21427, 21848, 22270, 22691, 23112, 23534, 23955, 24376, 24798, 25219, 25640, 26062, 26483, 26904, 27326, 27747, 28168, 28589, 29011, 29432, 29853, 30275, 30696, 31117, 31539, 31960, 32381, 32803, 33224]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 枪头攻击判定距离 : {value2}px
    # REMOVE: data2 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
   
    mode = ["枪头","近距离"]    

    def setMode(self, mode):
        if mode == "枪头":
            self.hit0 = 0
            self.hit1 = 1
        elif mode == "近距离":
            self.hit0 = 1
            self.hit1 = 0

# 枪挑
# demonic_lancer/vanguard/0969cd4054d93da07708108c0cc1c4b5
# 3deb7be5f01953ac8b1ecaa1e25e0420/0969cd4054d93da07708108c0cc1c4b5
class Skill1(ActiveSkill):
    """
    从下往上挑击， 使敌人浮空。
    """
    name = "枪挑"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    cd = 2
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = False

    # 挑击攻击力 : {value0}%
    # REMOVE: data0 = [0, 136, 158, 179, 201, 223, 244, 266, 288, 309, 331, 353, 374, 396, 418, 440, 461, 483, 505, 526, 548]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 浮空力增加率 : {value1}%
    # REMOVE: data1 = [0, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 后跳
# demonic_lancer/vanguard/7822d6d52e10964a6755f142c666b494
# 3deb7be5f01953ac8b1ecaa1e25e0420/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

# 基础精通
# demonic_lancer/vanguard/5a56514f35cf0270ae8d6c65f8fefd78
# 3deb7be5f01953ac8b1ecaa1e25e0420/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [枪挑]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 190
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["霸王戟"]}]

# 受身蹲伏
# demonic_lancer/vanguard/ce26c6b69d02a440a81b552bec94f03b
# 3deb7be5f01953ac8b1ecaa1e25e0420/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# demonic_lancer/vanguard/892ef624d8bf3d7fc045f84825fd6104
# 3deb7be5f01953ac8b1ecaa1e25e0420/892ef624d8bf3d7fc045f84825fd6104
class Skill5(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 回旋钩
# demonic_lancer/vanguard/eb71e1d82d92c7e1d40500a0dcd77aa6
# 3deb7be5f01953ac8b1ecaa1e25e0420/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill6(ActiveSkill):
    """
    用枪把敌人钩过来后， 再次扔出。\n
    被扔出的敌人会受到冲撞伤害， 并且碰到墙壁时， 会反弹回来。\n
    对无法抓取的敌人不适用控制效果。
    """
    name = "回旋钩"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 7
    mp = [20, 300]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 被扔时的冲撞伤害 : {value0}%
    # REMOVE: data0 = [0, 3060, 3369, 3680, 3993, 4301, 4612, 4923, 5233, 5542, 5856, 6166, 6475, 6788, 7098, 7405, 7720, 8029, 8338, 8650, 8961, 9270, 9583, 9894, 10203, 10514, 10824, 11133, 11444, 11757, 12067, 12376, 12689, 12998, 13308, 13620, 13930, 14239, 14549, 14861, 15171, 15482, 15795, 16104, 16414, 16726, 17034, 17345, 17658, 17967, 18277, 18588, 18899, 19210, 19521, 19832, 20142, 20449, 20762, 21073, 21383, 21695, 22005, 22314, 22627, 22936, 23248, 23557, 23868, 24177, 24487]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 撞到墙壁、 地面时的冲撞伤害 : {value1}%
    # REMOVE: data1 = [0, 3060, 3370, 3681, 3991, 4302, 4612, 4923, 5233, 5543, 5854, 6164, 6475, 6785, 7096, 7406, 7717, 8027, 8337, 8648, 8958, 9269, 9579, 9890, 10200, 10510, 10821, 11131, 11442, 11752, 12063, 12373, 12683, 12994, 13304, 13615, 13925, 14236, 14546, 14857, 15167, 15477, 15788, 16098, 16409, 16719, 17030, 17340, 17650, 17961, 18271, 18582, 18892, 19203, 19513, 19823, 20134, 20444, 20755, 21065, 21376, 21686, 21997, 22307, 22617, 22928, 23238, 23549, 23859, 24170, 24480]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [学习帝国枪术后]
    # 可抓取的敌人数量 : {value2}
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    mode = ["可抓取","不可抓取"]    

    def setMode(self, mode):
        if mode == "可抓取":
            self.hit0 = 1
        elif mode == "不可抓取":
            self.hit0 = 0    


# 格挡反击
# demonic_lancer/vanguard/4655101518604f874721b3cc249aae10
# 3deb7be5f01953ac8b1ecaa1e25e0420/4655101518604f874721b3cc249aae10
class Skill7(ActiveSkill):
    """
    斜架长枪抵抗来自前方的攻击。\n
    受到的伤害越多， 接受攻击时被推开的距离越远。\n
    被推开一定距离后， 按下X键可以进行反击。
    """
    name = "格挡反击"
    learnLv = 10
    masterLv = 1
    maxLv = 10
    position = 7 #TODO
    rangeLv = 2
    cd = 6
    mp = [4, 5]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = False

    # 反击的攻击力 : {value0}%
    # REMOVE: data0 = [0, 737, 812, 887, 961, 1036, 1111, 1186, 1260, 1335, 1410]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 所受伤害减少率 : {value1}%
    # REMOVE: data1 = [0, 10, 15, 20, 25, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 落凤枪
# demonic_lancer/vanguard/c9664191611af31142e052dfaef84530
# 3deb7be5f01953ac8b1ecaa1e25e0420/c9664191611af31142e052dfaef84530
class Skill8(ActiveSkill):
    """
    从空中快速地斜向落地， 刺向敌人。
    """
    name = "落凤枪"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 4.5
    mp = [12, 125]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = False

    # 落地攻击力 : {value0}%
    # REMOVE: data0 = [0, 3480, 3833, 4186, 4539, 4892, 5245, 5598, 5951, 6304, 6657, 7010, 7363, 7716, 8070, 8423, 8776, 9129, 9482, 9835, 10188, 10541, 10894, 11247, 11600, 11953, 12306, 12659, 13012, 13365, 13718, 14071, 14424, 14777, 15130, 15483, 15836, 16189, 16543, 16896, 17249, 17602, 17955, 18308, 18661, 19014, 19367, 19720, 20073, 20426, 20779, 21132, 21485, 21838, 22191, 22544, 22897, 23250, 23603, 23956, 24309, 24663, 25016, 25369, 25722, 26075, 26428, 26781, 27134, 27487, 27840]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 地面爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 1873, 2063, 2253, 2443, 2633, 2823, 3013, 3203, 3393, 3583, 3773, 3963, 4153, 4343, 4533, 4723, 4913, 5103, 5293, 5483, 5673, 5863, 6053, 6243, 6433, 6623, 6813, 7003, 7193, 7383, 7573, 7764, 7954, 8144, 8334, 8524, 8714, 8904, 9094, 9284, 9474, 9664, 9854, 10044, 10234, 10424, 10614, 10804, 10994, 11184, 11374, 11564, 11754, 11944, 12134, 12324, 12514, 12704, 12894, 13084, 13274, 13464, 13654, 13844, 14034, 14224, 14414, 14604, 14794, 14984]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 爆炸范围 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 横扫
# demonic_lancer/vanguard/fc7a3f4c2852c832a2f20af63d5d212f
# 3deb7be5f01953ac8b1ecaa1e25e0420/fc7a3f4c2852c832a2f20af63d5d212f
class Skill9(ActiveSkill):
    """
    向前方快速横斩， 击飞敌人。
    """
    name = "横扫"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 4
    mp = [8, 70]
    uuid = "fc7a3f4c2852c832a2f20af63d5d212f"
    hasVP = False
    hasUP = False

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 5092, 5609, 6125, 6642, 7158, 7675, 8191, 8708, 9225, 9741, 10258, 10774, 11291, 11808, 12324, 12841, 13357, 13874, 14390, 14907, 15424, 15940, 16457, 16973, 17490, 18006, 18523, 19040, 19556, 20073, 20589, 21106, 21623, 22139, 22656, 23172, 23689, 24205, 24722, 25239, 25755, 26272, 26788, 27305, 27822, 28338, 28855, 29371, 29888, 30404, 30921, 31438, 31954, 32471, 32987, 33504, 34020, 34537, 35054, 35570, 36087, 36603, 37120, 37637, 38153, 38670, 39186, 39703, 40219, 40736]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1

# 魔枪发射
# demonic_lancer/vanguard/51a08fd0c90f0a5276cd552047fac93d
# 3deb7be5f01953ac8b1ecaa1e25e0420/51a08fd0c90f0a5276cd552047fac93d
class Skill10(ActiveSkill):
    """
    将气息聚集到魔枪尖端， 然后投掷魔枪。\n
    魔法枪对命中的敌人造成多段伤害后消失。
    """
    name = "魔枪发射"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 1 #TODO
    rangeLv = 2
    cd = 4.5
    mp = [10, 115]
    uuid = "51a08fd0c90f0a5276cd552047fac93d"
    hasVP = False
    hasUP = False

    # 魔法枪多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 1155, 1272, 1389, 1507, 1624, 1741, 1858, 1975, 2092, 2210, 2327, 2444, 2561, 2678, 2795, 2913, 3030, 3147, 3264, 3381, 3498, 3616, 3733, 3850, 3967, 4084, 4202, 4319, 4436, 4553, 4670, 4787, 4905, 5022, 5139, 5256, 5373, 5490, 5608, 5725, 5842, 5959, 6076, 6193, 6311, 6428, 6545, 6662, 6779, 6897, 7014, 7131, 7248, 7365, 7482, 7600, 7717, 7834, 7951, 8068, 8185, 8303, 8420, 8537, 8654, 8771, 8888, 9006, 9123, 9240]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 4
    # 魔法枪多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 强化 - 后跳
# demonic_lancer/vanguard/2b340542e776818b78f3212af184bd6b
# 3deb7be5f01953ac8b1ecaa1e25e0420/2b340542e776818b78f3212af184bd6b
class Skill11(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# demonic_lancer/vanguard/1fea5a626f15230237946a11a9d11582
# 3deb7be5f01953ac8b1ecaa1e25e0420/1fea5a626f15230237946a11a9d11582
class Skill12(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 连环枪
# demonic_lancer/vanguard/717f1e2104fe4b796f800352fa143ecc
# 3deb7be5f01953ac8b1ecaa1e25e0420/717f1e2104fe4b796f800352fa143ecc
class Skill13(ActiveSkill):
    """
    使用长枪进行连续攻击。 命中敌人时按下技能键， 即刻发动下一次攻击。
    """
    name = "连环枪"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 6
    mp = [13, 120]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = True

    # 命中敌人后， 即刻发动下一攻击所需的按键间隔 : 0.5秒
    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 1480, 1630, 1780, 1930, 2080, 2230, 2380, 2530, 2681, 2831, 2981, 3131, 3281, 3431, 3581, 3731, 3882, 4032, 4182, 4332, 4482, 4632, 4782, 4932, 5082, 5233, 5383, 5533, 5683, 5833, 5983, 6133, 6283, 6433, 6584, 6734, 6884, 7034, 7184, 7334, 7484, 7634, 7784, 7935, 8085, 8235, 8385, 8535, 8685, 8835, 8985, 9136, 9286, 9436, 9586, 9736, 9886, 10036, 10186, 10336, 10487, 10637, 10787, 10937, 11087, 11237, 11387, 11537, 11687, 11838]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 上挑攻击力 : {value1}%
    # REMOVE: data1 = [0, 1742, 1919, 2095, 2272, 2449, 2625, 2802, 2979, 3156, 3332, 3509, 3686, 3862, 4039, 4216, 4393, 4569, 4746, 4923, 5099, 5276, 5453, 5630, 5806, 5983, 6160, 6336, 6513, 6690, 6867, 7043, 7220, 7397, 7573, 7750, 7927, 8104, 8280, 8457, 8634, 8810, 8987, 9164, 9341, 9517, 9694, 9871, 10047, 10224, 10401, 10577, 10754, 10931, 11108, 11284, 11461, 11638, 11814, 11991, 12168, 12345, 12521, 12698, 12875, 13051, 13228, 13405, 13582, 13758, 13935]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 向上攻击力 : {value2}%
    # REMOVE: data2 = [0, 1901, 2094, 2287, 2480, 2673, 2866, 3059, 3252, 3444, 3637, 3830, 4023, 4216, 4409, 4602, 4795, 4988, 5180, 5373, 5566, 5759, 5952, 6145, 6338, 6531, 6724, 6916, 7109, 7302, 7495, 7688, 7881, 8074, 8267, 8460, 8652, 8845, 9038, 9231, 9424, 9617, 9810, 10003, 10196, 10388, 10581, 10774, 10967, 11160, 11353, 11546, 11739, 11932, 12124, 12317, 12510, 12703, 12896, 13089, 13282, 13475, 13668, 13860, 14053, 14246, 14439, 14632, 14825, 15018, 15211]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 下刺攻击力 : {value3}%
    # REMOVE: data3 = [0, 2060, 2269, 2478, 2687, 2896, 3105, 3314, 3523, 3732, 3941, 4150, 4359, 4568, 4777, 4986, 5195, 5404, 5613, 5822, 6031, 6240, 6449, 6658, 6867, 7076, 7285, 7494, 7703, 7912, 8121, 8330, 8539, 8748, 8957, 9166, 9375, 9584, 9793, 10002, 10211, 10420, 10629, 10838, 11047, 11256, 11465, 11674, 11883, 12092, 12301, 12510, 12719, 12928, 13137, 13346, 13555, 13764, 13973, 14182, 14391, 14600, 14809, 15018, 15227, 15436, 15645, 15854, 16063, 16272, 16481]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 敌人的僵直增加量 : {value4}%
    # REMOVE: data4 = [0, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290, 300, 310, 320, 330, 340, 350, 360, 370, 380, 390, 400, 410, 420, 430, 440, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640, 650, 660, 670, 680, 690, 700, 710, 720, 730, 740, 750, 760, 770, 780, 790]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 狂暴战戟
# demonic_lancer/vanguard/0ed3148658fe37b3336ccb718dc0fdb0
# 3deb7be5f01953ac8b1ecaa1e25e0420/0ed3148658fe37b3336ccb718dc0fdb0
class Skill14(PassiveSkill):
    """
    征战者特有的枪术， 能更有破坏力地使用魔枪。 学习后， 基础攻击动作将会改变。 同时， [枪挑]将会被[上斩]代替， [上斩]技能等级受[枪挑]影响， 但是造成的伤害更高。
    """
    name = "狂暴战戟"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    uuid = "0ed3148658fe37b3336ccb718dc0fdb0"
    hasVP = False
    hasUP = False

    # [枪挑]攻击力增加率 : 120%

# 扫堂枪
# demonic_lancer/vanguard/128b9ddef2262f40723deae4407bdb42
# 3deb7be5f01953ac8b1ecaa1e25e0420/128b9ddef2262f40723deae4407bdb42
class Skill15(ActiveSkill):
    """
    攻击敌人足部， 使之倒地。
    """
    name = "扫堂枪"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    mp = [12, 120]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = False
    hasUP = True

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 7043, 7758, 8472, 9187, 9901, 10616, 11330, 12045, 12759, 13474, 14188, 14903, 15617, 16332, 17046, 17761, 18475, 19190, 19904, 20619, 21333, 22048, 22762, 23477, 24191, 24906, 25620, 26335, 27049, 27764, 28478, 29193, 29907, 30622, 31336, 32051, 32765, 33480, 34194, 34909, 35623, 36338, 37052, 37767, 38481, 39196, 39910, 40625, 41339, 42054, 42768, 43483, 44197, 44912, 45626, 46341, 47055, 47770, 48484, 49199, 49913, 50628, 51342, 52057, 52771, 53486, 54200, 54915, 55629, 56344]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1

# 霸王戟
# demonic_lancer/vanguard/78be08a3f8c834d3b06fa20c6a08c5a5
# 3deb7be5f01953ac8b1ecaa1e25e0420/78be08a3f8c834d3b06fa20c6a08c5a5
class Skill16(ActiveSkill):
    """
    强制中断基本攻击、 前冲攻击、 后跳， 并进行强力一击。 基本攻击第一击或前冲攻击后使用时， 会拉开距离并向下斩； 基本攻击第二击之后使用时， 会施放横斩； 基本攻击第三击后使用时， 角色会后退并施放强力的横斩。 使用技能时按向前方向键， 角色不会后退， 并在原地进行横斩。 可以强制中断基本攻击并施放的技能都可以强制中断[霸王戟]并施放， 且受到[基础精通]的影响。\n
    [后跳]中施放技能时有冷却时间。
    """
    name = "霸王戟"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 2
    mp = [3, 3]
    uuid = "78be08a3f8c834d3b06fa20c6a08c5a5"
    hasVP = False
    hasUP = False

    # 后跳中使用时冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 0.4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 接平x第一下
    data1 = [(i*1.091*1.051) for i in [0, 289.33]]
    hit1 = 1
    # 接平x第二下
    data2 = [(i*1.091*1.051) for i in [0, 399.60]]
    hit2 = 0
    # 接平x第三下
    data3 = [(i*1.091*1.051) for i in [0, 429.59]]
    hit3 = 0

    mode = ["下斩","横斩","强力横斩"]    

    def setMode(self, mode):
        if mode == "下斩":
            self.hit1 = 1
            self.hit0 = self.hit2 = self.hit3 = 0
        elif mode == "横斩":
            self.hit2 = 1
            self.hit0 = self.hit1 = self.hit3 = 0
        elif mode == "强力横斩":
            self.hit3 = 1
            self.hit0 = self.hit1 = self.hit2 = 0

# 战戟精通
# demonic_lancer/vanguard/c61f5a010370101402b05b21916c2071
# 3deb7be5f01953ac8b1ecaa1e25e0420/c61f5a010370101402b05b21916c2071
class Skill17(PassiveSkill):
    """
    征战者手握魔枪后， 把体内的破坏欲与潜力全都激发出来， 把攻击性最大化， 产生强大的破坏力。\n
    [装备战戟时的效果]\n
    减少魔法值消耗量。\n
    增加攻击速度和命中率。\n
    [基础效果]\n
    增加物理攻击力， 攻击过程中遭受一定伤害以下的攻击时， 不会僵直。 (可以开启与关闭)
    """
    name = "战戟精通"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    uuid = "c61f5a010370101402b05b21916c2071"
    hasVP = False
    hasUP = False

    # 物理武器攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 装备战戟时， 攻击速度增加 : {value1}%
    # REMOVE: data1 = [0, 9, 9.8, 10.6, 11.4, 12.2, 13, 13.8, 14.6, 15.4, 16.2, 17, 17.8, 18.6, 19.4, 20.2, 21, 21.8, 22.6, 23.4, 24.2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 装备战戟时， 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 3, 3.8, 4.6, 5.4, 6.2, 7, 7.8, 8.6, 9.4, 10.2, 11, 11.8, 12.6, 13.4, 14.2, 15, 15.8, 16.6, 17.4, 18.2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 装备战戟时， 魔法值消耗减少率 : 20%
    # 被普通怪物攻击时， 不会僵直的伤害量上限 : 生命值最大值的{value3}%
    # REMOVE: data3 = [0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 被稀有怪物攻击时， 不会僵直的伤害量上限 : 生命值最大值的{value4}%
    # REMOVE: data4 = [0, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 被领主怪物攻击时， 不会僵直的伤害量上限 : 生命值最大值的{value5}%
    # REMOVE: data5 = [0, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    associate = [ {"type":"$*PAtkP","data":data0}]

# 破军突击
# demonic_lancer/vanguard/c27418ae613c647527200a7ca17d97fd
# 3deb7be5f01953ac8b1ecaa1e25e0420/c27418ae613c647527200a7ca17d97fd
class Skill18(ActiveSkill):
    """
    进行强力的突进攻击。 按下向前方向键可以突进更远的距离， 按上/下方向键会以对角线的轨迹突进。\n
    被最后一击命中的敌人会进入眩晕状态。
    """
    name = "破军突击"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 5
    mp = [12, 200]
    uuid = "c27418ae613c647527200a7ca17d97fd"
    hasVP = False
    hasUP = True

    # 多段打击攻击力 : {value0}%
    # REMOVE: data0 = [0, 406, 447, 488, 530, 571, 612, 653, 694, 736, 777, 818, 859, 900, 942, 983, 1024, 1065, 1106, 1148, 1189, 1230, 1271, 1312, 1354, 1395, 1436, 1477, 1518, 1560, 1601, 1642, 1683, 1724, 1766, 1807, 1848, 1889, 1930, 1972, 2013, 2054, 2095, 2136, 2178, 2219, 2260, 2301, 2342, 2384, 2425, 2466, 2507, 2548, 2589, 2631, 2672, 2713, 2754, 2795, 2837, 2878, 2919, 2960, 3001, 3043, 3084, 3125, 3166, 3207, 3249]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 5
    # 多段攻击次数上限 : {value1}次
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 6994, 7703, 8413, 9122, 9832, 10541, 11251, 11960, 12670, 13379, 14089, 14798, 15508, 16217, 16927, 17636, 18346, 19055, 19765, 20474, 21184, 21893, 22603, 23312, 24021, 24731, 25440, 26150, 26859, 27569, 28278, 28988, 29697, 30407, 31116, 31826, 32535, 33245, 33954, 34664, 35373, 36083, 36792, 37502, 38211, 38921, 39630, 40340, 41049, 41759, 42468, 43178, 43887, 44597, 45306, 46016, 46725, 47435, 48144, 48854, 49563, 50273, 50982, 51692, 52401, 53111, 53820, 54530, 55239, 55949]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 眩晕几率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 眩晕持续时间 : {value4}秒
    # REMOVE: data4 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 不灭战戟
# demonic_lancer/vanguard/de3fea2d65c597f4d55c70a02b97fc79
# 3deb7be5f01953ac8b1ecaa1e25e0420/de3fea2d65c597f4d55c70a02b97fc79
class Skill19(ActiveSkill):
    """
    瞬间解放为了不被魔枪支配而抑制的魔枪之力， 在一段时间内使自身的破坏力极大化。\n
    增加物理暴击率和暴击伤害。
    """
    name = "不灭战戟"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    uuid = "de3fea2d65c597f4d55c70a02b97fc79"
    hasVP = False
    hasUP = False

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 暴击伤害增加率 : {value1}%
    # REMOVE: data1 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 物理暴击率增加 : {value2}%
    # REMOVE: data2 = [0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暴击
# demonic_lancer/vanguard/fc1262c19f3d0477ee8eda47b8db8696
# 3deb7be5f01953ac8b1ecaa1e25e0420/fc1262c19f3d0477ee8eda47b8db8696
class Skill20(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 追魂斩
# demonic_lancer/vanguard/01384bbfc346775d1267fa0bc4ca605f
# 3deb7be5f01953ac8b1ecaa1e25e0420/01384bbfc346775d1267fa0bc4ca605f
class Skill21(ActiveSkill):
    """
    向前方施放两段强力的横斩。 被击中的敌人会进入短暂的僵直。 按向前方向键施放技能， 可以前进更远的距离并施放横斩。
    """
    name = "追魂斩"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 6
    mp = [15, 300]
    uuid = "01384bbfc346775d1267fa0bc4ca605f"
    hasVP = False
    hasUP = True

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 5171, 5696, 6220, 6745, 7269, 7794, 8319, 8843, 9368, 9892, 10417, 10942, 11466, 11991, 12515, 13040, 13565, 14089, 14614, 15138, 15663, 16187, 16712, 17237, 17761, 18286, 18810, 19335, 19860, 20384, 20909, 21433, 21958, 22483, 23007, 23532, 24056, 24581, 25106, 25630, 26155, 26679, 27204, 27729, 28253, 28778, 29302, 29827, 30352, 30876, 31401, 31925, 32450, 32974, 33499, 34024, 34548, 35073, 35597, 36122, 36647, 37171, 37696, 38220, 38745, 39270, 39794, 40319, 40843, 41368]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 斩击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 战戟猛攻
# demonic_lancer/vanguard/92360eab6e1f378902018eca681ac629
# 3deb7be5f01953ac8b1ecaa1e25e0420/92360eab6e1f378902018eca681ac629
class Skill22(PassiveSkill):
    """
    突破极限， 其他技能命中敌人后可以强制中断并施放[战戟猛攻]， 发动强力一击。(觉醒技能除外)\n
    相反， 也可以在[战戟猛攻]命中敌人后强制中断并使用其他技能。\n
    [战戟猛攻]只能按现有的能量层数使用， 消耗的能量层数在能量蓄满后恢复。施放技能时按向前方向键， 会向前前进。 一直按住技能键会维持攻击准备状态， 所受伤害也会减少。\n
    使用[霸王戟]或[战戟猛攻]攻击敌人时， 会在一段时间内增加物理攻击力和生命值最大值。\n
    在决斗场不会增加生命值最大值。
    """
    name = "战戟猛攻"
    learnLv = 25
    masterLv = 20
    maxLv = 30
    position = 2 #TODO
    rangeLv = 3
    uuid = "92360eab6e1f378902018eca681ac629"
    hasVP = False
    hasUP = False

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 7574, 8781, 9989, 11196, 12404, 13611, 14819, 16026, 17234, 18441, 19648, 20856, 22063, 23271, 24478, 25686, 26893, 28101, 29308, 30516, 31723, 32930, 34138, 35345, 36553, 37760, 38968, 40175, 41383, 42590]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 所受伤害减少率 : {value1}%
    # REMOVE: data1 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 增益效果持续时间 : {value2}秒
    # REMOVE: data2 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 物理攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 生命值最大值增加 : {value4}
    # REMOVE: data4 = [0, 648, 682, 717, 751, 784, 818, 853, 887, 921, 954, 990, 1023, 1057, 1091, 1126, 1160, 1193, 1227, 1262, 1296, 1330, 1365, 1399, 1432, 1466, 1501, 1535, 1569, 1602, 1638]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 能量层数 : 2
    # 能量恢复时间 : {value5}秒
    # REMOVE: data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 斩击范围比率 : {value6}%
    # REMOVE: data6 = [0, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    associate = [ {"type":"$*PAtkP","data":data3}]

# 落月斩
# demonic_lancer/vanguard/dc1ffbe7bfcc6dc2be737951960da9ad
# 3deb7be5f01953ac8b1ecaa1e25e0420/dc1ffbe7bfcc6dc2be737951960da9ad
class Skill23(ActiveSkill):
    """
    跳跃后， 强力下劈攻击敌人。 施放技能时按向前方向键， 可以跳跃更远的距离进行下劈。
    """
    name = "落月斩"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 7
    mp = [30, 350]
    uuid = "dc1ffbe7bfcc6dc2be737951960da9ad"
    hasVP = False
    hasUP = True

    # 下劈攻击力 : {value0}%
    # REMOVE: data0 = [0, 14226, 15669, 17112, 18556, 19999, 21442, 22885, 24329, 25772, 27215, 28658, 30101, 31545, 32988, 34431, 35874, 37317, 38761, 40204, 41647, 43090, 44534, 45977, 47420, 48863, 50306, 51750, 53193, 54636, 56079, 57523, 58966, 60409, 61852, 63295, 64739, 66182, 67625, 69068, 70511, 71955, 73398, 74841, 76284, 77728, 79171, 80614, 82057, 83500, 84944, 86387, 87830, 89273, 90717, 92160, 93603, 95046, 96489, 97933, 99376, 100819, 102262, 103705, 105149, 106592, 108035, 109478, 110922, 112365, 113808]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 下斩范围比率 : {value1}%
    # REMOVE: data1 = [0, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 冷血突刺
# demonic_lancer/vanguard/e49e57b2e8fbeceb0a2c56a0c63fe6c5
# 3deb7be5f01953ac8b1ecaa1e25e0420/e49e57b2e8fbeceb0a2c56a0c63fe6c5
class Skill24(ActiveSkill):
    """
    聚集力量， 向前方施放破坏性刺击。 被击中的敌人会被击退， 并受到多段伤害。
    """
    name = "冷血突刺"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 16
    mp = [100, 920]
    uuid = "e49e57b2e8fbeceb0a2c56a0c63fe6c5"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 刺击攻击力 : {value0}%
    # REMOVE: data0 = [0, 14813, 16316, 17819, 19322, 20824, 22327, 23830, 25333, 26836, 28338, 29841, 31344, 32847, 34350, 35852, 37355, 38858, 40361, 41864, 43366, 44869, 46372, 47875, 49378, 50880, 52383, 53886, 55389, 56892, 58394, 59897, 61400, 62903, 64405, 65908, 67411, 68914, 70417, 71919, 73422, 74925, 76428, 77931, 79433, 80936, 82439, 83942, 85445, 86947, 88450, 89953, 91456, 92959, 94461, 95964, 97467, 98970, 100473, 101975, 103478, 104981, 106484, 107987, 109489, 110992, 112495, 113998, 115501, 117003, 118506]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 每1次旋风打击的攻击力 : {value1}%
    # REMOVE: data1 = [0, 1641, 1808, 1974, 2141, 2307, 2474, 2640, 2807, 2973, 3140, 3306, 3473, 3639, 3806, 3972, 4138, 4305, 4471, 4638, 4804, 4971, 5137, 5304, 5470, 5637, 5803, 5970, 6136, 6303, 6469, 6636, 6802, 6969, 7135, 7302, 7468, 7635, 7801, 7968, 8134, 8301, 8467, 8634, 8800, 8967, 9133, 9300, 9466, 9633, 9799, 9966, 10132, 10299, 10465, 10632, 10798, 10965, 11131, 11298, 11464, 11631, 11797, 11964, 12130, 12297, 12463, 12630, 12796, 12962, 13129]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 6
    # 多段攻击次数上限 : {value2}次
    # REMOVE: data2 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 旋风范围 : {value3}px
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [冷血突刺]\n
        旋风会吸附周围的敌人\n
         - 攻击范围 +45%
        """
        ...

    def vp_2(self):
        """
        [冷血突刺]\n
        施放时， 跳向600px内的最强敌人并插入魔枪\n
         - 删除旋风多段攻击\n
         - 总攻击力相同\n
        魔枪的斗气会强制控制敌人\n
         - 持续时间 : 3秒
        """
        ...

# 破灭斩
# demonic_lancer/vanguard/e4c354a89c337310aeb7041d5e742828
# 3deb7be5f01953ac8b1ecaa1e25e0420/e4c354a89c337310aeb7041d5e742828
class Skill25(ActiveSkill):
    """
    聚集力量， 向前方施放致命的横斩。
    """
    name = "破灭斩"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 14
    mp = [60, 850]
    uuid = "e4c354a89c337310aeb7041d5e742828"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 横斩攻击力 : {value0}%
    # REMOVE: data0 = [0, 20614, 22705, 24797, 26888, 28979, 31070, 33162, 35253, 37344, 39435, 41527, 43618, 45709, 47801, 49892, 51983, 54074, 56166, 58257, 60348, 62440, 64531, 66622, 68713, 70805, 72896, 74987, 77078, 79170, 81261, 83352, 85444, 87535, 89626, 91717, 93809, 95900, 97991, 100082, 102174, 104265, 106356, 108448, 110539, 112630, 114721, 116813, 118904, 120995, 123086, 125178, 127269, 129360, 131452, 133543, 135634, 137725, 139817, 141908, 143999, 146091, 148182, 150273, 152364, 154456, 156547, 158638, 160729, 162821, 164912]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 斩击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [破灭斩]\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 7秒\n
         - 单次攻击力 -50%\n
        攻击范围 +70%
        """
        self.cd = 7
        self.skillRation *= 0.5

    def vp_2(self):
        """
        [破灭斩]\n
        除觉醒技能外的其他技能命中敌人后， 可以强制中断并施放[破灭斩]\n
         - [破灭斩]命中时， 5秒内命中率 +50%
        """
        ...

# 灭袭乱舞
# demonic_lancer/vanguard/1fadde0eece18649caddbca7bd58cc2f
# 3deb7be5f01953ac8b1ecaa1e25e0420/1fadde0eece18649caddbca7bd58cc2f
class Skill26(ActiveSkill):
    """
    在原地反复地快速横斩后， 施放强力的最后一击。 被横斩击中的敌人会渐渐聚在中间， 连续按下攻击键或技能键可以加快攻击速度。
    """
    name = "灭袭乱舞"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [150, 1260]
    uuid = "1fadde0eece18649caddbca7bd58cc2f"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 每1次横斩的攻击力 : {value0}%
    # REMOVE: data0 = [0, 1723, 1897, 2072, 2247, 2422, 2596, 2771, 2946, 3121, 3295, 3470, 3645, 3820, 3994, 4169, 4344, 4519, 4693, 4868, 5043, 5218, 5392, 5567, 5742, 5916, 6091, 6266, 6441, 6615, 6790, 6965, 7140, 7314, 7489, 7664, 7839, 8013, 8188, 8363, 8538, 8712, 8887, 9062, 9237, 9411, 9586, 9761, 9936, 10110, 10285, 10460, 10635, 10809, 10984, 11159, 11334, 11508, 11683, 11858, 12033, 12207, 12382, 12557, 12732, 12906, 13081, 13256, 13431, 13605, 13780]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 12
    # 横斩次数 : {value1}次
    # REMOVE: data1 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 8859, 9757, 10656, 11555, 12454, 13352, 14251, 15150, 16048, 16947, 17846, 18744, 19643, 20542, 21441, 22339, 23238, 24137, 25035, 25934, 26833, 27732, 28630, 29529, 30428, 31326, 32225, 33124, 34023, 34921, 35820, 36719, 37617, 38516, 39415, 40314, 41212, 42111, 43010, 43908, 44807, 45706, 46604, 47503, 48402, 49301, 50199, 51098, 51997, 52895, 53794, 54693, 55592, 56490, 57389, 58288, 59186, 60085, 60984, 61883, 62781, 63680, 64579, 65477, 66376, 67275, 68173, 69072, 69971, 70870]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [灭袭乱舞]\n
        用力挥动战戟， 以确保更有效的攻击\n
         - 横劈次数 -10次\n
         - 总攻击力相同\n
         - 删除连按时增加攻击速度的功能\n
        攻击范围 +40%
        """
        ...

    def vp_2(self):
        """
        [灭袭乱舞]\n
        与魔枪一起进入疯狂状态， 施放技能过程中所受伤害 -80%\n
        每次命中时， 技能结束后获得攻击速度和移动速度增益\n
         - 每次攻击时， 攻击速度和移动速度 +1%\n
         - 增益持续时间 : 15秒
        """
        ...

# 横扫八荒
# demonic_lancer/vanguard/4b2c90ec226fd40e967875aa5eabefb2
# 3deb7be5f01953ac8b1ecaa1e25e0420/4b2c90ec226fd40e967875aa5eabefb2
class Skill27(ActiveSkill):
    """
    将长枪举过头顶， 大幅旋转攻击敌人后， 施放强力的最后一击。 旋转攻击命中时将敌人聚集到中心。 使用方向键可以移动角色， 并且连续按下攻击键或技能键可以加快攻击速度。 技能施放过程中按下Z键， 会立即施放最后一击。
    """
    name = "横扫八荒"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [222, 2225]
    uuid = "4b2c90ec226fd40e967875aa5eabefb2"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 每1次旋转横斩的攻击力 : {value0}%
    # REMOVE: data0 = [0, 3820, 4207, 4595, 4982, 5370, 5757, 6145, 6532, 6920, 7307, 7695, 8082, 8470, 8857, 9245, 9632, 10020, 10407, 10795, 11182, 11570, 11958, 12345, 12733, 13120, 13508, 13895, 14283, 14670, 15058, 15445, 15833, 16220, 16608, 16995, 17383, 17770, 18158, 18545, 18933, 19320, 19708, 20095, 20483, 20870, 21258, 21645, 22033, 22420, 22808, 23195, 23583, 23970, 24358, 24745, 25133, 25520, 25908, 26295, 26683, 27070, 27458, 27845, 28233, 28621, 29008, 29396, 29783, 30171, 30558]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 9
    # 旋转横斩次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 20190, 22238, 24287, 26335, 28383, 30432, 32480, 34528, 36576, 38625, 40673, 42721, 44769, 46818, 48866, 50914, 52963, 55011, 57059, 59107, 61156, 63204, 65252, 67301, 69349, 71397, 73445, 75494, 77542, 79590, 81638, 83687, 85735, 87783, 89832, 91880, 93928, 95976, 98025, 100073, 102121, 104170, 106218, 108266, 110314, 112363, 114411, 116459, 118507, 120556, 122604, 124652, 126701, 128749, 130797, 132845, 134894, 136942, 138990, 141039, 143087, 145135, 147183, 149232, 151280, 153328, 155376, 157425, 159473, 161521]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 挥斩范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [横扫八荒]\n
        旋转斩击攻击次数 -7次\n
         - 总攻击力相同\n
        最后一击命中时恢复2次[战戟猛攻]能量层数， 并使敌人进入眩晕异常状态\n
         - 眩晕几率100%\n
         - 持续时间3秒
        """
        ...

    def vp_2(self):
        """
        [横扫八荒]\n
        施放技能时进入无敌状态\n
        攻击范围 +20%
        """
        ...

# 战戟之魂
# demonic_lancer/vanguard/d2c6df5105577fb59fb92529a36165a0
# 3deb7be5f01953ac8b1ecaa1e25e0420/d2c6df5105577fb59fb92529a36165a0
class Skill28(PassiveSkill):
    """
    从无数次绝境中存活下来并变强的征战者， 可以不用抑制魔枪之力， 并且可以支配魔枪之力。\n
    增加基本攻击力和技能攻击力， 并且征战者的生命值低于一定值时， 会产生下列效果。 (强化效果共分为2阶段)\n
     - 增加攻击速度\n
     - 增加攻击过程中被击时， 不会僵直的伤害量上限\n
     - 在第2阶段， 无视僵直不仅适用于攻击， 还适用于除攻击以外的所有情况。
    """
    name = "战戟之魂"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "d2c6df5105577fb59fb92529a36165a0"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [战戟猛攻]叠加次数增加量 : {value1}
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [战戟猛攻]效果额外攻击速度 : {value2}%
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # -  [每个阶段发动效果所需的生命值比率]  -
    # 第1阶段 : {value3}%
    # REMOVE: data3 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 第2阶段 : {value4}%
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [第1阶段]被击时， 不会进入僵直的伤害量上限增加 : 生命值最大值的{value5}%
    # REMOVE: data5 = [0, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [第2阶段]被击时， 不会进入僵直的伤害量上限增加 : 生命值最大值的{value6}%
    # REMOVE: data6 = [0, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    associate = [ {"data":data0,"type":"*skillRation"}]

# 千魂弑
# demonic_lancer/vanguard/d0cdaca82892e54097f22a1f60817048
# 3deb7be5f01953ac8b1ecaa1e25e0420/d0cdaca82892e54097f22a1f60817048
class Skill29(ActiveSkill):
    """
    瞬间释放全部魔枪之力， 强力地砸向地面使敌人浮空， 之后用强力的横斩斩掉所有敌人。\n
    对无法抓取的敌人， 不适用浮空判定。\n
    施放技能时， 适用[战戟猛攻]增益效果。
    """
    name = "千魂弑"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [980, 8232]
    uuid = "d0cdaca82892e54097f22a1f60817048"
    hasVP = False
    hasUP = False

    # 下劈攻击力 : {value0}%
    # REMOVE: data0 = [0, 21081, 25970, 30858, 35747, 40635, 45524, 50412, 55300, 60189, 65077, 69966, 74854, 79743, 84631, 89520, 94408, 99296, 104185, 109073, 113962, 118850, 123739, 128627, 133516, 138404, 143292, 148181, 153069, 157958, 162846, 167735, 172623, 177511, 182400, 187288, 192177, 197065, 201954, 206842, 211731, 216619, 221507, 226396, 231284, 236173, 241061, 245950, 250838, 255727, 260615]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 84326, 103879, 123433, 142987, 162541, 182094, 201648, 221202, 240756, 260309, 279863, 299417, 318971, 338525, 358078, 377632, 397186, 416740, 436293, 455847, 475401, 494955, 514508, 534062, 553616, 573170, 592723, 612277, 631831, 651385, 670938, 690492, 710046, 729600, 749154, 768707, 788261, 807815, 827369, 846922, 866476, 886030, 905584, 925137, 944691, 964245, 983799, 1003352, 1022906, 1042460]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1

# 长虹贯日
# demonic_lancer/vanguard/1803b6a67047cafb9e289b4f33cc507b
# 3deb7be5f01953ac8b1ecaa1e25e0420/1803b6a67047cafb9e289b4f33cc507b
class Skill30(ActiveSkill):
    """
    刺穿敌人并将敌人举起， 跳向空中强力地砸向地面， 对周围的敌人造成冲击波伤害。 如果刺穿攻击没有命中敌人， 随后的攻击也无法施放。
    """
    name = "长虹贯日"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [250, 1000]
    uuid = "1803b6a67047cafb9e289b4f33cc507b"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 刺击攻击力 : {value0}%
    # REMOVE: data0 = [0, 15641, 17227, 18814, 20401, 21987, 23574, 25161, 26748, 28334, 29921, 31508, 33094, 34681, 36268, 37855, 39441, 41028, 42615, 44201, 45788, 47375, 48962, 50548, 52135, 53722, 55308, 56895, 58482, 60069, 61655, 63242, 64829, 66415, 68002, 69589, 71176, 72762, 74349, 75936, 77522, 79109, 80696, 82283, 83869, 85456, 87043, 88630, 90216, 91803, 93390]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 36495, 40197, 43899, 47602, 51304, 55006, 58709, 62411, 66113, 69816, 73518, 77220, 80923, 84625, 88327, 92030, 95732, 99434, 103137, 106839, 110541, 114244, 117946, 121648, 125351, 129053, 132755, 136458, 140160, 143862, 147565, 151267, 154969, 158672, 162374, 166076, 169779, 173481, 177183, 180886, 184588, 188290, 191993, 195695, 199397, 203100, 206802, 210505, 214207, 217909]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 最后冲击波范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最终爆炸范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [长虹贯日]\n
        删除刺击攻击\n
         - 总攻击力相同\n
        最后一击命中时， 生命值低于20%的普通怪物立即被击败\n
        攻击范围 +50%
        """
        ...

    def vp_2(self):
        """
        [长虹贯日]\n
        基本冷却时间变更为37.5秒\n
         - 总攻击力 +50%\n
        刺击未命中时， 剩余冷却时间缩短为3秒
        """
        self.cd = 37.5
        self.skillRation *= 1.5

# 穿云裂地斩
# demonic_lancer/vanguard/0232c151ef3731c2dede51931a374723
# 3deb7be5f01953ac8b1ecaa1e25e0420/0232c151ef3731c2dede51931a374723
class Skill31(ActiveSkill):
    """
    跳跃并聚集力量， 强力地砸向地面， 对敌人造成致命伤害， 并且破坏地面， 对附近的敌人也造成伤害。 被下劈命中的敌人不会受到冲击波伤害。
    """
    name = "穿云裂地斩"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [600, 1480]
    uuid = "0232c151ef3731c2dede51931a374723"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 下劈攻击力 : {value0}%
    # REMOVE: data0 = [0, 100370, 110552, 120735, 130917, 141100, 151282, 161465, 171647, 181830, 192012, 202195, 212377, 222560, 232742, 242924, 253107, 263289, 273472, 283654, 293837, 304019, 314202, 324384, 334567, 344749, 354932, 365114, 375297, 385479, 395661, 405844, 416026, 426209, 436391, 446574, 456756, 466939, 477121, 487304, 497486, 507669, 517851, 528033, 538216, 548398, 558581, 568763, 578946, 589128, 599311]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 冲击波攻击力 : {value1}%
    # REMOVE: data1 = [0, 89801, 98911, 108022, 117132, 126242, 135352, 144463, 153573, 162683, 171793, 180904, 190014, 199124, 208234, 217345, 226455, 235565, 244675, 253786, 262896, 272006, 281116, 290227, 299337, 308447, 317557, 326668, 335778, 344888, 353998, 363109, 372219, 381329, 390439, 399550, 408660, 417770, 426880, 435991, 445101, 454211, 463321, 472432, 481542, 490652, 499762, 508873, 517983, 527093, 536203]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 冲击波范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [穿云裂地斩]\n
        施放[穿云裂地斩]后连接[战戟猛攻]时， 发动[落月斩]\n
         - 不消耗[战戟猛攻]可使用次数\n
        攻击范围 +40%
        """
        ...

    def vp_2(self):
        """
        [穿云裂地斩]\n
        向后跳跃并施放[穿云裂地斩]\n
        施放技能后的一定时间内， 征战者所受伤害减少\n
         - 伤害减少量 : 15%\n
         - 持续时间 : 10秒\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 25秒\n
         - 单次攻击力 -50%
        """
        self.cd = 25
        self.skillRation *= 0.5

# 破灭轮回刺
# demonic_lancer/vanguard/d296043df164385a14cb973c8c7c4d07
# 3deb7be5f01953ac8b1ecaa1e25e0420/d296043df164385a14cb973c8c7c4d07
class Skill32(ActiveSkill):
    """
    将长枪大幅度地旋转2次， 控制住附近的敌人， 使之聚集在前方后， 进行强力的最后一击。
    """
    name = "破灭轮回刺"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "d296043df164385a14cb973c8c7c4d07"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 回旋斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 8694, 9576, 10458, 11340, 12222, 13104, 13986, 14868, 15750, 16632, 17514, 18396, 19278, 20160, 21042, 21924, 22806, 23688, 24570, 25452, 26334, 27216, 28098, 28980, 29862, 30744, 31626, 32508, 33390, 34272, 35154, 36036, 36918, 37800, 38682, 39564, 40446, 41328, 42210, 43092, 43974, 44856, 45738, 46620, 47502, 48384, 49266, 50148, 51030, 51912]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 2
    # 旋转斩击次数 : 2次
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 69552, 76608, 83664, 90720, 97776, 104832, 111888, 118944, 126000, 133056, 140112, 147168, 154224, 161280, 168336, 175392, 182448, 189504, 196560, 203616, 210672, 217728, 224784, 231840, 238896, 245952, 253008, 260064, 267120, 274176, 281232, 288288, 295344, 302400, 309456, 316512, 323568, 330624, 337680, 344736, 351792, 358848, 365904, 372960, 380016, 387072, 394128, 401184, 408240, 415296]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [破灭轮回刺]\n
        旋转攻击不吸附周围敌人； 使用战戟下劈地面， 引发冲击波\n
         - 总攻击力相同\n
        攻击范围 +30%
        """
        ...

    def vp_2(self):
        """
        [破灭轮回刺]\n
        战意喷薄而出， 对周围敌人造成伤害； 同时展开战意领域， 造成持续伤害\n
         - 总攻击力相同\n
        [战意领域效果]\n
        在战意领域中， 征战者每次攻击命中时增加攻击速度\n
         - 每次命中攻击速度增加量 : 10%\n
         - 增加量上限 : 70%\n
         - 战意领域持续时间 : 8秒
        """
        ...

# 战神之力
# demonic_lancer/vanguard/6e33d47e6622ce03b6defdd912140270
# 3deb7be5f01953ac8b1ecaa1e25e0420/6e33d47e6622ce03b6defdd912140270
class Skill33(PassiveSkill):
    """
    不灭战神和魔枪完全融为一体， 可以使用魔枪内所有潜在力量。 攻击敌人时， 会引发更猛烈的攻击， 并会对敌人造成这次伤害量一定比率的追加伤害。 该比率伤害会以同样的比率作用在装备的追加伤害效果上。 此外， [战戟猛攻]的能量层数会增加1。
    """
    name = "战神之力"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 追加伤害比率 : 击打量的{value0}%
    # REMOVE: data0 = [0, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [战戟猛攻]能量层数增加量 : {value1}
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    associate = [ {"data":data0,"type":"*skillRation"}]

# 断魂裂岩斩
# demonic_lancer/vanguard/ca75c965f20a150f99f54155a37400df
# 3deb7be5f01953ac8b1ecaa1e25e0420/ca75c965f20a150f99f54155a37400df
class Skill34(ActiveSkill):
    """
    向前方施展强力的下斩， 把敌人斩断。 被斩断的敌人会在一瞬间成为超级控制状态。 随后裂开的地面上溅出碎片和火花， 对敌人造成多段伤害。
    """
    name = "断魂裂岩斩"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [800, 6000]
    uuid = "ca75c965f20a150f99f54155a37400df"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 74458, 82012, 89566, 97119, 104673, 112227, 119780, 127334, 134888, 142442, 149995, 157549, 165103, 172656, 180210, 187764, 195318, 202871, 210425, 217979, 225533, 233086, 240640, 248194, 255747, 263301, 270855, 278409, 285962, 293516, 301070, 308623, 316177, 323731, 331285, 338838, 346392, 353946, 361500, 369053, 376607, 384161, 391714, 399268, 406822, 414376, 421929, 429483, 437037, 444590]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 多段打击攻击力 : {value1}%
    # REMOVE: data1 = [0, 1860, 2049, 2238, 2426, 2615, 2804, 2993, 3181, 3370, 3559, 3748, 3936, 4125, 4314, 4502, 4691, 4880, 5069, 5257, 5446, 5635, 5824, 6012, 6201, 6390, 6578, 6767, 6956, 7145, 7333, 7522, 7711, 7899, 8088, 8277, 8466, 8654, 8843, 9032, 9221, 9409, 9598, 9787, 9975, 10164, 10353, 10542, 10730, 10919, 11108]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 10
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 控制时间 : {value3}秒
    # REMOVE: data3 = [0, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9, 0.9]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [断魂裂岩斩]\n
        除觉醒技能外的转职技能命中敌人后， 可以强制中断并施放[断魂裂岩斩]技能\n
         - 技能[断魂裂岩斩]命中敌人后， 可以强制中断[断魂裂岩斩]的施放后僵直， 并施放除觉醒技能外的其他转职技能\n
        攻击范围 +20%
        """
        ...

    def vp_2(self):
        """
        [断魂裂岩斩]\n
        将灭天状态的魔枪巨大化后发动猛烈一击\n
         - 删除控制及多段攻击\n
         - 总攻击力相同\n
        [断魂裂岩斩]施放过程中可以施放部分技能\n
         - 施放的技能伤害合算至[断魂裂岩斩]\n
         - 可使用的技能 : [落月斩]、 [长虹贯日]、 [穿云裂地斩]\n
        攻击范围 +40%
        """
        ...

# 血战天狱
# demonic_lancer/vanguard/b163d099c8cc27fdb6fd3639c2ee6df9
# 3deb7be5f01953ac8b1ecaa1e25e0420/b163d099c8cc27fdb6fd3639c2ee6df9
class Skill35(ActiveSkill):
    """
    挥舞不灭战神的斗气和魔枪的究极之力合体的巨型魔枪， 使前方化为焦土， 并且再次聚集力量后， 施展毁灭一切存在的强力最后一击。
    """
    name = "血战天狱"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "b163d099c8cc27fdb6fd3639c2ee6df9"
    hasVP = False
    hasUP = False

    # 第1~4击攻击力 : {value0}%
    # REMOVE: data0 = [0, 31212, 38450, 45687, 52925, 60162, 67400, 74637, 81875, 89113, 96350, 103588, 110825, 118063, 125300, 132538, 139775, 147013, 154251, 161488, 168726, 175963, 183201, 190438, 197676, 204914, 212151, 219389, 226626, 233864, 241101, 248339, 255577, 262814, 270052, 277289, 284527, 291764, 299002, 306239, 313477, 320715, 327952, 335190, 342427, 349665, 356902, 364140, 371378, 378615, 385853]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 4
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 124848, 153798, 182749, 211699, 240649, 269599, 298550, 327500, 356450, 385400, 414351, 443301, 472251, 501201, 530152, 559102, 588052, 617002, 645953, 674903, 703853, 732803, 761754, 790704, 819654, 848605, 877555, 906505, 935455, 964406, 993356, 1022306, 1051256, 1080207, 1109157, 1138107, 1167057, 1196008, 1224958, 1253908, 1282858, 1311809, 1340759, 1369709, 1398659, 1427610, 1456560, 1485510, 1514461, 1543411]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1

# 灭天之魂
# demonic_lancer/vanguard/8e358ecf99ac9df31a6132aeafe378a9
# 3deb7be5f01953ac8b1ecaa1e25e0420/8e358ecf99ac9df31a6132aeafe378a9
class Skill36(PassiveSkill):
    """
    千魂·征战者通过修炼获得更加强大的身体和精神力， 完全掌控力量激发至极限的“灭天状态”的魔枪。 增加基本攻击力和转职技能攻击力， 变更部分技能效果。\n
    [战戟猛攻]\n
    每次施放[战戟猛攻]命中敌人时， 能量恢复时间减少0.6秒。\n
    [战戟猛攻]单次命中多个敌人时， 能量恢复时间减少效果仅适用1次。\n
    [落月斩]\n
    若施放[落月斩]后使用[战戟猛攻]， 则发动落月冲击， 动作变更为后退并斩击敌人。\n
    落月冲击攻击力与[战戟猛攻]相同。\n
    前进并使用[战戟猛攻]时， 发动原来的前进攻击。
    """
    name = "灭天之魂"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "8e358ecf99ac9df31a6132aeafe378a9"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [战戟猛攻]
    # 命中时能量恢复时间减少量 : {value1}秒
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    associate = [ {"data":data0,"type":"*skillRation"}]

# 镇狱裂地枪
# demonic_lancer/vanguard/78b86e64fbb74c1db1b71c50a5ac21cd
# 3deb7be5f01953ac8b1ecaa1e25e0420/78b86e64fbb74c1db1b71c50a5ac21cd
class Skill37(ActiveSkill):
    """
    挥动魔枪将其插入地面， 对敌人造成伤害。 然后拔出魔枪， 强力上挑， 造成巨大伤害。
    """
    name = "镇狱裂地枪"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [960, 7200]
    uuid = "78b86e64fbb74c1db1b71c50a5ac21cd"
    hasVP = False
    hasUP = False

    # 魔枪插地攻击力 : {value0}%
    # REMOVE: data0 = [0, 59333, 65352, 71371, 77390, 83409, 89429, 95448, 101467, 107486, 113506, 119525, 125544, 131563, 137583, 143602, 149621, 155640, 161660, 167679, 173698, 179717, 185737, 191756, 197775, 203794, 209813, 215833, 221852, 227871, 233890, 239910, 245929, 251948, 257967, 263987, 270006, 276025, 282044, 288064, 294083, 300102, 306121, 312141, 318160, 324179, 330198, 336218, 342237, 348256, 354275]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 终结上挑攻击力 : {value1}%
    # REMOVE: data1 = [0, 138443, 152487, 166532, 180577, 194622, 208667, 222712, 236757, 250802, 264847, 278891, 292936, 306981, 321026, 335071, 349116, 363161, 377206, 391251, 405295, 419340, 433385, 447430, 461475, 475520, 489565, 503610, 517655, 531699, 545744, 559789, 573834, 587879, 601924, 615969, 630014, 644059, 658103, 672148, 686193, 700238, 714283, 728328, 742373, 756418, 770463, 784508, 798552, 812597, 826642]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1

# 天劫·斗灭乾坤
# demonic_lancer/vanguard/f4a561e272cc434a4905b3aa0c0de090
# 3deb7be5f01953ac8b1ecaa1e25e0420/f4a561e272cc434a4905b3aa0c0de090
class Skill38(ActiveSkill):
    """
    千魂·征战者将魔枪插入地面， 利用自身斗气， 将周围化为荒地。 然后用力跳跃至高空， 使魔枪狂化， 并向正面强力下劈， 消灭眼前的敌人。\n
    施放时， 适用[战戟猛攻]的增益效果。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "天劫·斗灭乾坤"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4027, 8055]
    uuid = "f4a561e272cc434a4905b3aa0c0de090"
    hasVP = False
    hasUP = False

    # 下劈攻击力 : {value0}%
    # REMOVE: data0 = [0, 683624, 842146, 1000667, 1159189, 1317710, 1476232, 1634753, 1793275, 1951796, 2110318, 2268839, 2427361, 2585882, 2744404, 2902925, 3061447, 3219968, 3378490, 3537011, 3695533, 3854054, 4012576, 4171097, 4329619, 4488140, 4646662, 4805183, 4963705, 5122226, 5280748, 5439269, 5597791, 5756312, 5914834, 6073355, 6231877, 6390398, 6548920, 6707441, 6865963, 7024484, 7183006, 7341527, 7500049, 7658570, 7817092, 7975613, 8134135, 8292656, 8451178]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'vanguard'
        self.nameCN = '千魂·征战者'
        self.role = 'demonic_lancer'
        self.角色 = '魔枪士'
        self.职业 = '征战者'
        self.jobId = '3deb7be5f01953ac8b1ecaa1e25e0420'
        self.jobGrowId = '37495b941da3b1661bc900e68ef3b2c6'

        self.武器选项 = ['长枪','战戟','光枪','暗矛'] # TODO
        self.输出类型选项 = ['物理百分比'] # TODO
        self.输出类型 = '物理百分比' # TODO
        self.防具精通属性 = ['力量'] # TODO
        self.防具类型 = '重甲'
        self.buff = 1.80 # TODO

        super().__init__(equVersion, __name__)
