#944b9aab492c15a8474f96947ceeb9e4
from core.basic.skill import PassiveSkill, ActiveSkill
from core.basic.character import Character

# M-137格林机枪 M-137 개틀링건
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/01c3a2fb793d293a25ed8dc7a0d70c1a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill6(ActiveSkill):
    name = "M-137格林机枪"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    mp = [10, 180]
    uuid = "01c3a2fb793d293a25ed8dc7a0d70c1a"
    data0 = [0, 126, 139, 151, 164, 177, 190, 202, 215, 228, 241, 254, 266, 279, 292, 305, 317, 330, 343, 356, 368, 381, 394, 407, 419, 432, 445, 458, 471, 483, 496, 509, 522, 534, 547, 560, 573, 585, 598, 611, 624, 637, 649, 662, 675, 688, 700, 713, 726, 739, 751, 764, 777, 790, 802, 815, 828, 841, 854, 866, 879, 892, 905, 917, 930, 943, 956, 968, 981, 994, 1007]# noqa: E501
    hit0 = 30


# 重火器拔击 뽑아치기
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/1dad88963abdc96b091fcab185a8820d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill9(PassiveSkill):
    name = "重火器拔击"
    learnLv = 5
    masterLv = 1
    maxLv = 11
    position = 3 #TODO
    rangeLv = 3
    uuid = "1dad88963abdc96b091fcab185a8820d"
    data0 = [0, 433, 467, 500, 533, 567, 600, 633, 667, 700, 733, 767]# noqa: E501
    hit0 = 1 #TODO


# BBQ 바베~큐
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/8c2379737c5acc935c1731f67f607655?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill12(ActiveSkill):
    name = "BBQ"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 8
    mp = [30, 322]
    uuid = "8c2379737c5acc935c1731f67f607655"
    data0 = [0, 542, 596, 651, 707, 761, 818, 873, 926, 983, 1037, 1091, 1149, 1203, 1260, 1314, 1368, 1425, 1477, 1533, 1590, 1644, 1698, 1756, 1809, 1863, 1921, 1975, 2030, 2086, 2140, 2194, 2252, 2307, 2359, 2418, 2471, 2524, 2582, 2636, 2691, 2748, 2801, 2856, 2913, 2967, 3021, 3080, 3133, 3186, 3243, 3297, 3351, 3407, 3463, 3517, 3573, 3629, 3682, 3738, 3794, 3848, 3905, 3960, 4012, 4069, 4123, 4178, 4235, 4290, 4344]# noqa: E501
    hit0 = 12


# 浮空铲 고각도 슬라이딩
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/dcd536f1674630f01fc9667bb202b851?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill13(ActiveSkill):
    name = "浮空铲"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 8 #TODO
    rangeLv = 3
    cd = 8
    mp = [22, 22]
    uuid = "dcd536f1674630f01fc9667bb202b851"

    damage = False

# M-3喷火器 M-3 화염방사기
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/8f73f243041c2d27739fe7696f02bf9b?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill18(ActiveSkill):
    name = "M-3喷火器"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 7
    mp = [45, 392]
    uuid = "8f73f243041c2d27739fe7696f02bf9b"

    data2 = [0, 493, 544, 597, 645, 692, 747, 793, 845, 896, 942, 995, 1044, 1095, 1146, 1199, 1248, 1296, 1350, 1396, 1445, 1498, 1546, 1597, 1648, 1694, 1746, 1801, 1850, 1899, 1950, 2000, 2047, 2102, 2149, 2199, 2251, 2297, 2352, 2401, 2450, 2503, 2552, 2603, 2651, 2703, 2751, 2800, 2855, 2901, 2950, 3004, 3052, 3103, 3156, 3203, 3254, 3302, 3355, 3404, 3453, 3504, 3553, 3606, 3654, 3705, 3754, 3805, 3858, 3905, 3956]# noqa: E501
    hit2 = 8


# 重火器精通 중화기 마스터리
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/ade01c1d6afc8a05055225045e89fe49?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill19(PassiveSkill):
    name = "重火器精通"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    uuid = "ade01c1d6afc8a05055225045e89fe49"

    data2 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data3 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data4 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501

    associate = [
        {"type":"$*PAtkP","data":data2},
        {"data":data3},
        {"type":"*cdReduce","data":data4,"exceptSkills":['远古粒子炮', '火力全开', '制胜·最终兵器']},
    ]


# 重火器奥义 중화기 다루기
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/e49e57b2e8fbeceb0a2c56a0c63fe6c5?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill21(PassiveSkill):
    name = "重火器奥义"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "e49e57b2e8fbeceb0a2c56a0c63fe6c5"

    def effect(self, old, new):
        skills = []
        for i in self.char.skills:
            if i.type == "active" and i.learnLv not in [50,85,100] and i.damage and i.lv > 0:
                skills.append(i.name)
        self.associate = [{"type":"+lv","data":[0] + [1]*self.maxLv,"ratio":1,"skills":skills}]
        super().effect(old, new)

# G-14手雷 G-14 파열류탄
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/de3fea2d65c597f4d55c70a02b97fc79?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill22(ActiveSkill):
    name = "G-14手雷"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 10 #TODO
    rangeLv = 2
    cd = 2
    mp = [20, 160]
    uuid = "de3fea2d65c597f4d55c70a02b97fc79"

    data1 = [0, 751, 830, 904, 981, 1057, 1132, 1210, 1287, 1362, 1438, 1516, 1591, 1668, 1746, 1819, 1897, 1972, 2049, 2127, 2202, 2278, 2355, 2429, 2508, 2584, 2659, 2735, 2814, 2888, 2965, 3041, 3116, 3194, 3271, 3346, 3422, 3500, 3575, 3652, 3732, 3806, 3883, 3961, 4034, 4112, 4189, 4264, 4342, 4418, 4493, 4570, 4648, 4723, 4799, 4876, 4950, 5029, 5105, 5180, 5256, 5335, 5409, 5486, 5562, 5637, 5715, 5792, 5867, 5943, 6021]# noqa: E501
    hit1 = 1


# 反坦克炮 슈타이어 대전차포
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/0ed3148658fe37b3336ccb718dc0fdb0?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill23(ActiveSkill):
    name = "反坦克炮"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 6
    mp = [40, 391]
    uuid = "0ed3148658fe37b3336ccb718dc0fdb0"
    data0 = [0, 415, 454, 492, 538, 577, 623, 660, 703, 748, 786, 827, 869, 913, 954, 997, 1037, 1077, 1126, 1165, 1204, 1245, 1287, 1332, 1371, 1415, 1457, 1498, 1536, 1580, 1622, 1665, 1707, 1748, 1787, 1833, 1874, 1913, 1955, 2000, 2042, 2081, 2125, 2165, 2212, 2251, 2289, 2333, 2372, 2416, 2460, 2503, 2540, 2586, 2627, 2664, 2710, 2753, 2794, 2834, 2877, 2919, 2964, 3003, 3042, 3081, 3130, 3169, 3213, 3251, 3292]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 2149, 2367, 2586, 2805, 3026, 3241, 3460, 3679, 3897, 4114, 4335, 4550, 4769, 4985, 5202, 5423, 5641, 5860, 6076, 6296, 6513, 6736, 6953, 7169, 7389, 7605, 7822, 8041, 8259, 8480, 8699, 8914, 9133, 9354, 9568, 9791, 10005, 10224, 10442, 10663, 10879, 11096, 11314, 11535, 11751, 11968, 12186, 12405, 12626, 12842, 13065, 13283, 13500, 13718, 13935, 14150, 14369, 14590, 14807, 15025, 15241, 15460, 15680, 15901, 16116, 16337, 16555, 16773, 16990, 17206]# noqa: E501
    hit1 = 3


# 加农炮 캐넌볼
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/8510294202d0e042dd29a2422fc6770d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill24(ActiveSkill):
    name = "加农炮"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 280]
    uuid = "8510294202d0e042dd29a2422fc6770d"
    data0 = [0, 2635, 2901, 3171, 3436, 3700, 3973, 4239, 4507, 4774, 5041, 5310, 5575, 5843, 6112, 6379, 6646, 6914, 7180, 7450, 7713, 7984, 8249, 8521, 8784, 9053, 9320, 9585, 9857, 10124, 10389, 10654, 10925, 11192, 11458, 11727, 11992, 12261, 12529, 12796, 13063, 13330, 13597, 13866, 14134, 14401, 14670, 14933, 15202, 15469, 15739, 16006, 16269, 16536, 16808, 17075, 17344, 17609, 17874, 18145, 18411, 18680, 18945, 19209, 19484, 19748, 20018, 20281, 20552, 20819, 21084]# noqa: E501
    hit0 = 2


# 快速拔枪 패스티스트 건
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/45442bbbe33540b4deeec29437dae70c?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill26(PassiveSkill):
    name = "快速拔枪"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "45442bbbe33540b4deeec29437dae70c"


# 激光炮 레이저 라이플
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/23a5e0fba03283cb1b324a847b3fe370?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill27(ActiveSkill):
    name = "激光炮"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 7
    mp = [61, 512]
    uuid = "23a5e0fba03283cb1b324a847b3fe370"
    data0 = [0, 6858, 7557, 8252, 8951, 9643, 10342, 11037, 11732, 12431, 13126, 13823, 14520, 15210, 15909, 16606, 17305, 18000, 18695, 19391, 20088, 20781, 21478, 22174, 22872, 23569, 24261, 24958, 25653, 26354, 27051, 27744, 28443, 29135, 29834, 30527, 31226, 31921, 32620, 33310, 34009, 34703, 35405, 36102, 36795, 37492, 38186, 38883, 39578, 40275, 40974, 41666, 42363, 43058, 43755, 44452, 45147, 45843, 46543, 47235, 47934, 48627, 49326, 50023, 50717, 51412, 52109, 52804, 53501, 54196, 54895]# noqa: E501
    hit0 = 1


# 蓄电激光炮 충전 레이저 라이플
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/01384bbfc346775d1267fa0bc4ca605f?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill28(PassiveSkill):
    name = "蓄电激光炮"
    learnLv = 25
    masterLv = 1
    maxLv = 11
    position = 8 #TODO
    rangeLv = 2
    uuid = "01384bbfc346775d1267fa0bc4ca605f"

    data1 = [0, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80]# noqa: E501
    associate = [{"data":data1,"skills":["激光炮"]}]


# 脉冲雷达-63 APG-63
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/9376d04c476cd41d60ed1974ca69ab95?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill29(PassiveSkill):
    name = "脉冲雷达-63"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    uuid = "9376d04c476cd41d60ed1974ca69ab95"

    data1 = [0, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]# noqa: E501
    associate = [{"data":data1,"type":"$*PAtkP"}]


# 聚焦喷火器 화염 강타
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/04883563896fe1adac7505c6146b5f59?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill30(ActiveSkill):
    name = "聚焦喷火器"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 12
    mp = [130, 980]
    uuid = "04883563896fe1adac7505c6146b5f59"

    data1 = [0, 581, 640, 699, 758, 817, 876, 935, 994, 1053, 1112, 1171, 1230, 1288, 1347, 1406, 1465, 1524, 1583, 1642, 1701, 1760, 1819, 1878, 1937, 1996, 2055, 2114, 2173, 2232, 2291, 2350, 2409, 2467, 2526, 2585, 2644, 2703, 2762, 2821, 2880, 2939, 2998, 3057, 3116, 3175, 3234, 3293, 3352, 3411, 3470, 3529, 3588, 3647, 3705, 3764, 3823, 3882, 3941, 4000, 4059, 4118, 4177, 4236, 4295, 4354, 4413, 4472, 4531, 4590, 4649]# noqa: E501
    hit1 = 29


# 潜能爆发 미라클 비전
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/1721e94897e9961d5c98130a13392f17?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill31(ActiveSkill):
    name = "潜能爆发"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    cd = 5
    mp = [357, 2765]
    uuid = "1721e94897e9961d5c98130a13392f17"

    damage = False
    buff = True


# FM-31榴弹发射器 FM-31 그레네이드 런처
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/762c4e6d030eaf0abbfe1fec2b298574?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill32(ActiveSkill):
    name = "FM-31榴弹发射器"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 15
    mp = [50, 630]
    uuid = "762c4e6d030eaf0abbfe1fec2b298574"

    data1 = [0, 3267, 3600, 3932, 4258, 4592, 4930, 5261, 5592, 5919, 6252, 6581, 6917, 7248, 7582, 7908, 8240, 8571, 8909, 9240, 9574, 9900, 10234, 10563, 10894, 11230, 11561, 11895, 12219, 12552, 12886, 13222, 13553, 13884, 14213, 14547, 14876, 15209, 15543, 15876, 16200, 16532, 16868, 17194, 17535, 17864, 18195, 18521, 18857, 19188, 19524, 19856, 20180, 20513, 20844, 21176, 21507, 21845, 22172, 22508, 22834, 23170, 23499, 23837, 24159, 24495, 24826, 25160, 25488, 25824, 26153]# noqa: E501
    hit1 = 8


# FM-92榴弹 FM-92 mk2 랜서
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/38612d8f2561edc2eb68d5057a837bfa?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill33(ActiveSkill):
    name = "FM-92榴弹"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [164, 1376]
    uuid = "38612d8f2561edc2eb68d5057a837bfa"
    data0 = [0, 2672, 2942, 3213, 3486, 3758, 4026, 4298, 4569, 4839, 5111, 5382, 5652, 5924, 6195, 6465, 6740, 7007, 7281, 7551, 7818, 8094, 8366, 8633, 8910, 9179, 9447, 9722, 9990, 10265, 10533, 10806, 11078, 11346, 11618, 11891, 12161, 12431, 12702, 12974, 13242, 13517, 13788, 14057, 14330, 14598, 14873, 15143, 15413, 15686, 15954, 16224, 16500, 16767, 17039, 17312, 17579, 17855, 18123, 18398, 18666, 18939, 19211, 19481, 19752, 20022, 20292, 20565, 20837, 21110, 21378]# noqa: E501
    hit0 = 8


# 光热反应 듀얼 트리거
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/33ad4930f4724a7d025c3046c6f6074b?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill34(PassiveSkill):
    name = "光热反应"
    learnLv = 35
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 3
    uuid = "33ad4930f4724a7d025c3046c6f6074b"

# 量子爆弹 양자 폭탄
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/e4c354a89c337310aeb7041d5e742828?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill35(ActiveSkill):
    name = "量子爆弹"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 9 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [164, 1376]
    uuid = "e4c354a89c337310aeb7041d5e742828"
    data0 = [0, 1709, 1886, 2058, 2232, 2406, 2577, 2750, 2927, 3098, 3275, 3446, 3623, 3795, 3968, 4145, 4316, 4488, 4664, 4835, 5010, 5184, 5358, 5532, 5706, 5874, 6051, 6224, 6398, 6575, 6747, 6923, 7094, 7268, 7443, 7614, 7788, 7962, 8135, 8307, 8483, 8657, 8832, 9006, 9180, 9351, 9524, 9698, 9873, 10046, 10221, 10392, 10566, 10742, 10914, 11085, 11264, 11435, 11610, 11783, 11958, 12131, 12306, 12476, 12653, 12822, 12999, 13170, 13346, 13521, 13694]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 19682, 21681, 23679, 25676, 27677, 29672, 31664, 33663, 35663, 37658, 39656, 41652, 43649, 45647, 47643, 49641, 51638, 53636, 55631, 57627, 59628, 61623, 63620, 65618, 67613, 69612, 71609, 73605, 75605, 77603, 79596, 81596, 83591, 85589, 87588, 89585, 91577, 93576, 95573, 97571, 99570, 101568, 103560, 105560, 107555, 109554, 111552, 113546, 115544, 117540, 119538, 121538, 123534, 125528, 127524, 129525, 131520, 133518, 135518, 137510, 139509, 141507, 143502, 145502, 147501, 149493, 151488, 153489, 155486, 157482]# noqa: E501
    hit1 = 1 #TODO

    data4 = [0, 15, 15, 15, 15, 15, 15, 17, 18, 18, 20, 21, 21, 23, 24, 24, 26, 27, 29, 29, 30, 32, 32, 33, 35, 35, 36, 38, 38, 39, 41, 41, 42, 44, 45, 45, 47, 48, 48, 50, 51, 51, 53, 54, 54, 56, 57, 59, 59, 60, 62, 62, 63, 65, 65, 66, 68, 68, 69, 71, 71, 72, 74, 75, 75, 77, 78, 78, 80, 81, 81]# noqa: E501
    hit4 = 1 #TODO



# X-2太阳神光炮 X-2 헬리오스
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/28fc502b0b8b4e57709f34a1e9369692?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill36(ActiveSkill):
    name = "X-2太阳神光炮"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [350, 2940]
    uuid = "28fc502b0b8b4e57709f34a1e9369692"
    data0 = [0, 5192, 5717, 6243, 6771, 7298, 7826, 8352, 8877, 9402, 9930, 10457, 10983, 11510, 12038, 12566, 13092, 13617, 14144, 14670, 15195, 15723, 16250, 16778, 17304, 17831, 18357, 18884, 19410, 19935, 20463, 20990, 21516, 22044, 22569, 23096, 23624, 24150, 24675, 25202, 25730, 26256, 26783, 27309, 27836, 28362, 28889, 29417, 29945, 30468, 30995, 31523, 32048, 32574, 33102, 33629, 34157, 34683, 35210, 35736, 36261, 36788, 37314, 37841, 38369, 38897, 39422, 39948, 40476, 41003, 41528]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 46718, 51459, 56196, 60935, 65673, 70416, 75156, 79895, 84635, 89373, 94115, 98855, 103593, 108332, 113070, 117813, 122555, 127292, 132032, 136770, 141510, 146249, 150989, 155726, 160467, 165212, 169949, 174690, 179429, 184169, 188907, 193646, 198384, 203123, 207866, 212604, 217346, 222084, 226824, 231563, 236304, 241041, 245781, 250518, 255263, 260003, 264740, 269483, 274220, 278961, 283700, 288440, 293177, 297917, 302658, 307397, 312137, 316878, 321618, 326358, 331097, 335834, 340575, 345312, 350055, 354794, 359534, 364275, 369014, 373754]# noqa: E501
    hit1 = 1 #TODO



# 超温重火器 오버 히트
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/5892d1fa4462e561ac8f8d2c74892b0a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill37(PassiveSkill):
    name = "超温重火器"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "5892d1fa4462e561ac8f8d2c74892b0a"
    data0 = [0, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104]# noqa: E501
    associate = [{"data":data0}]


# 远古粒子炮 에인션트 트리거
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/2ba299855fc22192cba4f73db75e9d0e?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill38(ActiveSkill):
    name = "远古粒子炮"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [1000, 8400]
    uuid = "2ba299855fc22192cba4f73db75e9d0e"
    data0 = [0, 7936, 9776, 11618, 13459, 15300, 17138, 18980, 20819, 22660, 24502, 26342, 28183, 30025, 31863, 33705, 35545, 37384, 39226, 41066, 42906, 44747, 46586, 48426, 50268, 52107, 53949, 55790, 57630, 59469, 61310, 63150, 64992, 66833, 68672, 70514, 72354, 74193, 76036, 77876, 79717, 81558, 83397, 85239, 87079, 88918, 90759, 92598, 94440, 96281, 98121]# noqa: E501
    hit0 = 0

    data1 = [0, 9226, 11368, 13509, 15650, 17789, 19929, 22070, 24210, 26351, 28490, 30630, 32768, 34907, 37049, 39190, 41330, 43470, 45610, 47751, 49891, 52032, 54172, 56313, 58451, 60591, 62730, 64871, 67010, 69152, 71291, 73432, 75572, 77713, 79855, 81995, 84134, 86274, 88412, 90552, 92693, 94833, 96975, 99114, 101255, 103394, 105534, 107675, 109815, 111954, 114094]# noqa: E501
    hit1 = 10


# 等离子放射器 플라즈마 부스터
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/2a0a39184de92acf1c1375e00b77404c?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill39(ActiveSkill):
    name = "等离子放射器"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [400, 1120]
    uuid = "2a0a39184de92acf1c1375e00b77404c"

    data1 = [0, 1130, 1244, 1362, 1476, 1590, 1706, 1818, 1932, 2049, 2163, 2279, 2393, 2508, 2622, 2741, 2853, 2967, 3083, 3198, 3312, 3428, 3539, 3657, 3774, 3885, 4002, 4115, 4232, 4344, 4461, 4574, 4692, 4802, 4919, 5036, 5150, 5265, 5381, 5492, 5610, 5724, 5835, 5952, 6066, 6185, 6297, 6414, 6527, 6644, 6755]# noqa: E501
    hit1 = 37


# FM-92特殊榴弹 FM-92 mk2 랜서 SW
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/9dc8438e4572d39243c97da31c113acc?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill40(ActiveSkill):
    name = "FM-92特殊榴弹"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [800, 1680]
    uuid = "9dc8438e4572d39243c97da31c113acc"
    data0 = [0, 76289, 84015, 91781, 99509, 107234, 115025, 122729, 130458, 138245, 145952, 153677, 161466, 169172, 176961, 184688, 192396, 200181, 207906, 215616, 223404, 231129, 238896, 246623, 254352, 262119, 269846, 277574, 285341, 293069, 300792, 308561, 316289, 324078, 331784, 339512, 347297, 355004, 362730, 370520, 378224, 386015, 393743, 401448, 409235, 416961, 424668, 432456, 440184, 447888, 455678]# noqa: E501
    hit0 = 1


# 重武装改造 알파 서포트
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/9bc30e0f6e22b0333762d04acae7d252?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill41(PassiveSkill):
    name = "重武装改造"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 1 #TODO
    rangeLv = 3
    uuid = "9bc30e0f6e22b0333762d04acae7d252"
    data0 = [0, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123]# noqa: E501
    associate = [{"data":data0}]


# 集束炸弹 FSC-7
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/68062215e75d92575958873ac8ede31a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill42(ActiveSkill):
    name = "集束炸弹"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [777, 6021]
    uuid = "68062215e75d92575958873ac8ede31a"
    data0 = [0, 3388, 3735, 4078, 4422, 4765, 5109, 5453, 5797, 6140, 6483, 6829, 7171, 7517, 7861, 8204, 8549, 8892, 9235, 9579, 9927, 10266, 10612, 10957, 11300, 11644, 11989, 12332, 12676, 13020, 13363, 13709, 14053, 14395, 14739, 15084, 15428, 15770, 16116, 16460, 16805, 17145, 17492, 17835, 18180, 18523, 18867, 19210, 19553, 19899, 20242]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 6441, 7096, 7749, 8402, 9053, 9706, 10362, 11013, 11670, 12321, 12977, 13628, 14280, 14936, 15589, 16243, 16897, 17551, 18203, 18855, 19510, 20164, 20816, 21470, 22127, 22777, 23432, 24085, 24739, 25392, 26045, 26699, 27350, 28006, 28659, 29315, 29968, 30620, 31273, 31924, 32580, 33234, 33888, 34540, 35196, 35846, 36501, 37154, 37808, 38463]# noqa: E501
    hit1 = 10


# PT-15原始型压缩炮 PT-15 프로토타입
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/95103ae7c54eaedea3bbcf726520db6c?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill43(ActiveSkill):
    name = "PT-15原始型压缩炮"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [580, 4500]
    uuid = "95103ae7c54eaedea3bbcf726520db6c"
    data0 = [0, 83858, 92364, 100872, 109380, 117887, 126394, 134904, 143411, 151918, 160425, 168933, 177438, 185947, 194454, 202962, 211468, 219976, 228484, 236990, 245497, 254005, 262514, 271020, 279530, 288037, 296541, 305050, 313558, 322065, 330573, 339080, 347588, 356094, 364602, 373109, 381617, 390123, 398631, 407137, 415645, 424153, 432662, 441169, 449676, 458183, 466691, 475197, 483706, 492213, 500721]# noqa: E501
    hit0 = 1 #TODO



# 火力全开 오퍼레이션 레이즈
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/0f638da961acf7958ac6070b7aaed013?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill44(ActiveSkill):
    name = "火力全开"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 8000]
    uuid = "0f638da961acf7958ac6070b7aaed013"
    data0 = [0, 1545, 1904, 2261, 2620, 2977, 3338, 3696, 4054, 4411, 4772, 5130, 5488, 5847, 6204, 6562, 6924, 7282, 7639, 7997, 8356, 8715, 9074, 9432, 9790, 10149, 10508, 10864, 11224, 11583, 11941, 12302, 12658, 13017, 13374, 13734, 14092, 14450, 14809, 15167, 15526, 15884, 16243, 16603, 16959, 17318, 17679, 18036, 18395, 18752, 19111]# noqa: E501
    hit0 = 50

    data1 = [0, 3863, 4760, 5651, 6549, 7444, 8341, 9238, 10135, 11028, 11929, 12824, 13719, 14618, 15511, 16407, 17307, 18202, 19096, 19993, 20890, 21786, 22686, 23580, 24472, 25372, 26269, 27162, 28058, 28956, 29851, 30749, 31645, 32542, 33437, 34333, 35229, 36126, 37023, 37919, 38816, 39710, 40609, 41505, 42399, 43295, 44193, 45089, 45985, 46882, 47776]# noqa: E501
    hit1 = 20

    data2 = [0, 48031, 59167, 70305, 81443, 92582, 103719, 114855, 125995, 137132, 148268, 159409, 170544, 181684, 192820, 203959, 215097, 226235, 237370, 248511, 259646, 270782, 281922, 293058, 304197, 315334, 326471, 337611, 348747, 359884, 371023, 382161, 393298, 404437, 415573, 426711, 437850, 448986, 460127, 471262, 482400, 493538, 504677, 515814, 526953, 538088, 549227, 560365, 571501, 582642, 593776]# noqa: E501
    hit2 = 1


# 潘多拉1号 Pandora_01
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/de20372767d014d62dc7361ac686834e?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill45(PassiveSkill):
    name = "潘多拉1号"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "de20372767d014d62dc7361ac686834e"
    data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    associate = [{"data":data0}]


# UHT-03爆炎喷火器 UHT-03 플레게톤
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/3a691a432c58abebc08211df45c4f4bd?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill46(ActiveSkill):
    name = "UHT-03爆炎喷火器"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [773, 6000]
    uuid = "3a691a432c58abebc08211df45c4f4bd"

    data1 = [0, 6263, 6901, 7535, 8171, 8808, 9443, 10076, 10710, 11348, 11984, 12620, 13254, 13891, 14526, 15162, 15798, 16432, 17068, 17704, 18341, 18974, 19611, 20246, 20879, 21518, 22154, 22788, 23422, 24061, 24693, 25330, 25965, 26603, 27237, 27873, 28509, 29142, 29776, 30416, 31048, 31688, 32321, 32957, 33591, 34228, 34866, 35499, 36134, 36771, 37404]# noqa: E501
    hit1 = 24


# 制胜·最终兵器 디사이시브 배틀
# https://api.neople.co.kr/df/skills/944b9aab492c15a8474f96947ceeb9e4/25c0018b82c644f6e20d728f1478e671?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill47(ActiveSkill):
    name = "制胜·最终兵器"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 12889]
    uuid = "25c0018b82c644f6e20d728f1478e671"
    data0 = [0, 21018, 25894, 30770, 35641, 40518, 45394, 50268, 55142, 60015, 64890, 69767, 74639, 79515, 84392, 89263, 94138, 99014, 103888, 108761, 113638, 118511, 123385, 128263, 133134, 138010, 142884, 147759, 152633, 157508, 162382, 167257, 172133, 177007, 181880, 186755, 191630, 196505, 201381, 206254, 211129, 216002, 220877, 225751, 230625, 235501, 240376, 245252, 250125, 254999, 259874]# noqa: E501
    hit0 = 5

    data1 = [0, 10509, 12948, 15385, 17823, 20260, 22698, 25132, 27571, 30008, 32445, 34884, 37320, 39757, 42195, 44632, 47069, 49505, 51943, 54382, 56819, 59256, 61694, 64132, 66567, 69005, 71444, 73879, 76316, 78753, 81191, 83628, 86066, 88502, 90940, 93379, 95814, 98253, 100691, 103126, 105564, 108001, 110439, 112876, 115313, 117752, 120187, 122626, 125062, 127499, 129936]# noqa: E501
    hit1 = 10

    data2 = [0, 5255, 6475, 7694, 8909, 10129, 11348, 12567, 13786, 15002, 16222, 17442, 18661, 19880, 21099, 22316, 23536, 24755, 25971, 27191, 28409, 29629, 30848, 32064, 33283, 34502, 35721, 36940, 38159, 39377, 40595, 41814, 43032, 44252, 45471, 46689, 47908, 49125, 50345, 51564, 52783, 54001, 55217, 56437, 57657, 58877, 60094, 61313, 62531, 63751, 64970]# noqa: E501
    hit2 = 5

    data3 = [0, 12613, 15537, 18464, 21385, 24313, 27236, 30160, 33086, 36010, 38935, 41861, 44782, 47709, 50634, 53558, 56484, 59407, 62332, 65256, 68184, 71108, 74030, 76957, 79880, 82805, 85730, 88657, 91580, 94505, 97429, 100354, 103279, 106203, 109128, 112053, 114978, 117903, 120829, 123753, 126677, 129601, 132526, 135450, 138375, 141301, 144226, 147150, 150075, 153000, 155923]# noqa: E501
    hit3 = 25

class classChange(Character):
    def __init__(self, equVersion):
        self.name = 'launcher_female'
        self.nameCN = '重霄·枪炮师'
        self.role = 'gunner_female'

        self.武器选项 = ['手弩', '步枪','左轮枪','自动手枪','手炮']
        self.输出类型选项 = ['物理百分比']
        self.输出类型 = '物理百分比'
        self.防具精通属性 = ['力量']
        self.防具类型 = '重甲'
        self.buff = 2.023

        self.角色 = '神枪手(女)'

        self.职业 = '枪炮师'

        super().__init__(equVersion, __name__)
