#944b9aab492c15a8474f96947ceeb9e4
from core.basic.skill import PassiveBufferSkill,ActiveBufferSkill,ActiveSkill,PassiveSkill, get_data
from core.basic.character import Character
prefix = "gunner_female/paramedic/cn/skillDetail"

# 系统常量 · 战斗服
# gunner_female/paramedic/dce00e1ce90e34ef5c36ea869ad171bd
# 944b9aab492c15a8474f96947ceeb9e4/dce00e1ce90e34ef5c36ea869ad171bd
class Skill5(PassiveSkill):
    """
    协战师进入战场时穿戴的战斗服。 平时会内置于医神设备中， 该服装设计注重行动便利性， 具备处理战场信息和最小化所受伤害的功能。\n
        协战师动作均切换至战斗服[近战]模式， 适用物理独立攻击力。
    """
    name = "系统常量 · 战斗服"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 3
    uuid = "dce00e1ce90e34ef5c36ea869ad171bd"
    hasVP = False
    hasUP = False

    # 防御力增加 : {value0}
    # data0 = None # TOCHECK    # REMOVE: data0 = [0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)



# 近战 · 锁定连射
# gunner_female/paramedic/452be74df1c43b4d3080e1b09ed32e08
# 944b9aab492c15a8474f96947ceeb9e4/452be74df1c43b4d3080e1b09ed32e08
class Skill7(ActiveSkill):
    """
    向前方最近的敌人射击2次。
    """
    name = "近战 · 锁定连射"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 9 #TODO
    rangeLv = 2
    cd = 6
    mp = [35, 188]
    uuid = "452be74df1c43b4d3080e1b09ed32e08"
    hasVP = False
    hasUP = False

    # 射击攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 2295, 2528, 2761, 2993, 3226, 3459, 3692, 3925, 4158, 4390, 4623, 4856, 5089, 5322, 5555, 5787, 6020, 6253, 6486, 6719, 6952, 7184, 7417, 7650, 7883, 8116, 8348, 8581, 8814, 9047, 9280, 9513, 9745, 9978, 10211, 10444, 10677, 10910, 11142, 11375, 11608, 11841, 12074, 12307, 12539, 12772, 13005, 13238, 13471, 13703, 13936, 14169, 14402, 14635, 14868, 15100, 15333, 15566, 15799, 16032, 16265, 16497, 16730, 16963, 17196, 17429, 17662, 17894, 18127, 18360]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 2  # 射击次数
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每次攻击的信息获取率 : 15%
    # [范围信息]
    # 探索范围 : {value2}px
    # REMOVE: data2 = [0, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)


# 系统常量 · 同步
# gunner_female/paramedic/f48b0983de6b83180f7d82f0a5882496
# 944b9aab492c15a8474f96947ceeb9e4/f48b0983de6b83180f7d82f0a5882496
class Skill13(PassiveSkill):
    """
    协战师为小队提供的强袭支援模件。\n
        可提升基本攻击力、 技能攻击力， 并将所有强化效果同步至每个队员。\n
    [同步]\n
        无论队员处于哪个位置， 涵盖个别地图， 都能获得增益效果。 当队员从无法战斗状态中恢复时， 将重新获得已赋予其他存活队员的强化效果， 保护模件除外。\n
    [同步对象]\n
    [保护模件 (缓冲)]\n
    [保护模件 (净化)]\n
    [装甲强化]\n
    [军械强化]\n
    [机动强化]\n
    [军械强化(进阶)]\n
    [强袭策略 : 区域肃清]\n
    [保护模件 (黄金复苏)]\n
    [空袭策略 : 神兵天降]
    """
    name = "系统常量 · 同步"
    learnLv = 15
    masterLv = 1
    maxLv = 11
    position = 0 #TODO
    rangeLv = 3
    uuid = "f48b0983de6b83180f7d82f0a5882496"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加量 : {value0}%
    # REMOVE: data0 = [0, 15, 17, 18, 20, 21, 23, 24, 26, 27, 29, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    associate = [{"data":data0}]  # 协战师技能关联

# 系统 · 战场信息
# gunner_female/paramedic/6235960237fdb1b77f2c82b33614dcf4
# 944b9aab492c15a8474f96947ceeb9e4/6235960237fdb1b77f2c82b33614dcf4
class Skill14(PassiveBufferSkill):
    """
    进入地下城时， 将配备无人机用于分析交战信息并提供支援， 该无人机可从医神设备中分离， 协助协战师执行任务。\n
        分析的信息在提供部分模件时会被消耗， 可通过使用转职技能或基本攻击与敌人交战来收集补充。\n
        为协战师提供精神辅助增益， 并在其命中敌人时减弱敌人的属性伤害抗性。\n
        效果可持续存在一段时间， 最多可叠加至特定次数。\n
        该技能效果不与光明骑士 (男) 的[惩罚之锤]、 光明骑士 (女) 的[圣光灌注]、 小魔女的[冥月绽放]、 缪斯的[多彩感性]技能效果叠加。\n
        执行独立作战时， 不适用属性伤害增加效果， 仅适用独立作战专属效果。 消耗信息层数时， 对范围内敌人进行激光轰炸， 造成多段伤害。 该激光轰炸受[基础精通]的影响， 在使用[军械强化 (进阶)]技能时， 会追加轰炸。
    """
    name = "系统 · 战场信息"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 3
    uuid = "6235960237fdb1b77f2c82b33614dcf4"
    hasVP = False
    hasUP = False

    # 能量最高累计 : {value0}层
    # REMOVE: data0 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 精神增加量 : {value1}
    # REMOVE: data1 = [0, 266, 270, 274, 278, 282, 287, 292, 297, 303, 309, 315, 321, 327, 334, 341, 349, 357, 365, 373, 381, 390, 399, 409, 418, 428, 438, 449, 459, 470, 481, 493, 505, 517, 529, 541, 555, 568, 581, 595, 609, 623, 637, 653, 667, 683, 699, 715, 731, 747, 764, 778, 794, 810, 826, 842, 857, 873, 889, 905, 921, 936, 952, 968, 983, 999, 1015, 1031, 1047, 1062, 1078]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 属性伤害量增加率 : {value2}%
    # REMOVE: data2 = [0, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5, 5.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 属性伤害量增加持续时间 : {value3}秒
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 属性伤害量叠加上限 : {value4}次
    # REMOVE: data4 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [独立作战专属]
    # 独立攻击力增加 : {value5}%
    # REMOVE: data5 = [0, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 技能冷却时间减少 : {value6}%
    # REMOVE: data6 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 激光攻击力 : {value7} X {value8}
    # REMOVE: data7 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # REMOVE: data8 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 使用[军械强化 (进阶)]时的追加轰炸次数 : {value9}次
    # REMOVE: data9 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [激光炮击目标技能]
    # [保护模件 (缓冲)]
    # [保护模件 (净化)]
    # [机动强化]
    # [军械强化 (进阶)]
    # [保护模件 (黄金复苏)]
    Spirit = data1
    associate = [{"data":data1,"type":"$+Spirit","ratio":1}]
    CarryRatio = [0]+ [(1.055 ** 3) * 100 - 100]*maxLv# noqa: E501

# 战服 · 强袭目标
# gunner_female/paramedic/0db0405a229a667e0ae97108fc5111c4
# 944b9aab492c15a8474f96947ceeb9e4/0db0405a229a667e0ae97108fc5111c4
class Skill15(ActiveBufferSkill):
    """
    持枪向前方滑行， 进行威慑射击。\n
        施放后立即为队员提供强化后的[保护模件 (缓冲)]效果。\n
    [保护模件 (缓冲) 强化效果]\n
        降低所受伤害、 进入霸体状态
    """
    name = "战服 · 强袭目标"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 6
    mp = [56, 303]
    uuid = "0db0405a229a667e0ae97108fc5111c4"
    hasVP = False
    hasUP = True
    buffer = True

    # 射击攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 3347, 3687, 4026, 4366, 4705, 5045, 5384, 5724, 6063, 6403, 6743, 7082, 7422, 7761, 8101, 8440, 8780, 9119, 9459, 9798, 10138, 10478, 10817, 11157, 11496, 11836, 12175, 12515, 12854, 13194, 13534, 13873, 14213, 14552, 14892, 15231, 15571, 15910, 16250, 16589, 16929, 17269, 17608, 17948, 18287, 18627, 18966, 19306, 19645, 19985, 20325, 20664, 21004, 21343, 21683, 22022, 22362, 22701, 23041, 23380, 23720, 24060, 24399, 24739, 25078, 25418, 25757, 26097, 26436, 26776]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 强化保护罩充能量 : {value2}
    # REMOVE: data2 = [0, 9, 23, 36, 48, 61, 73, 87, 99, 112, 125, 138, 150, 163, 176, 189, 202, 215, 227, 240, 253, 266, 279, 292, 305, 317, 330, 342, 355, 369, 391, 414, 429, 446, 461, 478, 494, 511, 527, 544, 561, 577, 593, 609, 626, 642, 659, 675, 692, 708, 724, 740, 757, 773, 790, 806, 823, 839, 855, 871, 888, 905, 921, 937, 954, 971, 986, 1003, 1019, 1036, 1052]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 强化保护罩的伤害减少率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 强化保护罩持续时间 : {value4}秒
    # REMOVE: data4 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 前方射击范围 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 机动强化
# gunner_female/paramedic/4e431eaadc1c4563fe33d03c072564f0
# 944b9aab492c15a8474f96947ceeb9e4/4e431eaadc1c4563fe33d03c072564f0
class Skill16(ActiveBufferSkill):
    """
    协战师为小队提供的强化模件。 基于战场信息， 强化中枢神经机能， 全方位提升速度。\n
        提升攻击速度、 移动速度和技能施放速度， 效果持续一定时间。\n
        需要先完成该模件的战场信息分析， 之后可利用医神设备在其他动作中施放。
    """
    name = "机动强化"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    cd = 0.1
    mp = [25, 56]
    uuid = "4e431eaadc1c4563fe33d03c072564f0"
    hasVP = False
    hasUP = False
    buffer = True
    buffType = "buff"

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击速度增加 : {value1}%
    # REMOVE: data1 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 移动速度增加 : {value2}%
    # REMOVE: data2 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 施放速度增加 : {value3}%
    # REMOVE: data3 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)


# 保护模件 (净化)
# gunner_female/paramedic/6b557a0a96ccd83b37ddb77c550f6a68
# 944b9aab492c15a8474f96947ceeb9e4/6b557a0a96ccd83b37ddb77c550f6a68
class Skill18(ActiveBufferSkill):
    """
    协战师为小队提供的净化模件。 基于已分析的战场信息， 解除异常状态。\n
        需要先完成该模件的战场信息分析， 之后可利用医神设备在其他动作中施放。
    """
    name = "保护模件 (净化)"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 1 #TODO
    rangeLv = 3
    cd = 0.1
    mp = [17, 27]
    uuid = "6b557a0a96ccd83b37ddb77c550f6a68"
    hasVP = False
    hasUP = False
    buffer = True

    # 可解除异常状态数量上限 : {value0}个
    # REMOVE: data0 = [0, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 战服 · 机动打击
# gunner_female/paramedic/9e86a1210874dc2b0c83a4a5a54a7222
# 944b9aab492c15a8474f96947ceeb9e4/9e86a1210874dc2b0c83a4a5a54a7222
class Skill19(ActiveBufferSkill):
    """
    快速突进至前方， 施展上踢攻击。 成功命中敌人后追加攻击。
    """
    name = "战服 · 机动打击"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 8
    mp = [50, 267]
    uuid = "9e86a1210874dc2b0c83a4a5a54a7222"
    hasVP = False
    hasUP = True

    # 上踢攻击力 : {value0}
    # REMOVE: data0 = [0, 6975, 7683, 8390, 9098, 9805, 10513, 11221, 11928, 12636, 13343, 14051, 14759, 15466, 16174, 16882, 17589, 18297, 19004, 19712, 20420, 21127, 21835, 22542, 23250, 23958, 24665, 25373, 26080, 26788, 27496, 28203, 28911, 29618, 30326, 31034, 31741, 32449, 33157, 33864, 34572, 35279, 35987, 36695, 37402, 38110, 38817, 39525, 40233, 40940, 41648, 42355, 43063, 43771, 44478, 45186, 45893, 46601, 47309, 48016, 48724, 49432, 50139, 50847, 51554, 52262, 52970, 53677, 54385, 55092, 55800]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 追加攻击力 : {value1}
    # REMOVE: data1 = [0, 6975, 7683, 8390, 9098, 9805, 10513, 11221, 11928, 12636, 13343, 14051, 14759, 15466, 16174, 16882, 17589, 18297, 19004, 19712, 20420, 21127, 21835, 22542, 23250, 23958, 24665, 25373, 26080, 26788, 27496, 28203, 28911, 29618, 30326, 31034, 31741, 32449, 33157, 33864, 34572, 35279, 35987, 36695, 37402, 38110, 38817, 39525, 40233, 40940, 41648, 42355, 43063, 43771, 44478, 45186, 45893, 46601, 47309, 48016, 48724, 49432, 50139, 50847, 51554, 52262, 52970, 53677, 54385, 55092, 55800]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 近战 · 闪退射击
# gunner_female/paramedic/d2cc06a46cf7b6020ccc50c30f86ab25
# 944b9aab492c15a8474f96947ceeb9e4/d2cc06a46cf7b6020ccc50c30f86ab25
class Skill20(ActiveSkill):
    """
    挥舞战斗服上装备的刀刃， 再短距离地后撤， 进行2次牵制射击。
    """
    name = "近战 · 闪退射击"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 8
    mp = [76, 409]
    uuid = "d2cc06a46cf7b6020ccc50c30f86ab25"
    hasVP = False
    hasUP = True

    # 刀刃攻击力 : {value0} X 2
    # REMOVE: data0 = [0, 2331, 2567, 2804, 3040, 3277, 3513, 3750, 3986, 4223, 4459, 4695, 4932, 5168, 5405, 5641, 5878, 6114, 6351, 6587, 6824, 7060, 7297, 7533, 7770, 8006, 8242, 8479, 8715, 8952, 9188, 9425, 9661, 9898, 10134, 10371, 10607, 10844, 11080, 11316, 11553, 11789, 12026, 12262, 12499, 12735, 12972, 13208, 13445, 13681, 13918, 14154, 14390, 14627, 14863, 15100, 15336, 15573, 15809, 16046, 16282, 16519, 16755, 16992, 17228, 17464, 17701, 17937, 18174, 18410, 18647]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 射击攻击力 : {value1} X 2
    # REMOVE: data1 = [0, 1554, 1712, 1869, 2027, 2184, 2342, 2500, 2657, 2815, 2973, 3130, 3288, 3446, 3603, 3761, 3919, 4076, 4234, 4391, 4549, 4707, 4864, 5022, 5180, 5337, 5495, 5653, 5810, 5968, 6126, 6283, 6441, 6598, 6756, 6914, 7071, 7229, 7387, 7544, 7702, 7860, 8017, 8175, 8333, 8490, 8648, 8805, 8963, 9121, 9278, 9436, 9594, 9751, 9909, 10067, 10224, 10382, 10539, 10697, 10855, 11012, 11170, 11328, 11485, 11643, 11801, 11958, 12116, 12274, 12431]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每次攻击的信息获取率 : 10%
    # [范围信息]
    # 攻击范围 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 学习[系统 · 临战编程]后
    # 强化保护罩充能量 : {value3}
    # REMOVE: data3 = [0, 98, 116, 132, 149, 166, 183, 201, 218, 235, 252, 269, 286, 303, 321, 338, 355, 372, 389, 406, 422, 440, 456, 473, 492, 521, 552, 572, 594, 615, 637, 659, 681, 703, 725, 747, 769, 790, 812, 834, 856, 878, 900, 922, 944, 965, 987, 1009, 1031, 1053, 1075, 1097, 1119, 1140, 1162, 1184, 1206, 1228, 1250, 1272, 1294, 1315, 1337, 1359, 1381, 1403, 1425, 1447, 1468, 1490, 1512]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 强化保护罩的伤害减少率 : {value4}%
    # REMOVE: data4 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 强化保护罩持续时间 : {value5}秒
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 装甲强化
# gunner_female/paramedic/7ccc03c65d676c4d8a7e6a1821409ad0
# 944b9aab492c15a8474f96947ceeb9e4/7ccc03c65d676c4d8a7e6a1821409ad0
class Skill21(ActiveBufferSkill):
    """
    协战师为小队提供的强化模件。 基于战场信息， 强化防御能力。\n
        提升队员的生命值最大值、 魔法值最大值、 物理防御力、 魔法防御力、 体力、 精神。\n
        可利用医神设备在其他动作中施放。\n
        该技能效果不与光明骑士 (男) 的[天籁之音]和[守护徽章]、 光明骑士 (女) 的[守护祝福]、 小魔女的[小魔女的偏爱]、 缪斯的[主角登场]技能效果叠加。
    """
    name = "装甲强化"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 0
    rangeLv = 3
    cd = 10
    mp = [428, 944]
    uuid = "7ccc03c65d676c4d8a7e6a1821409ad0"
    hasVP = False
    hasUP = False
    buffer = True

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 生命值最大值增加 : {value1}
    # REMOVE: data1 = [0, 383, 386, 389, 392, 395, 398, 401, 404, 407, 410, 413, 416, 419, 422, 425, 428, 431, 434, 437, 440]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值最大值增加 : {value2}
    # REMOVE: data2 = [0, 383, 386, 389, 392, 395, 398, 401, 404, 407, 410, 413, 416, 419, 422, 425, 428, 431, 434, 437, 440]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 物理防御力增加 : {value3}
    # REMOVE: data3 = [0, 11080, 11130, 11180, 11230, 11280, 11330, 11380, 11430, 11480, 11530, 11580, 11630, 11680, 11730, 11780, 11830, 11880, 11930, 11980, 12030]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 魔法防御力增加 : {value4}
    # REMOVE: data4 = [0, 11080, 11130, 11180, 11230, 11280, 11330, 11380, 11430, 11480, 11530, 11580, 11630, 11680, 11730, 11780, 11830, 11880, 11930, 11980, 12030]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 体力增加 : {value5}
    # REMOVE: data5 = [0, 94, 98, 102, 107, 112, 116, 122, 127, 131, 137, 141, 147, 153, 158, 163, 169, 175, 181, 187, 192]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 精神增加 : {value6}
    # REMOVE: data6 = [0, 94, 98, 102, 107, 112, 116, 122, 127, 131, 137, 141, 147, 153, 158, 163, 169, 175, 181, 187, 192]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    Spirit = data6
    associate = [{"data": data6,"type": "$+Spirit","ratio":1}]  # type: ignore

# 军械强化
# gunner_female/paramedic/e73e980e87591bc98940afb1ac0fe522
# 944b9aab492c15a8474f96947ceeb9e4/e73e980e87591bc98940afb1ac0fe522
class Skill22(ActiveBufferSkill):
    """
    协战师为小队提供的强化模件。 基于战场信息， 强化攻击能力。\n
        提升协战师自身的基本攻击力和技能攻击力， 同时强化其他队员的力量、 智力、 命中率、 以及物理/魔法/独立攻击力。\n
        达到20级以上后， 不再增加自身基本攻击力和技能攻击力， 且物理/魔法/独立攻击力、 力量、 智力增加效果不适用于自身。\n
        施放者的精神越高， 力量、 智力、 物理/魔法/独立攻击力的增加量越多。\n
        可利用医神设备在其他动作中施放。\n
        该技能效果不与光明骑士 (男) 的[荣誉祝福]、 光明骑士 (女) 的[勇气祝福]、 小魔女的[禁术吟咏]、 缪斯的[可爱节拍]技能效果叠加。
    """
    name = "军械强化"
    learnLv = 30
    masterLv = 30
    maxLv = 40
    position = 0 #TODO
    rangeLv = 3
    cd = 10
    mp = [529, 1166]
    uuid = "e73e980e87591bc98940afb1ac0fe522"
    hasVP = False
    hasUP = False
    buffer = True
    buffType = "buff"

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 15.4, 16.3, 17.2, 18, 18.9, 19.8, 20.6, 21.5, 22.4, 23.2, 24.1, 25, 25.8, 26.7, 27.6, 28.4, 29.3, 30.2, 31.1, 31.9, 32.8, 33.7, 34.5, 35.4, 36.3, 37.1, 38, 38.9, 39.7, 40.6, 41.5, 42.3, 43.2, 44.1, 44.9, 45.8, 46.7, 47.6, 48.4, 49.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [协战师专属效果]
    # 基本攻击力和技能攻击力增加 : {value2}%
    # REMOVE: data2 = [0, 13, 16, 19, 22, 25, 28, 31, 34, 37, 40, 43, 46, 49, 52, 55, 58, 61, 64, 67, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [队员专属效果]
    # 力量增加 : {value3}
    # REMOVE: data3 = [0, 161, 171, 181, 193, 204, 214, 224, 236, 247, 258, 269, 279, 291, 301, 313, 322, 333, 345, 356, 366, 377, 389, 399, 410, 421, 431, 442, 454, 464, 474, 486, 497, 508, 518, 531, 540, 551, 562, 572, 584]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 智力增加 : {value4}
    # REMOVE: data4 = [0, 161, 171, 181, 193, 204, 214, 224, 236, 247, 258, 269, 279, 291, 301, 313, 322, 333, 345, 356, 366, 377, 389, 399, 410, 421, 431, 442, 454, 464, 474, 486, 497, 508, 518, 531, 540, 551, 562, 572, 584]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 物理攻击力增加 : {value5}
    # REMOVE: data5 = [0, 41, 42, 44, 45, 46, 48, 50, 51, 53, 55, 56, 57, 59, 60, 62, 64, 65, 67, 69, 71, 72, 74, 76, 77, 79, 81, 81, 83, 85, 86, 88, 90, 91, 93, 94, 95, 97, 99, 100, 103]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 魔法攻击力增加 : {value6}
    # REMOVE: data6 = [0, 41, 42, 44, 45, 46, 48, 50, 51, 53, 55, 56, 57, 59, 60, 62, 64, 65, 67, 69, 71, 72, 74, 76, 77, 79, 81, 81, 83, 85, 86, 88, 90, 91, 93, 94, 95, 97, 99, 100, 103]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 独立攻击力增加 : {value7}
    # REMOVE: data7 = [0, 41, 42, 44, 45, 46, 48, 50, 51, 53, 55, 56, 57, 59, 60, 62, 64, 65, 67, 69, 71, 72, 74, 76, 77, 79, 81, 81, 83, 85, 86, 88, 90, 91, 93, 94, 95, 97, 99, 100, 103]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    ATK = data5
    STRINT = data3

# 近战 · 指定射击
# gunner_female/paramedic/50359daccd728ba338d18d9b71ac97e5
# 944b9aab492c15a8474f96947ceeb9e4/50359daccd728ba338d18d9b71ac97e5
class Skill23(ActiveSkill):
    """
    获取交战区域敌人的位置信息后， 进行6次射击。\n
        优先按怪物等级排序， 其次根据距离远近锁定更近的目标。\n
        若射击目标死亡， 则自动锁定其他存活的敌人； 若范围内没有敌人或敌人处于无敌状态， 则射击结束。
    """
    name = "近战 · 指定射击"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 9 #TODO
    rangeLv = 2
    cd = 13
    mp = [136, 732]
    uuid = "50359daccd728ba338d18d9b71ac97e5"
    hasVP = False
    hasUP = True

    # 射击攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 3064, 3375, 3686, 3997, 4307, 4618, 4929, 5240, 5551, 5862, 6172, 6483, 6794, 7105, 7416, 7727, 8037, 8348, 8659, 8970, 9281, 9592, 9902, 10213, 10524, 10835, 11146, 11457, 11768, 12078, 12389, 12700, 13011, 13322, 13633, 13943, 14254, 14565, 14876, 15187, 15498, 15808, 16119, 16430, 16741, 17052, 17363, 17674, 17984, 18295, 18606, 18917, 19228, 19539, 19849, 20160, 20471, 20782, 21093, 21404, 21714, 22025, 22336, 22647, 22958, 23269, 23579, 23890, 24201, 24512]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每次攻击的信息获取率 : 15%
    # [范围信息]
    # 探索范围 : {value2}px
    # REMOVE: data2 = [0, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200, 1200]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 保护模件 (缓冲)
# gunner_female/paramedic/fc30c667a58e1dd54b5d214e04f4f23c
# 944b9aab492c15a8474f96947ceeb9e4/fc30c667a58e1dd54b5d214e04f4f23c
class Skill24(ActiveBufferSkill):
    """
    协战师为小队提供的保护模件。 基于已分析的战场信息， 生成可代受伤害的保护罩。 保护罩可累积， 当所受伤害量超过累积的保护罩能量上限时， 超出部分的伤害量将直接扣除生命值。\n
        需要先完成该模件的战场信息分析， 之后可利用医神设备在其他动作中施放。
    """
    name = "保护模件 (缓冲)"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 1 #TODO
    rangeLv = 3
    cd = 0.1
    mp = [36, 195]
    uuid = "fc30c667a58e1dd54b5d214e04f4f23c"
    hasVP = False
    hasUP = False
    buffer = True

    # 保护罩持续时间 : {value0}秒
    # REMOVE: data0 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 保护罩充能量 : {value1}
    # REMOVE: data1 = [0, 3182, 3509, 3836, 4164, 4492, 4819, 5146, 5474, 5802, 6129, 6456, 6784, 7111, 7439, 7767, 8070, 8421, 8726, 9053, 9404, 9965, 10550, 10947, 11369, 11766, 12188, 12608, 13030, 13451, 13871, 14293, 14714, 15112, 15532, 15954, 16375, 16795, 17217, 17638, 18059, 18456, 18878, 19299, 19719, 20141, 20562, 20983, 21404, 21802, 22223, 22643, 23065, 23486, 23907, 24328, 24749, 25147, 25567, 25989, 26410, 26831, 26949, 27352, 27754, 28157, 28559, 28962, 29364, 29767, 30169]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 保护罩能量上限 : 目标最大生命值的{value2}%
    # REMOVE: data2 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 近战 · 爆刃突袭
# gunner_female/paramedic/1c1cf47273c67ff26eb60b375ace2062
# 944b9aab492c15a8474f96947ceeb9e4/1c1cf47273c67ff26eb60b375ace2062
class Skill25(ActiveSkill):
    """
    挥舞战斗服上装备的刀刃， 将敌人拉至身前。 发起连续攻击后， 沿直线方向返回原位。
    """
    name = "近战 · 爆刃突袭"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [226, 1218]
    uuid = "1c1cf47273c67ff26eb60b375ace2062"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 刀刃攻击力 : {value0}
    # REMOVE: data0 = [0, 3243, 3572, 3901, 4230, 4559, 4888, 5217, 5546, 5875, 6204, 6533, 6862, 7191, 7520, 7849, 8178, 8507, 8836, 9165, 9494, 9823, 10152, 10481, 10810, 11139, 11468, 11797, 12126, 12455, 12784, 13114, 13443, 13772, 14101, 14430, 14759, 15088, 15417, 15746, 16075, 16404, 16733, 17062, 17391, 17720, 18049, 18378, 18707, 19036, 19365, 19694, 20023, 20352, 20681, 21010, 21339, 21668, 21997, 22326, 22655, 22984, 23313, 23642, 23971, 24300, 24629, 24958, 25287, 25616, 25945]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 后方刀刃穿刺攻击力 : {value1}
    # REMOVE: data1 = [0, 6486, 7144, 7802, 8460, 9118, 9776, 10434, 11092, 11750, 12408, 13067, 13725, 14383, 15041, 15699, 16357, 17015, 17673, 18331, 18989, 19647, 20305, 20963, 21621, 22279, 22937, 23595, 24253, 24911, 25569, 26227, 26885, 27543, 28201, 28859, 29517, 30175, 30833, 31491, 32149, 32807, 33465, 34123, 34781, 35439, 36097, 36755, 37413, 38071, 38729, 39388, 40046, 40704, 41362, 42020, 42678, 43336, 43994, 44652, 45310, 45968, 46626, 47284, 47942, 48600, 49258, 49916, 50574, 51232, 51890]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 射击攻击力 : {value2} X 2
    # REMOVE: data2 = [0, 324, 357, 390, 423, 456, 489, 522, 555, 588, 620, 653, 686, 719, 752, 785, 818, 851, 884, 917, 949, 982, 1015, 1048, 1081, 1114, 1147, 1180, 1213, 1246, 1278, 1311, 1344, 1377, 1410, 1443, 1476, 1509, 1542, 1575, 1607, 1640, 1673, 1706, 1739, 1772, 1805, 1838, 1871, 1904, 1936, 1969, 2002, 2035, 2068, 2101, 2134, 2167, 2200, 2233, 2265, 2298, 2331, 2364, 2397, 2430, 2463, 2496, 2529, 2562, 2595]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 扫腿攻击力 : {value3}
    # REMOVE: data3 = [0, 2595, 2858, 3121, 3384, 3647, 3911, 4174, 4437, 4700, 4963, 5227, 5490, 5753, 6016, 6279, 6543, 6806, 7069, 7332, 7595, 7859, 8122, 8385, 8648, 8912, 9175, 9438, 9701, 9964, 10228, 10491, 10754, 11017, 11280, 11544, 11807, 12070, 12333, 12596, 12860, 13123, 13386, 13649, 13913, 14176, 14439, 14702, 14965, 15229, 15492, 15755, 16018, 16281, 16545, 16808, 17071, 17334, 17597, 17861, 18124, 18387, 18650, 18914, 19177, 19440, 19703, 19966, 20230, 20493, 20756]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 终结踢击攻击力 : {value4}
    # REMOVE: data4 = [0, 2595, 2858, 3121, 3384, 3647, 3911, 4174, 4437, 4700, 4963, 5227, 5490, 5753, 6016, 6279, 6543, 6806, 7069, 7332, 7595, 7859, 8122, 8385, 8648, 8912, 9175, 9438, 9701, 9964, 10228, 10491, 10754, 11017, 11280, 11544, 11807, 12070, 12333, 12596, 12860, 13123, 13386, 13649, 13913, 14176, 14439, 14702, 14965, 15229, 15492, 15755, 16018, 16281, 16545, 16808, 17071, 17334, 17597, 17861, 18124, 18387, 18650, 18914, 19177, 19440, 19703, 19966, 20230, 20493, 20756]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 爆炸攻击力 : {value5}
    # REMOVE: data5 = [0, 9729, 10716, 11703, 12690, 13678, 14665, 15652, 16639, 17626, 18613, 19600, 20587, 21574, 22561, 23548, 24535, 25522, 26509, 27496, 28483, 29470, 30457, 31444, 32431, 33418, 34405, 35392, 36379, 37366, 38353, 39341, 40328, 41315, 42302, 43289, 44276, 45263, 46250, 47237, 48224, 49211, 50198, 51185, 52172, 53159, 54146, 55133, 56120, 57107, 58094, 59081, 60068, 61055, 62042, 63029, 64016, 65004, 65991, 66978, 67965, 68952, 69939, 70926, 71913, 72900, 73887, 74874, 75861, 76848, 77835]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 第一击攻击范围 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [近战 · 爆刃突袭]\n
        删除部分攻击， 合算至最后一击\n
        未命中时， 剩余冷却时间缩短为2秒\n
        总攻击力相同\n
        [保护模块 (黄金复苏)]\n
        协战师死亡后可以施放技能\n
        协战师可以为自己施放复活技能\n
        单人挑战时可复活次数 : 1次
        """
        ...

    def vp_2(self):
        """
        [近战 · 爆刃突袭]\n
        删除部分攻击， 合算至最后一击\n
        追踪前方500px范围内的敌人\n
        总攻击力相同\n
        [保护模块 (黄金复苏)]\n
        协战师死亡后可以施放技能\n
        协战师可以为自己施放复活技能\n
        单人挑战时可复活次数 : 1次
        """
        ...

# 军械强化 (进阶)
# gunner_female/paramedic/1c9cf3b27d9d6ee5e024e2592cad24a5
# 944b9aab492c15a8474f96947ceeb9e4/1c9cf3b27d9d6ee5e024e2592cad24a5
class Skill26(ActiveBufferSkill):
    """
    协战师为小队提供的强化模件。 基于已收集的信息， 重新定义[军械强化]效果， 提供更加优化的增益。
    """
    name = "军械强化 (进阶)"
    learnLv = 40
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 3
    cd = 0.1
    mp = [40, 40]
    uuid = "1c9cf3b27d9d6ee5e024e2592cad24a5"
    hasVP = False
    hasUP = False
    buffer = True
    buffType = "buffSub"

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [军械强化]增幅率 : {value1}%
    # REMOVE: data1 = [0, 12]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def skillInfo(self):
        prep = self.char.BuffSkill.skillInfo()
        ratio = self.data1[self.lv] / 100
        return prep[0] * ratio, [prep[1][0]*ratio,prep[1][1],prep[1][2]*ratio], [prep[2][0]*ratio,prep[2][1],prep[2][2]*ratio],0,self.getSkillCD()

# 战服 · 护盾冲击
# gunner_female/paramedic/1fd827a816f1d00450bcb2cf298a157a
# 944b9aab492c15a8474f96947ceeb9e4/1fd827a816f1d00450bcb2cf298a157a
class Skill27(ActiveBufferSkill):
    """
    开启战斗服的内置护盾， 向前冲撞。 护盾撞击到的敌人会受到伤害并被击退。\n
        施放后立即为队员提供强化后的[保护模件 (缓冲)]效果。\n
    [保护模件 (缓冲) 强化效果]\n
        降低所受伤害、 进入霸体状态
    """
    name = "战服 · 护盾冲击"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [356, 1917]
    uuid = "1fd827a816f1d00450bcb2cf298a157a"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501
    buffer = True

    # 冲撞攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 8661, 9539, 10418, 11296, 12175, 13054, 13932, 14811, 15689, 16568, 17447, 18325, 19204, 20082, 20961, 21840, 22718, 23597, 24475, 25354, 26233, 27111, 27990, 28868, 29747, 30626, 31504, 32383, 33261, 34140, 35019, 35897, 36776, 37654, 38533, 39412, 40290, 41169, 42047, 42926, 43805, 44683, 45562, 46440, 47319, 48198, 49076, 49955, 50833, 51712, 52591, 53469, 54348, 55226, 56105, 56984, 57862, 58741, 59619, 60498, 61377, 62255, 63134, 64012, 64891, 65770, 66648, 67527, 68405, 69284]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 强化保护罩充能量 : {value2}
    # REMOVE: data2 = [0, 734, 787, 841, 894, 948, 1002, 1055, 1108, 1162, 1216, 1269, 1319, 1376, 1426, 1479, 1537, 1628, 1724, 1789, 1858, 1923, 1992, 2060, 2129, 2198, 2267, 2336, 2404, 2469, 2538, 2607, 2676, 2744, 2813, 2882, 2951, 3016, 3084, 3153, 3222, 3291, 3360, 3428, 3497, 3562, 3631, 3700, 3769, 3838, 3906, 3975, 4044, 4109, 4178, 4247, 4316, 4384, 4452, 4521, 4588, 4657, 4725, 4793, 4862, 4930, 4998, 5067, 5135, 5203, 5272]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 强化保护罩的伤害减少率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 强化保护罩持续时间 : {value4}秒
    # REMOVE: data4 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 护盾大小 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [战服 · 护盾冲击]\n
        删除突进动作， 向前方发射护盾\n
        护盾大小 +30%\n
        [保护模件 (缓冲)]\n
        保护罩恢复量 +10%\n
        保护罩充能量上限额外 +10%
        """
        ...

    def vp_2(self):
        """
        [战服 · 护盾冲击]\n
        向前方跳跃并展开护盾下劈\n
        - 护盾在地面设置电流线， 使敌人进入减速和感电状态\n
        - 减速 : 攻击速度和移动速度 -30%\n
        - 电流线持续时间 : 5秒\n
        总攻击力相同\n
        [保护模件 (缓冲)]\n
        保护罩恢复量 +10%\n
        保护罩充能量上限额外 +10%
        """
        ...

# 战服 · 开拓射线
# gunner_female/paramedic/68c20fbed9e68d3cb677072c9274736f
# 944b9aab492c15a8474f96947ceeb9e4/68c20fbed9e68d3cb677072c9274736f
class Skill28(ActiveSkill):
    """
    开启战斗服的内置手炮， 向前方发射激光。\n
        激光对敌人造成多段伤害， 且激光所掠过的地面会即刻引爆， 造成额外伤害。
    """
    name = "战服 · 开拓射线"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [502, 2701]
    uuid = "68c20fbed9e68d3cb677072c9274736f"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 레이저 공격력 : {value1} X {value2}
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 30643, 33751, 36860, 39968, 43077, 46186, 49294, 52403, 55512, 58620, 61729, 64838, 67946, 71055, 74164, 77272, 80381, 83490, 86598, 89707, 92816, 95924, 99033, 102142, 105250, 108359, 111468, 114576, 117685, 120794, 123902, 127011, 130120, 133228, 136337, 139446, 142554, 145663, 148772, 151880, 154989, 158098, 161206, 164315, 167424, 170532, 173641, 176749, 179858, 182967, 186075, 189184, 192293, 195401, 198510, 201619, 204727, 207836, 210945, 214053, 217162, 220271, 223379, 226488, 229597, 232705, 235814, 238923, 242031, 245140]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 지면 폭발 공격력 : {value3}
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 타격 당 정보 습득률 : 10%
    # [범위 정보]
    # 레이저 굵기 : {value4}%
    # data4 = None # TOCHECK    # REMOVE: data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [战服 · 开拓射线]\n
        施放速度增加\n
        沿着激光路径将左右范围的敌人聚集成一列\n
        激光宽度 +15%\n
        [强袭策略 : 区域肃清]\n
        满足条件时， 冷却时间减少1秒 (最多25秒)\n
        1. [保护模件 (缓冲)]\n
        - 对队友施加效果时\n
        2. [军械强化 (进阶)]\n
        - 对队友施加效果时\n
        3. [系统 · 战场信息]\n
        - 适用属性伤害增加效果时 (冷却时间5秒)\n
        4. [系统 · 作战应对]\n
        - 增益效果持续时间更新时
        """
        ...

    def vp_2(self):
        """
        [战服 · 开拓射线]\n
        激光划过的地面引发巨大爆炸， 造成多段攻击伤害\n
        冷却时间 +50%\n
        - 追加爆炸多段攻击次数 : 4次\n
        总攻击力 +50%\n
        [强袭策略 : 区域肃清]\n
        满足条件时， 冷却时间减少1秒 (最多25秒)\n
        1. [保护模件 (缓冲)]\n
        - 对队友施加效果时\n
        2. [军械强化 (进阶)]\n
        - 对队友施加效果时\n
        3. [系统 · 战场信息]\n
        - 适用属性伤害增加效果时 (冷却时间5秒)\n
        4. [系统 · 作战应对]\n
        - 增益效果持续时间更新时
        """
        ...

# 系统 · 作战应对
# gunner_female/paramedic/a8574a8efa365e8e46e805a6e1d7bfef
# 944b9aab492c15a8474f96947ceeb9e4/a8574a8efa365e8e46e805a6e1d7bfef
class Skill29(PassiveBufferSkill):
    """
    교전 지역에 대한 분대원의 방어체계 모듈을 추가한다.\n
    스키퍼의 기본/스킬 공격력이 증가하고, 자신을 포함한 분대원들의 힘, 지능, 체력, 정신력, 공격 속도, 이동 속도가 증가한다.\n
    스키퍼의 정신력 스탯은 힘 스탯보다 높은 경우, 정신력 스탯만큼 힘 스탯을 보정해주는 기능이 추가된다. (스탯 % 증가 효과는 제외하고 보정된다.)\n
    또한 정보 스택을 소모하는 분대 강화 스킬 시전 시 현재 적용중인 squad::무기강화();squad::장갑강화();의 지속시간이 증가한다.
    """
    name = "系统 · 作战应对"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "a8574a8efa365e8e46e805a6e1d7bfef"
    hasVP = False
    hasUP = False

    # 力量、 智力增加 : {value0}
    # REMOVE: data0 = [0, 40, 48, 58, 67, 77, 87, 98, 109, 120, 133, 144, 157, 171, 184, 198, 212, 226, 242, 258, 273, 290, 306, 323, 341, 359, 378, 397, 416, 436, 456, 476, 498, 518, 541, 562, 586, 609, 632, 654, 678, 702, 726, 750, 774, 798, 823, 848, 873, 898, 923]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 体力、 精神增加 : {value1}
    # REMOVE: data1 = [0, 10, 29, 48, 67, 86, 105, 124, 143, 162, 181, 200, 219, 238, 257, 276, 295, 314, 333, 352, 371, 390, 409, 428, 447, 466, 489, 511, 534, 556, 579, 601, 624, 646, 669, 691, 714, 736, 759, 781, 804, 826, 849, 871, 894, 916, 939, 961, 984, 1006, 1029]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 攻击速度、 移动速度增加 : {value2}%
    # REMOVE: data2 = [0, 4.2, 4.6, 5, 5.4, 5.8, 6.3, 6.7, 7.1, 7.5, 7.9, 8.3, 8.8, 9.2, 9.6, 10, 10.4, 10.8, 11.3, 11.7, 12.1, 12.5, 12.9, 13.3, 13.8, 14.2, 14.6, 15, 15.4, 15.8, 16.3, 16.7, 17.1, 17.5, 17.9, 18.3, 18.8, 19.2, 19.6, 20, 20.4, 20.8, 21.3, 21.7, 22.1, 22.5, 22.9, 23.3, 23.8, 24.2, 24.6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 消耗信息时[军械强化]、 [装甲强化]持续时间延长 : {value3}秒
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [协战师专属效果]
    # 基本攻击力和技能攻击力增加 : {value4}%
    # REMOVE: data4 = [0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31.5, 33, 34.5, 36, 37.5, 39, 40.5, 42, 43.5, 45, 46.5, 48, 49.5, 51, 52.5, 54, 55.5, 57, 58.5, 60, 61.5, 63, 64.5, 66, 67.5, 69, 70.5, 72, 73.5, 75]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    STRINT = data0
    Spirit = data1
    associate = [{"data": data1,"type": "$+Spirit","ratio":1}]  # type: ignore

# 强袭策略 : 区域肃清
# gunner_female/paramedic/ca0cc360e00e5f13e33027bf5fc53d5d
# 944b9aab492c15a8474f96947ceeb9e4/ca0cc360e00e5f13e33027bf5fc53d5d
class Skill30(ActiveBufferSkill):
    """
    开启部署在强袭区域上空的医神设备， 执行清除区域内敌人的任务。 医神设备从空中对目标区域进行火力支援， 同时协战师将该区域信息同步共享给队员。 将在一定时间内， 提升队员的力量、 智力、 攻击速度和移动速度， 对范围内敌人造成多段伤害。 但施放者自身不受此力量、 智力提升效果影响。\n
        该技能效果不与光明骑士 (男) 的[天启之光]、 光明骑士 (女) 的[圣光天启]、 小魔女的[开幕！人偶剧场]、 缪斯的[梦想的舞台]技能效果叠加。
    """
    name = "强袭策略 : 区域肃清"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 5
    cd = 170
    mp = [1727, 7104]
    uuid = "ca0cc360e00e5f13e33027bf5fc53d5d"
    hasVP = False
    hasUP = False
    buffType = 'awake'

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 力量增加量 : {value1}
    # REMOVE: data1 = [0, 43, 57, 74, 91, 111, 131, 153, 176, 201, 228, 255, 284, 315, 346, 379, 414, 449, 487, 526, 567, 608, 651, 696, 741, 789, 838, 888, 939, 993, 1047, 1103, 1160, 1219, 1278, 1340, 1403, 1467, 1533, 1600, 1668, 1736, 1804, 1872, 1940, 2008, 2076, 2144, 2212, 2280, 2348]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 智力增加量 : {value2}
    # REMOVE: data2 = [0, 43, 57, 74, 91, 111, 131, 153, 176, 201, 228, 255, 284, 315, 346, 379, 414, 449, 487, 526, 567, 608, 651, 696, 741, 789, 838, 888, 939, 993, 1047, 1103, 1160, 1219, 1278, 1340, 1403, 1467, 1533, 1600, 1668, 1736, 1804, 1872, 1940, 2008, 2076, 2144, 2212, 2280, 2348]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 攻击速度增加量 : {value3}%
    # REMOVE: data3 = [0, 5, 6.4, 7.6, 9, 10.3, 11.6, 12.9, 14.2, 15.5, 16.9, 18.2, 19.5, 20.8, 22.1, 23.4, 24.8, 26.1, 27.4, 28.7, 30, 31.3, 32.7, 34, 35.3, 36.6, 37.9, 39.2, 40.5, 41.9, 43.2, 44.5, 45.8, 47.1, 48.4, 49.8, 51.1, 52.4, 53.7, 55, 56.3, 57.6, 58.9, 60.2, 61.5, 62.8, 64.1, 65.4, 66.7, 68, 69.3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 移动速度增加量 : {value4}%
    # REMOVE: data4 = [0, 5, 6.4, 7.6, 9, 10.3, 11.6, 12.9, 14.2, 15.5, 16.9, 18.2, 19.5, 20.8, 22.1, 23.4, 24.8, 26.1, 27.4, 28.7, 30, 31.3, 32.7, 34, 35.3, 36.6, 37.9, 39.2, 40.5, 41.9, 43.2, 44.5, 45.8, 47.1, 48.4, 49.8, 51.1, 52.4, 53.7, 55, 56.3, 57.6, 58.9, 60.2, 61.5, 62.8, 64.1, 65.4, 66.7, 68, 69.3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 激光炮击攻击力 : {value5} X {value6}
    # REMOVE: data5 = [0, 5182, 6383, 7585, 8787, 9988, 11190, 12391, 13593, 14795, 15996, 17198, 18399, 19601, 20803, 22004, 23206, 24407, 25609, 26811, 28012, 29214, 30415, 31617, 32819, 34020, 35222, 36423, 37625, 38827, 40028, 41230, 42431, 43633, 44835, 46036, 47238, 48439, 49641, 50843, 52044, 53246, 54447, 55649, 56850, 58052, 59254, 60455, 61657, 62858, 64060]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # REMOVE: data6 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 力场爆炸攻击力 : {value7}
    # REMOVE: data7 = [0, 77728, 95752, 113776, 131800, 149824, 167848, 185872, 203896, 221920, 239944, 257968, 275991, 294015, 312039, 330063, 348087, 366111, 384135, 402159, 420183, 438207, 456231, 474255, 492279, 510303, 528326, 546350, 564374, 582398, 600422, 618446, 636470, 654494, 672518, 690542, 708566, 726590, 744614, 762638, 780661, 798685, 816709, 834733, 852757, 870781, 888805, 906829, 924853, 942877, 960901]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    STRINT = data1

# 保护模件 (黄金复苏)
# gunner_female/paramedic/da29a96a20a75aa0cd8fd7f526bdb107
# 944b9aab492c15a8474f96947ceeb9e4/da29a96a20a75aa0cd8fd7f526bdb107
class Skill31(ActiveSkill):
    """
    协战师为小队提供的保护模件， 可使心跳骤停的队员恢复生命体征。\n
        协战师的队员们心跳骤停时， 存在黄金时间。\n
        在黄金时间内， 仍维持现有增益效果。 通过该技能对停止跳动的心脏进行冲击， 可恢复部分生命值和魔法值， 使队员迅速重返战斗。\n
    为没有进入心跳骤停状态的队员， 赋予实时更新生命体征的保护模件。 该模件持续时间内， 队员进入心跳骤停状态时， 医神无人机会从空中降下， 立即对停止跳动的心脏进行冲击， 可恢复部分生命值和魔法值， 使队员迅速重返战斗。\n
        黄金时间内， 可用复活币进行复活。
    """
    name = "保护模件 (黄金复苏)"
    learnLv = 60
    masterLv = 1
    maxLv = 11
    position = 1 #TODO
    rangeLv = 3
    cube = 2
    cd = 2
    mp = [17, 27]
    uuid = "da29a96a20a75aa0cd8fd7f526bdb107"
    hasVP = False
    hasUP = False

    # 골든 타임 : 9초
    # 생체 정보 갱신 지속시간 : {value1}초
    # REMOVE: data1 = [0, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 제세동 대상 HP/MP 회복량 : {value2}%
    # data2 = None # TOCHECK    # REMOVE: data2 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 系统 · 区域防御
# gunner_female/paramedic/8403ffaa9106bbfc1fd2e078e54d2e81
# 944b9aab492c15a8474f96947ceeb9e4/8403ffaa9106bbfc1fd2e078e54d2e81
class Skill32(ActiveSkill):
    """
    无人机启动强大的力场， 对敌人造成伤害。 力场存续期间， 协战师免疫所有伤害。 力场被无人机回收时， 将再次对敌人造成伤害。
    """
    name = "系统 · 区域防御"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 2
    cd = 30
    mp = [347, 1428]
    uuid = "8403ffaa9106bbfc1fd2e078e54d2e81"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 力场启动攻击力 : {value0}
    # REMOVE: data0 = [0, 25411, 27989, 30567, 33145, 35723, 38301, 40879, 43456, 46034, 48612, 51190, 53768, 56346, 58924, 61502, 64080, 66658, 69236, 71814, 74392, 76970, 79547, 82125, 84703, 87281, 89859, 92437, 95015, 97593, 100171, 102749, 105327, 107905, 110483, 113061, 115638, 118216, 120794, 123372, 125950, 128528, 131106, 133684, 136262, 138840, 141418, 143996, 146574, 149152, 151729]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 力场回收攻击力 : {value1}
    # REMOVE: data1 = [0, 25411, 27989, 30567, 33145, 35723, 38301, 40879, 43456, 46034, 48612, 51190, 53768, 56346, 58924, 61502, 64080, 66658, 69236, 71814, 74392, 76970, 79547, 82125, 84703, 87281, 89859, 92437, 95015, 97593, 100171, 102749, 105327, 107905, 110483, 113061, 115638, 118216, 120794, 123372, 125950, 128528, 131106, 133684, 136262, 138840, 141418, 143996, 146574, 149152, 151729]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 无敌状态持续时间 : {value2}秒
    # REMOVE: data2 = [0, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7, 0.7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 无敌状态持续时间同步率 : {value3}%
    # REMOVE: data3 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [系统 · 区域防御]\n
        施放时， 恢复15%的魔法值\n
        力场持续时间 +0.3秒\n
        队员的同步率 +50%\n
        初始化[近战 · 爆刃突袭]的冷却时间\n
        - [近战 · 爆刃突袭]攻击力 -33%
        """
        ...

    def vp_2(self):
        """
        [系统 · 区域防御]\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 15秒\n
        - 攻击力 -50%\n
        力场持续时间 -0.2秒\n
        队员的同步率 +50%
        """
        ...

# 战服 · 歼灭行动
# gunner_female/paramedic/26a9454eb0d175ebeac162d68814238b
# 944b9aab492c15a8474f96947ceeb9e4/26a9454eb0d175ebeac162d68814238b
class Skill33(ActiveSkill):
    """
    立即从战斗服召唤6架小无人机， 向前方发射直线激光。 随后协战师空翻撤至后方， 回收无人机并挥舞， 造成二次伤害。
    """
    name = "战服 · 歼灭行动"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [416, 1710]
    uuid = "26a9454eb0d175ebeac162d68814238b"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 直线激光攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 3863, 4255, 4647, 5039, 5431, 5823, 6215, 6606, 6998, 7390, 7782, 8174, 8566, 8958, 9350, 9742, 10134, 10526, 10917, 11309, 11701, 12093, 12485, 12877, 13269, 13661, 14053, 14445, 14837, 15228, 15620, 16012, 16404, 16796, 17188, 17580, 17972, 18364, 18756, 19148, 19539, 19931, 20323, 20715, 21107, 21499, 21891, 22283, 22675, 23067]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 激光挥舞攻击力 : {value2}
    # REMOVE: data2 = [0, 38631, 42550, 46469, 50388, 54307, 58226, 62146, 66065, 69984, 73903, 77822, 81741, 85660, 89579, 93498, 97417, 101336, 105255, 109175, 113094, 117013, 120932, 124851, 128770, 132689, 136608, 140527, 144446, 148365, 152285, 156204, 160123, 164042, 167961, 171880, 175799, 179718, 183637, 187556, 191475, 195394, 199314, 203233, 207152, 211071, 214990, 218909, 222828, 226747, 230666]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [战服 · 歼灭行动]\n
        可以在其他动作中施放\n
        命中时, 使目标进入减速状态\n
        - 减速效果 : 攻击速度和移动速度 -50%\n
        - 减速持续时间 : 7秒\n
        [机动强化]\n
        增益效果持续时间 +5秒\n
        所有速度 +10%
        """
        ...

    def vp_2(self):
        """
        [战服 · 歼灭行动]\n
        立即施放最后一击\n
        - 总攻击力相同\n
        命中时， 使目标进入强制控制状态3秒\n
        [机动强化]\n
        增益效果持续时间 +5秒\n
        所有速度 +10%
        """
        ...

# 系统 · 限制解除
# gunner_female/paramedic/a354f4930334e70b0275f5d92668ce3d
# 944b9aab492c15a8474f96947ceeb9e4/a354f4930334e70b0275f5d92668ce3d
class Skill34(PassiveBufferSkill):
    """
    历经无数实战考验， 完成极限训练的战勤统帅， 方可解禁战勤系统限制代码。\n
        提升战勤统帅的精神、 基本攻击力和技能攻击力、 物理暴击率， 并增加[保护模件 (缓冲)]的单次生成数量和最大累积上限。
    """
    name = "系统 · 限制解除"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "a354f4930334e70b0275f5d92668ce3d"
    hasVP = False
    hasUP = False

    # 精神增加 : {value0}
    # REMOVE: data0 = [0, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290, 300, 310, 320, 330, 340, 350, 360, 370, 380, 390, 400, 410, 420, 430, 440, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加 : {value1}%
    # REMOVE: data1 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 物理暴击率增加 : {value2}%
    # REMOVE: data2 = [0, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 学习[保护模件 (缓冲)]后
    # 保护罩额外生成 : {value3}%
    # REMOVE: data3 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 保护罩最大累积量上限 : 目标生命值上限的{value4}%
    # REMOVE: data4 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 强化保护罩额外生成 : {value5}%
    # REMOVE: data5 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 强化保护罩额外降低伤害 : {value6}%
    # REMOVE: data6 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    Spirit = data0
    associate = [{"data": data0,"type": "$+Spirit","ratio":1}]  # type: ignore

# 战服 · 超限压制
# gunner_female/paramedic/9559c99a9596b20d031de1ce2649b326
# 944b9aab492c15a8474f96947ceeb9e4/9559c99a9596b20d031de1ce2649b326
class Skill35(ActiveSkill):
    """
    启动战斗服的超负荷极限输出程序， 突进追踪前方射程范围内的所有敌人， 造成高额伤害， 随后回归原位。
    """
    name = "战服 · 超限压制"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [982, 4038]
    uuid = "9559c99a9596b20d031de1ce2649b326"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 压制攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 18255, 20107, 21959, 23811, 25663, 27515, 29367, 31219, 33071, 34923, 36775, 38627, 40479, 42331, 44183, 46035, 47887, 49739, 51591, 53443, 55295, 57147, 58999, 60851, 62703, 64555, 66407, 68259, 70111, 71963, 73815, 75666, 77518, 79370, 81222, 83074, 84926, 86778, 88630, 90482, 92334, 94186, 96038, 97890, 99742, 101594, 103446, 105298, 107150, 109002]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [战服 · 超限压制]\n
        直接向前方突进\n
        - 施放时进入无敌状态\n
        [保护模件 (净化)]\n
        施放时， 队员和自身恢复生命值最大值10%的生命值\n
        免疫一次解除的减益效果， 持续10秒
        """
        ...

    def vp_2(self):
        """
        [战服 · 超限压制]\n
        删除寻敌功能\n
        快速包围前方圆形范围进行攻击\n
        - 被包围的敌人被推到中心位置\n
        - 无敌持续时间增加\n
        [保护模件 (净化)]\n
        施放时， 队员和自身恢复生命值最大值10%的生命值\n
        免疫一次解除的减益效果， 持续10秒
        """
        ...

# 战服 · 超负荷炮
# gunner_female/paramedic/955eb7e828c2517131a80f580186838c
# 944b9aab492c15a8474f96947ceeb9e4/955eb7e828c2517131a80f580186838c
class Skill36(ActiveSkill):
    """
    取出战斗服内置的遥控兵器并部署于前方， 为其超负荷充能后， 以强烈的冲击力向前方发射， 对敌人造成伤害。\n
        施放后立即为队员提供强化后的[保护模件 (缓冲)]效果。\n
    [保护模件 (缓冲) 强化效果]\n
        降低所受伤害、 进入霸体状态
    """
    name = "战服 · 超负荷炮"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [1185, 4873]
    uuid = "955eb7e828c2517131a80f580186838c"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 能量炮发射攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 10896, 12001, 13106, 14212, 15317, 16423, 17528, 18633, 19739, 20844, 21949, 23055, 24160, 25265, 26371, 27476, 28581, 29687, 30792, 31898, 33003, 34108, 35214, 36319, 37424, 38530, 39635, 40740, 41846, 42951, 44057, 45162, 46267, 47373, 48478, 49583, 50689, 51794, 52899, 54005, 55110, 56215, 57321, 58426, 59532, 60637, 61742, 62848, 63953, 65058]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 强化保护罩充能量 : {value2}
    # REMOVE: data2 = [0, 3461, 3585, 3708, 3832, 3956, 4080, 4204, 4328, 4445, 4568, 4692, 4816, 4940, 5064, 5188, 5311, 5428, 5552, 5676, 5800, 5924, 6048, 6171, 6295, 6412, 6536, 6660, 6784, 6908, 7031, 7155, 7279, 7396, 7520, 7644, 7768, 7891, 8014, 8137, 8259, 8382, 8505, 8628, 8751, 8874, 8997, 9120, 9243, 9366, 9489]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 强化保护罩降低伤害率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [战服 · 超负荷炮]\n
        改变激光输出方式\n
        - 以施放者为中心画圆进行发射\n
        总攻击力相同\n
        [系统 · 限制解除]\n
        强化保护罩持续时间 +3秒\n
        所受伤害减少量 +5%
        """
        ...

    def vp_2(self):
        """
        [战服 · 超负荷炮]\n
        改变激光输出方式\n
        - 医神设备自动施放\n
        可以在其他动作中施放\n
        激光多段攻击次数 +5次\n
        总攻击力相同\n
        [系统 · 限制解除]\n
        强化保护罩持续时间 +3秒\n
        所受伤害减少量 +5%
        """
        ...

# 绝境策略 : 极限歼灭
# gunner_female/paramedic/c6eaf15c287d9154479d1714cad5b4e0
# 944b9aab492c15a8474f96947ceeb9e4/c6eaf15c287d9154479d1714cad5b4e0
class Skill37(ActiveSkill):
    """
    战勤统帅在判断小队即将全灭时， 可启用的机密战术程序。 该程序需通过战勤统帅的权限启用， 执行时激活自律神经系统约3秒， 随后调用战斗服内置的所有兵器， 发动毁天灭地的攻势。
    """
    name = "绝境策略 : 极限歼灭"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2327, 9573]
    uuid = "c6eaf15c287d9154479d1714cad5b4e0"
    hasVP = False
    hasUP = False

    # 爪攻击力 : {value0}
    # REMOVE: data0 = [0, 52019, 64081, 76143, 88205, 100268, 112330, 124392, 136455, 148517, 160579, 172641, 184704, 196766, 208828, 220891, 232953, 245015, 257077, 269140, 281202, 293264, 305327, 317389, 329451, 341513, 353576, 365638, 377700, 389763, 401825, 413887, 425949, 438012, 450074, 462136, 474199, 486261, 498323, 510385, 522448, 534510, 546572, 558635, 570697, 582759, 594821, 606884, 618946, 631008, 643071]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 无人机协同攻击力 : {value1} X {value2}
    # REMOVE: data1 = [0, 5202, 6408, 7614, 8821, 10027, 11233, 12439, 13645, 14852, 16058, 17264, 18470, 19677, 20883, 22089, 23295, 24502, 25708, 26914, 28120, 29326, 30533, 31739, 32945, 34151, 35358, 36564, 37770, 38976, 40182, 41389, 42595, 43801, 45007, 46214, 47420, 48626, 49832, 51039, 52245, 53451, 54657, 55863, 57070, 58276, 59482, 60688, 61895, 63101, 64307]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 护盾砸击攻击力 : {value3}
    # REMOVE: data3 = [0, 78028, 96121, 114215, 132308, 150402, 168495, 186588, 204682, 222775, 240869, 258962, 277056, 295149, 313242, 331336, 349429, 367523, 385616, 403710, 421803, 439896, 457990, 476083, 494177, 512270, 530364, 548457, 566550, 584644, 602737, 620831, 638924, 657018, 675111, 693204, 711298, 729391, 747485, 765578, 783672, 801765, 819858, 837952, 856045, 874139, 892232, 910325, 928419, 946512, 964606]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 超负荷炮攻击力 : {value4} X {value5}
    # REMOVE: data4 = [0, 19507, 24030, 28554, 33077, 37600, 42124, 46647, 51170, 55694, 60217, 64741, 69264, 73787, 78311, 82834, 87357, 91881, 96404, 100927, 105451, 109974, 114497, 119021, 123544, 128068, 132591, 137114, 141638, 146161, 150684, 155208, 159731, 164254, 168778, 173301, 177824, 182348, 186871, 191395, 195918, 200441, 204965, 209488, 214011, 218535, 223058, 227581, 232105, 236628, 241151]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 系统常量 · 战斗服 (改良型)
# gunner_female/paramedic/6bdcefb90e5e4387d4faa3633b4b587c
# 944b9aab492c15a8474f96947ceeb9e4/6bdcefb90e5e4387d4faa3633b4b587c
class Skill38(PassiveSkill):
    """
    重霄·协战师的战斗服， 不仅具备顶尖的战斗功能， 还兼顾了外出旅行的需求。\n
        进入地下城时， 重霄·协战师的战斗服外形将会改变。
    """
    name = "系统常量 · 战斗服 (改良型)"
    learnLv = 95
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 3
    uuid = "6bdcefb90e5e4387d4faa3633b4b587c"
    hasVP = False
    hasUP = False


# 系统 · 临战编程
# gunner_female/paramedic/5fed75723a5d5d373c9f54fba1c7dc06
# 944b9aab492c15a8474f96947ceeb9e4/5fed75723a5d5d373c9f54fba1c7dc06
class Skill39(PassiveBufferSkill):
    """
    在瞬息万变的战场， 重霄·协战师面对危急状况时， 常常临时起意修改战术程序。 这些令人胆寒的代码， 连编制者本人都不敢执行。 在未来的战斗中， 这些程序或许还将不断修改。\n
        提升重霄·协战师的基本攻击力、 转职技能攻击力和精神， 部分技能在程序修改后会进一步强化。\n
        [战服 · 机动打击] : 施放后即刻发动第二击。\n
        [近战 · 闪退射击] : 施放后立即为队员提供强化后的[保护模件 (缓冲)]效果。
    """
    name = "系统 · 临战编程"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "5fed75723a5d5d373c9f54fba1c7dc06"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 精神增加 : {value1}
    # REMOVE: data1 = [0, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290, 300, 310, 320, 330, 340, 350, 360, 370, 380, 390, 400, 410, 420, 430, 440, 450, 460, 470, 480, 490, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600, 610, 620, 630, 640, 650]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    Spirit = data1
    associate = [{"data": data1,"type": "$+Spirit","ratio":1}]  # type: ignore

# 系统 · 孤军突破
# gunner_female/paramedic/56ef36c1980e67dd2bb50b180a925b89
# 944b9aab492c15a8474f96947ceeb9e4/56ef36c1980e67dd2bb50b180a925b89
class Skill40(ActiveSkill):
    """
    작전 중 다양한 요인으로, 적으로 둘러싸인 경우. 진(眞) 패러메딕은 즉시 천계군 사령부에 연락을 취한 뒤 전장 상공에 수집 중인 APIUS를 불러들여 돌파 프로세스를 시행한다.\n
    결합 된 APIUS는 수집된 정보를 계산하여 1회 소모 가능한 전장 정보를 지급한다. 이후 고립부 지역의 적 정보를 산출한 뒤 에너지를 방출하여 주변 적들에게 피해를 입힌다.\n
    승인 대기 중인 상태에서 받는 모든 피해는 막거나 피해낸다.
    """
    name = "系统 · 孤军突破"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1336, 5493]
    uuid = "56ef36c1980e67dd2bb50b180a925b89"
    hasVP = False
    hasUP = False

    # 폭발 공격력 : {value1} X {value2}
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 타격 당 정보 습득률 : 40%
    # [범위 정보]
    # 폭발 범위 : {value3}%
    # data3 = None # TOCHECK    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 空袭策略 : 神兵天降
# gunner_female/paramedic/d40a932ac818bf4fa044dc1e4f8b2708
# 944b9aab492c15a8474f96947ceeb9e4/d40a932ac818bf4fa044dc1e4f8b2708
class Skill41(ActiveBufferSkill):
    """
    从交战区域上空俯冲而下， 执行超高空速降程序。\n
        重霄·协战师抵达交战区域上空， 为队员们提供强化效果， 随后倾尽全力发动强袭歼灭行动。\n
        增益效果根据[强袭策略 : 区域肃清]的一定比率生效。\n
        强袭流程会根据关联的觉醒技能而变化。\n
    选择[强袭策略 : 区域肃清]时 :\n
        为队员们提供持续一段时间的增益效果。\n
    选择[绝境策略 : 极限歼灭]时 :\n
        提供[强袭策略 : 区域肃清]增益效果和可重复生效的增益效果。 强袭前预输入[强袭策略 : 区域肃清]技能， 可无需施放动作直接施放； 通过预输入施放时， [强袭策略 : 区域肃清]的攻击力将以一定比率合算至[空袭策略 : 神兵天降]的激光攻击力中。\n
        2种关联均适用同步化流程。\n
        [三次觉醒技能]\n
        施放三次觉醒技能时， 与关联技能共享冷却时间。\n
        若关联技能还在冷却中， 则无法施放三次觉醒技能。
    """
    name = "空袭策略 : 神兵天降"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [3258, 13402]
    uuid = "d40a932ac818bf4fa044dc1e4f8b2708"
    hasVP = False
    hasUP = False
    buffType = 'awakeSub'

    # 激光多段攻击力 : {value0} X {value1}
    # REMOVE: data0 = [0, 37544, 46249, 54955, 63661, 72367, 81073, 89778, 98484, 107190, 115896, 124601, 133307, 142013, 150719, 159424, 168130, 176836, 185542, 194248, 202953, 211659, 220365, 229071, 237776, 246482, 255188, 263894, 272600, 281305, 290011, 298717, 307423, 316128, 324834, 333540, 342246, 350952, 359657, 368363, 377069, 385775, 394480, 403186, 411892, 420598, 429303, 438009, 446715, 455421, 464127]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 连锁爆炸多段攻击力 : {value2} X {value3}
    # REMOVE: data2 = [0, 25029, 30833, 36637, 42441, 48244, 54048, 59852, 65656, 71460, 77264, 83068, 88871, 94675, 100479, 106283, 112087, 117891, 123695, 129498, 135302, 141106, 146910, 152714, 158518, 164321, 170125, 175929, 181733, 187537, 193341, 199145, 204948, 210752, 216556, 222360, 228164, 233968, 239772, 245575, 251379, 257183, 262987, 268791, 274595, 280398, 286202, 292006, 297810, 303614, 309418]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 选择[强袭策略 ： 区域肃清]时效果
    # 力量/智力增加 : [强袭策略 ： 区域肃清]的{value4}%
    # REMOVE: data4 = [0, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 攻击/移动速度增加 : [强袭策略 ： 区域肃清]的{value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 效果持续时间 : {value6}秒
    # REMOVE: data6 = [0, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43, 43]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 选择[绝境策略 ： 极限歼灭]时效果
    # 力量/智力增加 : [强袭策略 ： 区域肃清]的{value7}%
    # REMOVE: data7 = [0, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 效果持续时间 : {value8}秒
    # REMOVE: data8 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 预输入[强袭策略 ： 区域肃清]时攻击力合算比率 : {value9}%
    # REMOVE: data9 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)


    def skillInfo(self):
        """技能信息"""
        prep = self.char.AwakeSkill.skillInfo()
        ratio = 0
        # 绑定一觉时，替代一觉
        if self.char.bindAwake == 50:
            ratio = self.data4[self.lv] / 100
        if self.char.bindAwake == 85:
            ratio = self.data7[self.lv] / 100
        return prep[0] * ratio, [prep[1][0]*ratio,prep[1][1],prep[1][2]*ratio], [prep[2][0]*ratio,prep[2][1],prep[2][2]*ratio],0,self.getSkillCD()

class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'paramedic'
        self.nameCN = '重霄·协战师'
        self.role = 'gunner_female'
        self.角色 = '神枪手(女)'
        self.职业 = '协战师'
        self.jobId = '944b9aab492c15a8474f96947ceeb9e4'
        self.jobGrowId = '92da05ec93fb43406e193ffb9a2a629b'

        self.武器选项 = ['手弩', '步枪','左轮枪','自动手枪','手炮'] # TODO
        self.输出类型选项 = ["魔法固伤"] # TODO
        self.输出类型 = '魔法固伤' # TODO
        self.防具精通属性 = ['精神'] # TODO
        self.防具类型 = '板甲'
        self.buff = ... # TODO

        self.buffer = True

        self.适用属性 = '精神'

        super().__init__(equVersion, __name__)

    def load_skills(self):
        super().load_skills()
        for skill in self.skills:
            if skill.buffer and skill.buffType == 'buff' and skill.learnLv == 30:
                self.BuffSkill = skill
            if skill.buffer and skill.buffType == 'awake':
                self.AwakeSkill = skill
