#0ee8fa5dc525c1a1f23fc6911e921e4a
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "knight/paladin/cn/skillDetail"


# 盾击
# knight/paladin/717f1e2104fe4b796f800352fa143ecc
# 0ee8fa5dc525c1a1f23fc6911e921e4a/717f1e2104fe4b796f800352fa143ecc
class Skill6(ActiveSkill):
    """
        挥舞盾牌对敌人进行强力攻击， 并使其进入眩晕状态。\n
        追加操作时可以提起盾牌向前突进。\n
        [厚重的盾牌本身就是一件强大的武器。 但如果你没有足够的力量的话还是放弃这个想法吧。]
    """
    name = "盾击"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 3
    mp = [5, 180]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 挥击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1337, 1472, 1608, 1743, 1879, 2014, 2150, 2286, 2421, 2557, 2692, 2828, 2964, 3099, 3235, 3370, 3506, 3641, 3777, 3913, 4048, 4184, 4319, 4455, 4591, 4726, 4862, 4997, 5133, 5269, 5404, 5540, 5675, 5811, 5946, 6082, 6218, 6353, 6489, 6624, 6760, 6896, 7031, 7167, 7302, 7438, 7574, 7709, 7845, 7980, 8116, 8251, 8387, 8523, 8658, 8794, 8929, 9065, 9201, 9336, 9472, 9607, 9743, 9878, 10014, 10150, 10285, 10421, 10556, 10692]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 眩晕几率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 眩晕持续时间 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 追加操作时突进攻击力 : {value3}%
    # REMOVE: data3 = [0, 1337, 1472, 1608, 1743, 1879, 2014, 2150, 2286, 2421, 2557, 2692, 2828, 2964, 3099, 3235, 3370, 3506, 3641, 3777, 3913, 4048, 4184, 4319, 4455, 4591, 4726, 4862, 4997, 5133, 5269, 5404, 5540, 5675, 5811, 5946, 6082, 6218, 6353, 6489, 6624, 6760, 6896, 7031, 7167, 7302, 7438, 7574, 7709, 7845, 7980, 8116, 8251, 8387, 8523, 8658, 8794, 8929, 9065, 9201, 9336, 9472, 9607, 9743, 9878, 10014, 10150, 10285, 10421, 10556, 10692]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1


# 天使降临
# knight/paladin/2a0a39184de92acf1c1375e00b77404c
# 0ee8fa5dc525c1a1f23fc6911e921e4a/2a0a39184de92acf1c1375e00b77404c
class Skill15(PassiveSkill):
    """
        将天界之光降临到武器和盾牌上， 对武器赋予光属性。 同时， 帕拉丁的战斗动作发生变化并增加物理攻击力。 盾牌朝前方时， 受到攻击时不会倒地， 同时增加物理/魔法防御力。\n
        防御成功时进入霸体状态， 效果持续一定时间。\n
        被攻击增加的防御力在施放[圣盾]、 [神光庇护]时不适用。\n
        在决斗场中， 不适用前方防御和光属性赋予功能。
    """
    name = "天使降临"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "2a0a39184de92acf1c1375e00b77404c"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理/魔法防御力增加 : {value0}
    # REMOVE: data0 = [0, 6520, 7244, 7969, 8693, 9418, 10142, 10867, 11591, 12316, 13040, 13764, 14489, 15213, 15938, 16662, 17387, 18111, 18836, 19560, 20284]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 物理攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 霸体持续时间 : {value2}秒
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    associate = [{"data":data1,"type":"$*PAtkP"}]

# 天使光翼
# knight/paladin/9dc8438e4572d39243c97da31c113acc
# 0ee8fa5dc525c1a1f23fc6911e921e4a/9dc8438e4572d39243c97da31c113acc
class Skill16(PassiveSkill):
    """
        增加攻击力， 并减少技能冷却时间， 但1、 2、 3次觉醒技能除外。 同时， 自身受到的有形或无形的威胁吸收为光翼形态的能量， 然后消耗能量对自身和队友施加各种效果。\n
    [获得天使之翼]\n
    - 天使之翼攻击成功时\n
    - \n
    - 地图上有被[神光冲击]击中的敌人且自身处于防御状态时\n
    [效果发动方式]\n
    - 施放技能时， 按住技能键一定时间， 可以将天使光翼的能量注入技能并发动效果。\n
    [发动的效果]\n
    - [神光冲击] : 将敌人吸附到攻击地点。 此时， 根据消耗资源的阶段， 增加吸附范围。\n
    - 转职后攻击技能 : 触发增益效果， 增加自身和队友的攻击速度、 移动速度、 施放速度、 暴击率和命中率。 根据消耗资源的阶段， 增加增益效果持续时间。\n
    - [神光庇护] : 新增恢复自身和圣域内队友生命值的效果。 根据消耗资源的阶段， 增加生命值恢复量。\n
    [学习戒律后]\n
        进入地下城时， 天使光翼获得量增加2个。\n
    [学习荣耀之光后]\n
    - 进入地下城时， 天使光翼获得量增加4个。\n
    [学习超越之翼后]\n
    - 进入地下城时， 天使光翼获得量增加2个。 额外增加2个光翼， 最多可以拥有8个光翼。 在拥有7个及以上光翼的状态下， 发动[天使光翼]时， 效果中增加减少队友所受伤害的功能。\n
    (所受伤害减少效果不与[圣盾]、 [神光庇护]的伤害减少效果叠加)
    """
    name = "天使光翼"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    uuid = "9dc8438e4572d39243c97da31c113acc"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 技能冷却时间减少率 : {value1}%
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [吸附范围]
    # 第1阶段 : {value2}px
    # REMOVE: data2 = [0, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42, 42]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 第2阶段 : {value3}px
    # REMOVE: data3 = [0, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52, 52]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 第3阶段 : {value4}px
    # REMOVE: data4 = [0, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 第4阶段 : {value5}px
    # REMOVE: data5 = [0, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104, 104]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 第5阶段 : {value6}px
    # REMOVE: data6 = [0, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167, 167]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 第6阶段 : {value7}px
    # REMOVE: data7 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [效果]
    # 攻击速度增加 : {value8}%
    # REMOVE: data8 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 移动速度增加 : {value9}%
    # REMOVE: data9 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 施放速度增加 : {value10}%
    # REMOVE: data10 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 暴击率增加 : {value11}%
    # REMOVE: data11 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 命中率增加 : {value12}%
    # REMOVE: data12 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 队友攻击速度增加 : {value13}%
    # REMOVE: data13 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)
    # 队友移动速度增加 : {value14}%
    # REMOVE: data14 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14)
    # 队友施放速度增加 : {value15}%
    # REMOVE: data15 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15)
    # 队友暴击率增加 : {value16}%
    # REMOVE: data16 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data16 = get_data(f'{prefix}/{uuid}', 16)
    # 队友命中率增加 : {value17}%
    # REMOVE: data17 = [0, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data17 = get_data(f'{prefix}/{uuid}', 17)
    # [效果持续时间]
    # 第1阶段 : {value18}秒
    # REMOVE: data18 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data18 = get_data(f'{prefix}/{uuid}', 18)
    # 第2阶段 : {value19}秒
    # REMOVE: data19 = [0, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5, 12.5]# noqa: E501
    data19 = get_data(f'{prefix}/{uuid}', 19)
    # 第3阶段 : {value20}秒
    # REMOVE: data20 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data20 = get_data(f'{prefix}/{uuid}', 20)
    # 第4阶段 : {value21}秒
    # REMOVE: data21 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data21 = get_data(f'{prefix}/{uuid}', 21)
    # 第5阶段 : {value22}秒
    # REMOVE: data22 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data22 = get_data(f'{prefix}/{uuid}', 22)
    # 第6阶段 : {value23}秒
    # REMOVE: data23 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data23 = get_data(f'{prefix}/{uuid}', 23)
    # [每秒生命值恢复率]
    # 第1阶段 : {value24}%
    # REMOVE: data24 = [0, 3.3, 6.6, 10, 13.3, 16.7, 20, 23.3, 26.7, 30, 33.4, 36.7, 40, 43.4, 46.7, 50.1, 53.4, 56.7, 60.1, 63.4, 66.8]# noqa: E501
    data24 = get_data(f'{prefix}/{uuid}', 24)
    # 第2阶段 : {value25}%
    # REMOVE: data25 = [0, 4.1, 8.3, 12.5, 16.6, 20.8, 25, 29.1, 33.3, 37.5, 41.6, 45.8, 50, 54.2, 58.3, 62.5, 66.7, 70.8, 75, 79.2, 83.3]# noqa: E501
    data25 = get_data(f'{prefix}/{uuid}', 25)
    # 第3阶段 : {value26}%
    # REMOVE: data26 = [0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100]# noqa: E501
    data26 = get_data(f'{prefix}/{uuid}', 26)
    # 第4阶段 : {value27}%
    # REMOVE: data27 = [0, 8.3, 16.6, 25, 33.3, 41.6, 50, 58.3, 66.7, 75, 83.3, 91.7, 100, 108.4, 116.7, 125.1, 133.4, 141.7, 150.1, 158.4, 166.7]# noqa: E501
    data27 = get_data(f'{prefix}/{uuid}', 27)
    # 第5阶段 : {value28}%
    # REMOVE: data28 = [0, 13.3, 26.6, 40, 53.3, 66.7, 80, 93.3, 106.7, 120, 133.4, 146.7, 160, 173.4, 186.7, 200.1, 213.4, 226.7, 240.1, 253.4, 266.8]# noqa: E501
    data28 = get_data(f'{prefix}/{uuid}', 28)
    # 第6阶段 : {value29}%
    # REMOVE: data29 = [0, 20, 40, 60, 80, 100, 120, 140, 160, 180, 200, 220, 240, 260, 280, 300, 320, 340, 360, 380, 400]# noqa: E501
    data29 = get_data(f'{prefix}/{uuid}', 29)
    # [神圣意志 : 大天使降临]生命值恢复效率 : {value30}%
    # REMOVE: data30 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data30 = get_data(f'{prefix}/{uuid}', 30)
    # [队友所受伤害减少率]
    # 拥有7个天使光翼时 : 5%
    # 拥有8个天使光翼时 : 10%

    associate = [{"data":data0,"type":"$*PAtkP"},{"data":data1,"type":"*cdReduce"}]

# 神光冲击
# knight/paladin/3fb8395ae3b81bd608e0c4223a8eb534
# 0ee8fa5dc525c1a1f23fc6911e921e4a/3fb8395ae3b81bd608e0c4223a8eb534
class Skill17(ActiveSkill):
    """
        用武器捶打地面， 震荡起神光波纹。\n
        [神光冲击]攻击成功时， 可以获得少量天使光翼， 同时被击中的敌人会进入被挑衅状态， 集中攻击施放者。
    """
    name = "神光冲击"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 4
    mp = [30, 300]
    uuid = "3fb8395ae3b81bd608e0c4223a8eb534"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 7376, 8124, 8873, 9621, 10369, 11117, 11866, 12614, 13362, 14111, 14859, 15607, 16355, 17104, 17852, 18600, 19349, 20097, 20845, 21594, 22342, 23090, 23838, 24587, 25335, 26083, 26832, 27580, 28328, 29076, 29825, 30573, 31321, 32070, 32818, 33566, 34314, 35063, 35811, 36559, 37308, 38056, 38804, 39552, 40301, 41049, 41797, 42546, 43294, 44042, 44790, 45539, 46287, 47035, 47784, 48532, 49280, 50029, 50777, 51525, 52273, 53022, 53770, 54518, 55267, 56015, 56763, 57511, 58260, 59008]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 挑衅持续时间 : {value1}秒
    # REMOVE: data1 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击成功时天使光翼获得量 : {value2}
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 神光连击
# knight/paladin/5806440d21e7546d50007a5ba11f8024
# 0ee8fa5dc525c1a1f23fc6911e921e4a/5806440d21e7546d50007a5ba11f8024
class Skill18(ActiveSkill):
    """
        左右挥舞光之武器攻击敌人。\n
        按向前方向键， 可以向前移动并进行攻击。
    """
    name = "神光连击"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 300]
    uuid = "5806440d21e7546d50007a5ba11f8024"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 第1击攻击力 : {value0}%
    # REMOVE: data0 = [0, 5230, 5760, 6291, 6821, 7352, 7882, 8413, 8943, 9474, 10004, 10535, 11065, 11596, 12126, 12657, 13187, 13718, 14248, 14779, 15310, 15840, 16371, 16901, 17432, 17962, 18493, 19023, 19554, 20084, 20615, 21145, 21676, 22206, 22737, 23267, 23798, 24329, 24859, 25390, 25920, 26451, 26981, 27512, 28042, 28573, 29103, 29634, 30164, 30695, 31225, 31756, 32286, 32817, 33348, 33878, 34409, 34939, 35470, 36000, 36531, 37061, 37592, 38122, 38653, 39183, 39714, 40244, 40775, 41305, 41836]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 第2击攻击力 : {value1}%
    # REMOVE: data1 = [0, 5230, 5760, 6291, 6821, 7352, 7882, 8413, 8943, 9474, 10004, 10535, 11065, 11596, 12126, 12657, 13187, 13718, 14248, 14779, 15310, 15840, 16371, 16901, 17432, 17962, 18493, 19023, 19554, 20084, 20615, 21145, 21676, 22206, 22737, 23267, 23798, 24329, 24859, 25390, 25920, 26451, 26981, 27512, 28042, 28573, 29103, 29634, 30164, 30695, 31225, 31756, 32286, 32817, 33348, 33878, 34409, 34939, 35470, 36000, 36531, 37061, 37592, 38122, 38653, 39183, 39714, 40244, 40775, 41305, 41836]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 圣盾
# knight/paladin/d429147c372b549c3dadcabcba50787f
# 0ee8fa5dc525c1a1f23fc6911e921e4a/d429147c372b549c3dadcabcba50787f
class Skill19(ActiveSkill):
    """
        将光之力集中到盾牌上， 抵御一切攻击。\n
        施放技能后， 如果继续按住技能键， 可以维持圣盾状态， 在圣盾状态下受到攻击时不会倒地， 同时大幅减少所受伤害， 免疫眩晕、 石化、 冻结和睡眠异常状态， 并且可以进行移动和短距离的前后冲刺。\n
        防御成功时进入霸体状态， 效果持续一定时间。 在正确的时机防御成功时， 使伤害完全无效， 且天使光翼汲取到最大值\n
        在决斗场中， 防御成功时不进入霸体状态、 不适用伤害无效功能， 且圣盾持续时间上限为3秒。
    """
    name = "圣盾"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 2
    cd = 3
    mp = [80, 800]
    uuid = "d429147c372b549c3dadcabcba50787f"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 所受伤害减少率 : {value0}%
    # REMOVE: data0 = [0, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 霸体持续时间 : {value1}秒
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 圣盾突击
# knight/paladin/7ec521d063d2190e1fcc5bd229af9bcf
# 0ee8fa5dc525c1a1f23fc6911e921e4a/7ec521d063d2190e1fcc5bd229af9bcf
class Skill20(ActiveSkill):
    """
        将光之力集中到盾牌上， 向前突进。\n
        圣盾会击退路径上的敌人， 对敌人造成多段攻击伤害。\n
        在决斗场中， 突进攻击无法击退霸体状态的敌人。
    """
    name = "圣盾突击"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 6
    mp = [40, 400]
    uuid = "7ec521d063d2190e1fcc5bd229af9bcf"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 3014, 3319, 3625, 3931, 4237, 4542, 4848, 5154, 5460, 5765, 6071, 6377, 6683, 6988, 7294, 7600, 7906, 8211, 8517, 8823, 9129, 9434, 9740, 10046, 10352, 10657, 10963, 11269, 11575, 11880, 12186, 12492, 12798, 13103, 13409, 13715, 14020, 14326, 14632, 14938, 15243, 15549, 15855, 16161, 16466, 16772, 17078, 17384, 17689, 17995, 18301, 18607, 18912, 19218, 19524, 19830, 20135, 20441, 20747, 21053, 21358, 21664, 21970, 22276, 22581, 22887, 23193, 23499, 23804, 24110]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 4
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)


# 神光喷涌
# knight/paladin/0113c8b1306ca76d208f83f2d093dd62
# 0ee8fa5dc525c1a1f23fc6911e921e4a/0113c8b1306ca76d208f83f2d093dd62
class Skill22(ActiveSkill):
    """
        将光之力集中到武器上， 然后用武器锤击地面， 喷涌神光。\n
        神光向垂直方向喷涌， 造成多段攻击伤害。\n
        按向前方向键， 可以向前移动并进行攻击。\n
    [学习超越之翼后]\n
        基本攻击变更为3次， 原来的上挑攻击力并入锤击攻击力中。\n
        锤击攻击时， 发动小型神光喷涌， 对敌人造成多段攻击伤害。\n
        小型神光喷涌的攻击力以[神光喷涌]攻击力的一定比率适用。
    """
    name = "神光喷涌"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 8
    mp = [50, 500]
    uuid = "0113c8b1306ca76d208f83f2d093dd62"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 锤击攻击力 : {value0}%
    # REMOVE: data0 = [0, 3809, 4195, 4582, 4968, 5354, 5741, 6127, 6514, 6900, 7286, 7673, 8059, 8446, 8832, 9218, 9605, 9991, 10378, 10764, 11150, 11537, 11923, 12310, 12696, 13082, 13469, 13855, 14242, 14628, 15014, 15401, 15787, 16174, 16560, 16946, 17333, 17719, 18106, 18492, 18878, 19265, 19651, 20038, 20424, 20810, 21197, 21583, 21970, 22356, 22742, 23129, 23515, 23902, 24288, 24674, 25061, 25447, 25834, 26220, 26606, 26993, 27379, 27766, 28152, 28538, 28925, 29311, 29698, 30084, 30470]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 喷涌的神光攻击力 : {value1}%
    # REMOVE: data1 = [0, 3809, 4195, 4582, 4968, 5354, 5741, 6127, 6514, 6900, 7286, 7673, 8059, 8446, 8832, 9218, 9605, 9991, 10378, 10764, 11150, 11537, 11923, 12310, 12696, 13082, 13469, 13855, 14242, 14628, 15014, 15401, 15787, 16174, 16560, 16946, 17333, 17719, 18106, 18492, 18878, 19265, 19651, 20038, 20424, 20810, 21197, 21583, 21970, 22356, 22742, 23129, 23515, 23902, 24288, 24674, 25061, 25447, 25834, 26220, 26606, 26993, 27379, 27766, 28152, 28538, 28925, 29311, 29698, 30084, 30470]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 4
    # 喷涌的神光多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 神光喷涌范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 信仰之念
# knight/paladin/8b08f9504167a9c0f3a1d29d71b7943e
# 0ee8fa5dc525c1a1f23fc6911e921e4a/8b08f9504167a9c0f3a1d29d71b7943e
class Skill23(ActiveSkill):
    """
        爆发光之力， 强化自身的基本攻击力和技能攻击力。
    """
    name = "信仰之念"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 7 #TODO
    rangeLv = 3
    cd = 5
    uuid = "8b08f9504167a9c0f3a1d29d71b7943e"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 神光盾击
# knight/paladin/ac21c02567f04a92b54dd85c091d1e5a
# 0ee8fa5dc525c1a1f23fc6911e921e4a/ac21c02567f04a92b54dd85c091d1e5a
class Skill24(ActiveSkill):
    """
        将光之力集中到盾牌上， 然后朝地面挥动盾牌， 释放光之力。\n
        被击中的敌人会旋转飞出。
    """
    name = "神光盾击"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 8
    mp = [60, 600]
    uuid = "ac21c02567f04a92b54dd85c091d1e5a"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 第1击攻击力 : {value0}%
    # REMOVE: data0 = [0, 3452, 3802, 4152, 4502, 4852, 5203, 5553, 5903, 6253, 6603, 6953, 7304, 7654, 8004, 8354, 8704, 9054, 9405, 9755, 10105, 10455, 10805, 11156, 11506, 11856, 12206, 12556, 12906, 13257, 13607, 13957, 14307, 14657, 15007, 15358, 15708, 16058, 16408, 16758, 17108, 17459, 17809, 18159, 18509, 18859, 19209, 19560, 19910, 20260, 20610, 20960, 21311, 21661, 22011, 22361, 22711, 23061, 23412, 23762, 24112, 24462, 24812, 25162, 25513, 25863, 26213, 26563, 26913, 27263, 27614]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 第1击多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 第2击攻击力 : {value2}%
    # REMOVE: data2 = [0, 3543, 3902, 4261, 4621, 4980, 5340, 5699, 6058, 6418, 6777, 7137, 7496, 7855, 8215, 8574, 8934, 9293, 9652, 10012, 10371, 10731, 11090, 11449, 11809, 12168, 12528, 12887, 13246, 13606, 13965, 14325, 14684, 15043, 15403, 15762, 16122, 16481, 16840, 17200, 17559, 17919, 18278, 18637, 18997, 19356, 19716, 20075, 20434, 20794, 21153, 21512, 21872, 22231, 22591, 22950, 23309, 23669, 24028, 24388, 24747, 25106, 25466, 25825, 26185, 26544, 26903, 27263, 27622, 27982, 28341]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 第2击多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 神光释放范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 烈光
# knight/paladin/82fc7ec7cfb2b7afa8c125a2d9420a78
# 0ee8fa5dc525c1a1f23fc6911e921e4a/82fc7ec7cfb2b7afa8c125a2d9420a78
class Skill25(ActiveSkill):
    """
        将光之力集中到武器上， 从下往上挑击， 使敌人浮空， 然后用盾牌将其砸向地面。\n
        被盾牌击中的敌人会砸到地面后再弹起。
    """
    name = "烈光"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 8
    mp = [60, 600]
    uuid = "82fc7ec7cfb2b7afa8c125a2d9420a78"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 上挑攻击力 : {value0}%
    # REMOVE: data0 = [0, 10744, 11834, 12924, 14014, 15104, 16194, 17284, 18374, 19464, 20554, 21644, 22734, 23824, 24914, 26004, 27094, 28184, 29274, 30364, 31454, 32544, 33634, 34724, 35814, 36904, 37994, 39084, 40174, 41264, 42354, 43444, 44534, 45624, 46714, 47804, 48894, 49984, 51074, 52164, 53254, 54344, 55434, 56524, 57614, 58704, 59794, 60884, 61974, 63064, 64154, 65244, 66334, 67424, 68514, 69604, 70694, 71784, 72874, 73964, 75054, 76144, 77234, 78324, 79414, 80504, 81594, 82684, 83774, 84864, 85954]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 下砸攻击力 : {value1}%
    # REMOVE: data1 = [0, 10779, 11872, 12966, 14059, 15153, 16246, 17340, 18433, 19527, 20620, 21714, 22807, 23901, 24994, 26088, 27181, 28275, 29368, 30462, 31555, 32649, 33742, 34836, 35929, 37023, 38116, 39210, 40303, 41397, 42490, 43584, 44677, 45770, 46864, 47957, 49051, 50144, 51238, 52331, 53425, 54518, 55612, 56705, 57799, 58892, 59986, 61079, 62173, 63266, 64360, 65453, 66547, 67640, 68734, 69827, 70921, 72014, 73108, 74201, 75295, 76388, 77482, 78575, 79669, 80762, 81856, 82949, 84043, 85136, 86230]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 神光闪耀
# knight/paladin/ab6fc3303df03b58911967dfca2b5d07
# 0ee8fa5dc525c1a1f23fc6911e921e4a/ab6fc3303df03b58911967dfca2b5d07
class Skill26(ActiveSkill):
    """
        将光之力集中到武器上， 然后释放神光能量， 对周围的敌人造成多段攻击伤害。\n
        技能施放过程中， 按跳跃键可以立即发动最后一击。\n
        按向前方向键， 可以向前移动并进行攻击。
    """
    name = "神光闪耀"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 1 #TODO
    rangeLv = 2
    cube = 1
    cd = 16
    mp = [70, 700]
    uuid = "ab6fc3303df03b58911967dfca2b5d07"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 2237, 2464, 2691, 2917, 3144, 3371, 3598, 3825, 4052, 4279, 4506, 4733, 4960, 5187, 5413, 5640, 5867, 6094, 6321, 6548, 6775, 7002, 7229, 7456, 7683, 7909, 8136, 8363, 8590, 8817, 9044, 9271, 9498, 9725, 9952, 10179, 10405, 10632, 10859, 11086, 11313, 11540, 11767, 11994, 12221, 12448, 12675, 12901, 13128, 13355, 13582, 13809, 14036, 14263, 14490, 14717, 14944, 15171, 15398, 15624, 15851, 16078, 16305, 16532, 16759, 16986, 17213, 17440, 17667, 17894]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 9604, 10578, 11553, 12527, 13501, 14476, 15450, 16424, 17399, 18373, 19347, 20322, 21296, 22270, 23245, 24219, 25193, 26168, 27142, 28116, 29091, 30065, 31039, 32014, 32988, 33962, 34937, 35911, 36885, 37860, 38834, 39808, 40783, 41757, 42731, 43706, 44680, 45654, 46629, 47603, 48577, 49552, 50526, 51500, 52475, 53449, 54423, 55397, 56372, 57346, 58320, 59295, 60269, 61243, 62218, 63192, 64166, 65141, 66115, 67089, 68064, 69038, 70012, 70987, 71961, 72935, 73910, 74884, 75858, 76833]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [神光闪耀]\n
        攻击过程中可以移动和前冲\n
        攻击范围 +40%
        """
        ...

    def vp_2(self):
        """
        [神光闪耀]\n
        施放过程中所受伤害 -70%\n
        可以解除控制型异常状态并施放； 施放中免疫所有异常状态
        """
        ...

# 神光闪影击
# knight/paladin/c91a62dc0a18360acf5031ac0ebf09f5
# 0ee8fa5dc525c1a1f23fc6911e921e4a/c91a62dc0a18360acf5031ac0ebf09f5
class Skill27(ActiveSkill):
    """
        将集中到武器上的光之力向正面射出， 对敌人造成多段攻击伤害， 然后挥动盾牌发射光之冲击波， 发动最后一击。\n
        按向前方向键， 可以短距离向前移动并进行攻击。 最后一击前按向后方向键， 可以在原地发动最后一击。
    """
    name = "神光闪影击"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [70, 700]
    uuid = "c91a62dc0a18360acf5031ac0ebf09f5"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 2625, 2892, 3158, 3424, 3690, 3957, 4223, 4489, 4756, 5022, 5288, 5555, 5821, 6087, 6354, 6620, 6886, 7153, 7419, 7685, 7952, 8218, 8484, 8751, 9017, 9283, 9550, 9816, 10082, 10349, 10615, 10881, 11148, 11414, 11680, 11947, 12213, 12479, 12745, 13012, 13278, 13544, 13811, 14077, 14343, 14610, 14876, 15142, 15409, 15675, 15941, 16208, 16474, 16740, 17007, 17273, 17539, 17806, 18072, 18338, 18605, 18871, 19137, 19404, 19670, 19936, 20203, 20469, 20735, 21002]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 11635, 12815, 13996, 15176, 16357, 17537, 18717, 19898, 21078, 22258, 23439, 24619, 25800, 26980, 28160, 29341, 30521, 31701, 32882, 34062, 35243, 36423, 37603, 38784, 39964, 41144, 42325, 43505, 44686, 45866, 47046, 48227, 49407, 50587, 51768, 52948, 54128, 55309, 56489, 57670, 58850, 60030, 61211, 62391, 63571, 64752, 65932, 67113, 68293, 69473, 70654, 71834, 73014, 74195, 75375, 76556, 77736, 78916, 80097, 81277, 82457, 83638, 84818, 85999, 87179, 88359, 89540, 90720, 91900, 93081]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [神光闪影击]\n
        被光束命中的敌人将被移动到帕拉丁面前\n
        最后一击命中的敌人将被赋予眩晕异常状态\n
         - 眩晕几率 : 100% \n
         - 持续时间 : 3秒\n
        攻击范围 +70%
        """
        ...

    def vp_2(self):
        """
        [神光闪影击]\n
        删除光束攻击， 突进一小段距离后立即发动最后一击\n
         - 总攻击力相同\n
        [圣盾突击]\n
        可以强制中断[圣盾突击]的施放后僵直并施放该技能， 或强制中断此技能的施放后僵直并施放[圣盾突击]
        """
        ...

# 惩罚之锤
# knight/paladin/0c3a468aee1f7ce06bf91eb3319518c1
# 0ee8fa5dc525c1a1f23fc6911e921e4a/0c3a468aee1f7ce06bf91eb3319518c1
class Skill28(ActiveSkill):
    """
        垂直掉落由光凝聚而成的惩罚之锤， 引发爆炸， 对范围内的敌人造成伤害。
    """
    name = "惩罚之锤"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [80, 800]
    uuid = "0c3a468aee1f7ce06bf91eb3319518c1"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 46087, 50762, 55438, 60113, 64789, 69464, 74140, 78815, 83491, 88166, 92842, 97517, 102193, 106868, 111544, 116219, 120895, 125570, 130246, 134921, 139597, 144272, 148948, 153623, 158299, 162974, 167650, 172325, 177001, 181676, 186352, 191027, 195703, 200378, 205054, 209729, 214405, 219080, 223756, 228431, 233107, 237782, 242458, 247133, 251809, 256484, 261160, 265835, 270511, 275186, 279862, 284537, 289213, 293888, 298564, 303239, 307915, 312590, 317266, 321941, 326617, 331292, 335968, 340643, 345319, 349994, 354670, 359345, 364021, 368696]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [惩罚之锤]\n
        对周围600px内最强敌人落下审判之锤\n
        使命中的敌人进入眩晕异常状态\n
         - 眩晕几率 : 100% \n
         - 持续时间 : 3秒\n
        攻击范围 +40%
        """
        ...

    def vp_2(self):
        """
        [惩罚之锤]\n
        转职技能施放过程中也可以施放 (觉醒技能除外)\n
         - 删除施放动作\n
        被圣光之力强化的锤子发生爆炸， 使自身和周围队员的生命值/魔法值恢复10%
        """
        ...

# 神光之跃
# knight/paladin/5cac3411ccef1af333953e0ded5e942d
# 0ee8fa5dc525c1a1f23fc6911e921e4a/5cac3411ccef1af333953e0ded5e942d
class Skill29(ActiveSkill):
    """
        将光之力集中到武器上， 然后跳向前方锤击地面， 引发爆炸， 对范围内的敌人造成伤害。\n
        按前方向键， 可以跳得更远。
    """
    name = "神光之跃"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [90, 900]
    uuid = "5cac3411ccef1af333953e0ded5e942d"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 82648, 91033, 99417, 107802, 116186, 124571, 132955, 141340, 149725, 158109, 166494, 174878, 183263, 191648, 200032, 208417, 216801, 225186, 233570, 241955, 250340, 258724, 267109, 275493, 283878, 292262, 300647, 309032, 317416, 325801, 334185, 342570, 350955, 359339, 367724, 376108, 384493, 392877, 401262, 409647, 418031, 426416, 434800, 443185, 451570, 459954, 468339, 476723, 485108, 493492, 501877, 510262, 518646, 527031, 535415, 543800, 552184, 560569, 568954, 577338, 585723, 594107, 602492, 610877, 619261, 627646, 636030, 644415, 652799, 661184]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [神光之跃]\n
        施放技能时进入无敌状态\n
        大幅增加跳跃高度\n
        攻击范围 +30%
        """
        ...

    def vp_2(self):
        """
        [神光之跃]\n
        生成审判之锤砸向前方\n
         - 可以强制中断转职技能的施放后僵直并施放该技能 (觉醒技能除外)\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 22.5秒\n
         - 单次攻击力 -50%
        """
        ...

# 荣耀之光
# knight/paladin/85f7c810ad503790e8626439fe936d56
# 0ee8fa5dc525c1a1f23fc6911e921e4a/85f7c810ad503790e8626439fe936d56
class Skill30(PassiveSkill):
    """
        天界之力进一步集中到帕拉丁身上， 增加光盾大小和物理攻击力， 并且进入地下城时可以获得一定数量的天使光翼。
    """
    name = "荣耀之光"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 3
    uuid = "85f7c810ad503790e8626439fe936d56"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5, 33, 34.5, 36, 37.5, 39, 40.5, 42, 43.5, 45, 46.5, 48, 49.5, 51, 52.5, 54, 55.5, 57, 58.5, 60, 61.5, 63, 64.5, 66, 67.5, 69, 70.5, 72, 73.5, 75, 76.5, 78, 79.5, 81, 82.5, 84, 85.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 天使光翼获得量 : 2个

# 信仰聚合 : 神光惩戒
# knight/paladin/002cbdd9bfd0f0b970451ae8d48d029e
# 0ee8fa5dc525c1a1f23fc6911e921e4a/002cbdd9bfd0f0b970451ae8d48d029e
class Skill31(ActiveSkill):
    """
        以绝对防御的姿态将凝聚的天界之光加速集中到武器和盾牌上， 然后向前挥动武器和盾牌， 引爆光之力。\n
        在神光集中的状态下， 获得更强大的防御力， 可以抵御一切伤害。 若持续按住技能键， 可以使该状态持续一定时间。\n
        神光爆炸时， 会消耗所有天使光翼， 使范围内的敌人受到伤害。 技能结束时， 天使光翼吸收到最大值。
    """
    name = "信仰聚合 : 神光惩戒"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [300, 3000]
    uuid = "002cbdd9bfd0f0b970451ae8d48d029e"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 神光集中状态可持续时间 : {value0}秒
    # REMOVE: data0 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 攻击力 : {value1}%
    # REMOVE: data1 = [0, 144863, 178454, 212046, 245637, 279229, 312820, 346412, 380003, 413594, 447186, 480777, 514369, 547960, 581551, 615143, 648734, 682326, 715917, 749509, 783100, 816691, 850283, 883874, 917466, 951057, 984649, 1018240, 1051831, 1085423, 1119014, 1152606, 1186197, 1219788, 1253380, 1286971, 1320563, 1354154, 1387746, 1421337, 1454928, 1488520, 1522111, 1555703, 1589294, 1622885, 1656477, 1690068, 1723660, 1757251, 1790843]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 神光庇护
# knight/paladin/31823197cc0b04d4c5dcf8f928d9220c
# 0ee8fa5dc525c1a1f23fc6911e921e4a/31823197cc0b04d4c5dcf8f928d9220c
class Skill32(ActiveSkill):
    """
        将集中到盾牌上的光之力释放到周围， 为自己和队友抵挡受到的一切攻击。\n
        在持续时间内， 自身和范围内的队友受到攻击时不会倒地， 同时大幅减少所受伤害， 免疫眩晕、 石化、 冻结和睡眠异常状态。\n
    消耗天使光翼施放时， 恢复周围队员的生命值。\n
        在持续时间内按跳跃键可以解除神光庇护状态。
    """
    name = "神光庇护"
    learnLv = 60
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [240, 240]
    uuid = "31823197cc0b04d4c5dcf8f928d9220c"
    hasVP = True
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 所受伤害减少率 : {value0}%
    # REMOVE: data0 = [0, 9]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 所受伤害减少率 (队友) : {value1}%
    # REMOVE: data1 = [0, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 持续时间 : {value2}秒
    # REMOVE: data2 = [0, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 释放范围比率 : {value3}%
    # REMOVE: data3 = [0, 115]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [神光庇护]\n
        施放时， 将周围的敌人向外击退\n
        所受伤害减少量变更为50%
        """
        ...

    def vp_2(self):
        """
        [神光庇护]\n
        施放后帕拉丁可以进行其他行动\n
         - 在释放范围内施放[圣盾]时， 伤害减少效果不会叠加\n
        释放范围 +20%
        """
        ...

# 圣盾裁决
# knight/paladin/dac8d8207618150c162e4c6f9e168527
# 0ee8fa5dc525c1a1f23fc6911e921e4a/dac8d8207618150c162e4c6f9e168527
class Skill33(ActiveSkill):
    """
        将光之力集中到盾牌上， 向前推出盾牌并释放光之力。\n
        释放的光束对范围内的敌人造成伤害， 并使敌人进入眩晕状态。
    """
    name = "圣盾裁决"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [120, 1200]
    uuid = "dac8d8207618150c162e4c6f9e168527"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 59201, 65207, 71213, 77219, 83225, 89230, 95236, 101242, 107248, 113254, 119260, 125266, 131272, 137278, 143284, 149289, 155295, 161301, 167307, 173313, 179319, 185325, 191331, 197337, 203343, 209348, 215354, 221360, 227366, 233372, 239378, 245384, 251390, 257396, 263402, 269407, 275413, 281419, 287425, 293431, 299437, 305443, 311449, 317455, 323461, 329466, 335472, 341478, 347484, 353490]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 眩晕几率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 眩晕持续时间 : {value2}秒
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [圣盾裁决]\n
        可以强制中断转职技能的施放后僵直并施放该技能 (觉醒技能除外)\n
        施放技能后立即被击时所受伤害无效\n
        眩晕效果变更为强制控制
        """
        ...

    def vp_2(self):
        """
        [圣盾裁决]\n
        在盾牌中凝聚更强大的光之力后向前方直线发射\n
         - 总攻击力相同\n
         - 删除眩晕效果\n
        光之力经过的地方生成光明之路， 使路径上的自身和队员的移动速度增加\n
         - 持续时间 : 5秒\n
         - 移动速度增加量 : 100%
        """
        ...

# 破晓之光
# knight/paladin/8e358ecf99ac9df31a6132aeafe378a9
# 0ee8fa5dc525c1a1f23fc6911e921e4a/8e358ecf99ac9df31a6132aeafe378a9
class Skill34(ActiveSkill):
    """
        将光之力集中到自己身上， 冲上天空后快速降落到地面， 引发爆炸。\n
        爆炸时产生光之冲击波， 对范围内的敌人造成伤害。\n
        可以利用方向键调整降落地点。
    """
    name = "破晓之光"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 1 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [140, 1400]
    uuid = "8e358ecf99ac9df31a6132aeafe378a9"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 132292, 145713, 159134, 172555, 185976, 199397, 212818, 226238, 239659, 253080, 266501, 279922, 293343, 306764, 320185, 333606, 347027, 360448, 373869, 387290, 400711, 414131, 427552, 440973, 454394, 467815, 481236, 494657, 508078, 521499, 534920, 548341, 561762, 575183, 588604, 602024, 615445, 628866, 642287, 655708, 669129, 682550, 695971, 709392, 722813, 736234, 749655, 763076, 776497, 789917]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [破晓之光]\n
        施放后从天空落下审判之光 (最多攻击3次)\n
         - 总攻击力相同\n
        攻击范围 +60%
        """
        ...

    def vp_2(self):
        """
        [破晓之光]\n
        变更为可以在空中施放\n
         - 被击和倒地状态下也可以施放\n
        落地动作变更为无敌状态\n
        无法填充[天使光翼]
        """
        ...

# 戒律
# knight/paladin/9f57da5cb3651d81ca7dc9f78be33d01
# 0ee8fa5dc525c1a1f23fc6911e921e4a/9f57da5cb3651d81ca7dc9f78be33d01
class Skill35(PassiveSkill):
    """
        奉行伟大意志、 执行天命的破晓女神进入地下城时， 获得更多天使光翼， 并增加基本攻击力和技能攻击力。 
    """
    name = "戒律"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "9f57da5cb3651d81ca7dc9f78be33d01"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 天使光翼获得量 : {value1}个
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 神光回旋斩
# knight/paladin/0e3da11226dd30c2aaef52e36eff7f3f
# 0ee8fa5dc525c1a1f23fc6911e921e4a/0e3da11226dd30c2aaef52e36eff7f3f
class Skill36(ActiveSkill):
    """
        将盾牌中凝聚的光之力挥洒到周围， 吸附范围内的敌人， 然后挥动武器上挑攻击敌人。
    """
    name = "神光回旋斩"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 5
    cd = 40
    mp = [450, 4500]
    uuid = "0e3da11226dd30c2aaef52e36eff7f3f"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 113612, 125138, 136664, 148190, 159715, 171241, 182767, 194293, 205819, 217345, 228871, 240396, 251922, 263448, 274974, 286500, 298026, 309552, 321077, 332603, 344129, 355655, 367181, 378707, 390233, 401758, 413284, 424810, 436336, 447862, 459388, 470914, 482439, 493965, 505491, 517017, 528543, 540069, 551594, 563120, 574646, 586172, 597698, 609224, 620750, 632275, 643801, 655327, 666853, 678379]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [神光回旋斩]\n
        向周围倾泻天堂的力量， 发动攻击并引发连锁爆炸\n
         - 总攻击力相同\n
        连锁爆炸范围 +20%
        """
        ...

    def vp_2(self):
        """
        [神光回旋斩]\n
        跳跃后追踪前方最强敌人， 突进后下劈攻击\n
        施放技能时, 可以获得并消耗最大数量的[天使光翼]， 适用增益效果
        """
        ...

# 神圣信约
# knight/paladin/3cb633d00f8f6ee088682c9171020d26
# 0ee8fa5dc525c1a1f23fc6911e921e4a/3cb633d00f8f6ee088682c9171020d26
class Skill37(ActiveSkill):
    """
        将武器中凝聚的光之力注入地面并向四周喷涌， 对敌人造成多段攻击伤害。 
    """
    name = "神圣信约"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [500, 5000]
    uuid = "3cb633d00f8f6ee088682c9171020d26"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 13270, 14616, 15963, 17309, 18655, 20001, 21348, 22694, 24040, 25386, 26733, 28079, 29425, 30771, 32118, 33464, 34810, 36156, 37503, 38849, 40195, 41541, 42888, 44234, 45580, 46926, 48273, 49619, 50965, 52311, 53658, 55004, 56350, 57696, 59043, 60389, 61735, 63081, 64428, 65774, 67120, 68466, 69813, 71159, 72505, 73851, 75198, 76544, 77890, 79236]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [神圣信约]\n
        将武器中蕴含的光之力量聚集到地面， 引发大爆炸\n
        攻击范围 +30%
        """
        ...

    def vp_2(self):
        """
        [神圣信约]\n
        可以在除觉醒技能外的转职技能施放过程中施放； 可以解除控制型异常状态并施放\n
         - 由大天使代替施放技能， 解除帕拉丁的负面异常状态
        """
        ...

# 神圣意志 : 大天使降临
# knight/paladin/6d7c9a15c08cc41d70125083e869e1a1
# 0ee8fa5dc525c1a1f23fc6911e921e4a/6d7c9a15c08cc41d70125083e869e1a1
class Skill38(ActiveSkill):
    """
        向前方举起盾牌， 进入意志召唤状态， 使大天使降临， 利用充溢的光之力治愈队友。 (恢复量受天使光翼的影响)\n
        按住技能键可以维持意志召唤状态， 松开技能键或者经过一定时间后， 与大天使合力向前方突进， 释放神光， 使周围敌人受到伤害。\n
        意志召唤状态下， 按向后方向键时， 在原地释放神光。\n
        技能结束时， 天使光翼汲取到最大值。
    """
    name = "神圣意志 : 大天使降临"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2000, 5000]
    uuid = "6d7c9a15c08cc41d70125083e869e1a1"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 意志召唤持续时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 攻击力 : {value1}%
    # REMOVE: data1 = [0, 333591, 410945, 488300, 565654, 643009, 720363, 797718, 875072, 952426, 1029781, 1107135, 1184490, 1261844, 1339199, 1416553, 1493908, 1571262, 1648616, 1725971, 1803325, 1880680, 1958034, 2035389, 2112743, 2190097, 2267452, 2344806, 2422161, 2499515, 2576870, 2654224, 2731578, 2808933, 2886287, 2963642, 3040996, 3118351, 3195705, 3273060, 3350414, 3427768, 3505123, 3582477, 3659832, 3737186, 3814541, 3891895, 3969249, 4046604, 4123958]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 超越之翼
# knight/paladin/c1dd8b776fb1dd24c6373c678ef1dd2e
# 0ee8fa5dc525c1a1f23fc6911e921e4a/c1dd8b776fb1dd24c6373c678ef1dd2e
class Skill39(PassiveSkill):
    """
        皓曦·帕拉丁获得超越者梅丹佐之力， 增加基本攻击力和转职技能攻击力， 部分技能获得附加效果。\n
        [天使光翼] : 进入地下城时， 增加天使光翼获得量； 额外增加2个新的光翼， 在拥有7个及以上光翼的状态下， 发动[天使光翼]时， 效果中增加减少队友所受伤害的功能。\n
        (伤害减少效果不与[圣盾]、 [神光庇护]的伤害减少效果叠加)\n
        [神光喷涌] : 基本攻击变更为3次， 原来的第4次上挑攻击力并入锤击攻击力中。\n
        锤击攻击时， 发动小型神光喷涌， 对敌人造成多段攻击伤害。\n
        小型神光喷涌的攻击力以[神光喷涌]攻击力的一定比率适用。    
    """
    name = "超越之翼"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "c1dd8b776fb1dd24c6373c678ef1dd2e"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [神光喷涌]
    # 小型神光喷涌攻击力 : 神光喷涌攻击力的{value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [天使光翼]
    # 队友所受伤害减少率 (7个) : {value2}%
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 队友所受伤害减少率 (8个) : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 天使光翼获得量 : {value4}个
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 神光耀世
# knight/paladin/481348575c1e141925c836b59c5db3ca
# 0ee8fa5dc525c1a1f23fc6911e921e4a/481348575c1e141925c836b59c5db3ca
class Skill40(ActiveSkill):
    """
        召唤梅丹佐的盾牌， 然后挥动盾牌， 利用神光之力攻击敌人。\n
        神光照射的地方产生光之裂缝， 然后帕拉丁用盾牌砸向地面， 使光之裂缝爆炸， 对大范围的敌人造成强力伤害。\n
        施放技能时， 在装备梅丹佐的盾牌之前， 天使光翼汲取到最大值。
    """
    name = "神光耀世"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [960, 7200]
    uuid = "481348575c1e141925c836b59c5db3ca"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 神光攻击力 : {value0}%
    # REMOVE: data0 = [0, 21614, 23807, 26000, 28193, 30385, 32578, 34771, 36964, 39156, 41349, 43542, 45735, 47927, 50120, 52313, 54506, 56698, 58891, 61084, 63277, 65469, 67662, 69855, 72048, 74240, 76433, 78626, 80819, 83011, 85204, 87397, 89590, 91782, 93975, 96168, 98361, 100553, 102746, 104939, 107132, 109324, 111517, 113710, 115903, 118095, 120288, 122481, 124674, 126866, 129059]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 神光多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 下砸冲击波攻击力 : {value2}%
    # REMOVE: data2 = [0, 28819, 31743, 34666, 37590, 40514, 43437, 46361, 49285, 52208, 55132, 58056, 60979, 63903, 66827, 69750, 72674, 75598, 78521, 81445, 84369, 87292, 90216, 93140, 96063, 98987, 101911, 104834, 107758, 110682, 113605, 116529, 119453, 122376, 125300, 128224, 131147, 134071, 136995, 139918, 142842, 145766, 148689, 151613, 154537, 157460, 160384, 163308, 166231, 169155, 172079]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 光之裂缝爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 28819, 31743, 34666, 37590, 40514, 43437, 46361, 49285, 52208, 55132, 58056, 60979, 63903, 66827, 69750, 72674, 75598, 78521, 81445, 84369, 87292, 90216, 93140, 96063, 98987, 101911, 104834, 107758, 110682, 113605, 116529, 119453, 122376, 125300, 128224, 131147, 134071, 136995, 139918, 142842, 145766, 148689, 151613, 154537, 157460, 160384, 163308, 166231, 169155, 172079]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 光之裂缝爆炸多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 启示录 : 末日救赎
# knight/paladin/5f4c55fe2ebdf0623bd76d4fda872ddc
# 0ee8fa5dc525c1a1f23fc6911e921e4a/5f4c55fe2ebdf0623bd76d4fda872ddc
class Skill41(ActiveSkill):
    """
        以超越者梅丹佐的姿态现身， 遵照最后的启示， 救赎整个世界。\n
        施放时， 神圣光辉环绕在皓曦·帕拉丁周围， 稍后， 拥有八翼的超越者梅丹佐现身。\n
        然后， 周围漂浮的梅丹佐之眼中发射光芒， 造成多段攻击伤害， 梅丹佐升上天空， 召唤巨大的梅丹佐之锤砸向地面， 对敌人造成巨大伤害。\n
        首次施放时， [天使光翼]效果以最大效果发动； 技能结束时， 天使光翼汲取到最大值。\n
    [三次觉醒技能]\n
        使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
        若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "启示录 : 末日救赎"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4025, 8055]
    uuid = "5f4c55fe2ebdf0623bd76d4fda872ddc"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 首次爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 86919, 107074, 127229, 147384, 167539, 187694, 207850, 228005, 248160, 268315, 288470, 308625, 328780, 348935, 369090, 389246, 409401, 429556, 449711, 469866, 490021, 510176, 530331, 550486, 570641, 590797, 610952, 631107, 651262, 671417, 691572, 711727, 731882, 752037, 772193, 792348, 812503, 832658, 852813, 872968, 893123, 913278, 933433, 953589, 973744, 993899, 1014054, 1034209, 1054364, 1074519]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 梅丹佐之眼攻击力 : {value1}%
    # REMOVE: data1 = [0, 24834, 30593, 36351, 42110, 47868, 53627, 59386, 65144, 70903, 76661, 82420, 88179, 93937, 99696, 105454, 111213, 116972, 122730, 128489, 134247, 140006, 145765, 151523, 157282, 163040, 168799, 174558, 180316, 186075, 191833, 197592, 203351, 209109, 214868, 220626, 226385, 232144, 237902, 243661, 249419, 255178, 260937, 266695, 272454, 278212, 283971, 289730, 295488, 301247, 307005]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 梅丹佐之眼多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 梅丹佐之锤冲撞攻击力 : {value3}%
    # REMOVE: data3 = [0, 347676, 428296, 508916, 589537, 670157, 750778, 831398, 912019, 992639, 1073259, 1153880, 1234500, 1315121, 1395741, 1476362, 1556982, 1637602, 1718223, 1798843, 1879464, 1960084, 2040705, 2121325, 2201945, 2282566, 2363186, 2443807, 2524427, 2605048, 2685668, 2766288, 2846909, 2927529, 3008150, 3088770, 3169391, 3250011, 3330631, 3411252, 3491872, 3572493, 3653113, 3733734, 3814354, 3894974, 3975595, 4056215, 4136836, 4217456, 4298077]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 终结爆炸攻击力 : {value4}%
    # REMOVE: data4 = [0, 37251, 45889, 54527, 63165, 71803, 80440, 89078, 97716, 106354, 114992, 123630, 132268, 140906, 149544, 158182, 166820, 175457, 184095, 192733, 201371, 210009, 218647, 227285, 235923, 244561, 253199, 261836, 270474, 279112, 287750, 296388, 305026, 313664, 322302, 330940, 339578, 348215, 356853, 365491, 374129, 382767, 391405, 400043, 408681, 417319, 425957, 434594, 443232, 451870, 460508]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 终结爆炸多段攻击次数 : {value5}次
    # REMOVE: data5 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'paladin'
        self.nameCN = '皓曦·帕拉丁'
        self.role = 'knight'
        self.角色 = '守护者'
        self.职业 = '帕拉丁'
        self.jobId = '0ee8fa5dc525c1a1f23fc6911e921e4a'
        self.jobGrowId = '6d459bc74ba73ee4fe5cdc4655400193'

        self.武器选项 = ['太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['物理百分比']
        self.输出类型 = '物理百分比'
        self.防具精通属性 = ['力量']
        self.防具类型 = '板甲'
        self.buff = 1.962

        super().__init__(equVersion, __name__)
