#41f1cdc2ff58bb5fdc287be0db2a8df3
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "swordman_male/asura/cn/skillDetail"

# 基础精通
# swordman_male/asura/5a56514f35cf0270ae8d6c65f8fefd78
# 41f1cdc2ff58bb5fdc287be0db2a8df3/5a56514f35cf0270ae8d6c65f8fefd78
class Skill0(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [上挑]、 [连突刺]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 0 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["波动刻印"]}]


# 鬼印珠
# swordman_male/asura/9dda3f4a849dba1a288dd65e116860f2
# 41f1cdc2ff58bb5fdc287be0db2a8df3/9dda3f4a849dba1a288dd65e116860f2
class Skill1(ActiveSkill):
    """
    把波动印转化成鬼印珠向敌人发射。\n
    鬼印珠高速持续旋转后爆炸。\n
    命中时， 因鬼印珠高速旋转， 敌人移动速度减少。\n
    波动印的数量越多， 鬼印珠的攻击力越高。\n
    被远距离攻击命中前使用[格挡]， 可以将受到的伤害减少为0， 同时生成波动印。
    """
    name = "鬼印珠"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2
    rangeLv = 2
    cd = 6
    mp = [95, 980]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"

    hasVP = False
    hasUP = True

    # 鬼印珠攻击力 : {value0}
    # REMOVE: data0 = [0, 459, 505, 552, 598, 645, 691, 738, 784, 831, 877, 924, 970, 1017, 1063, 1110, 1157, 1203, 1250, 1296, 1343, 1389, 1436, 1482, 1529, 1575, 1622, 1668, 1715, 1761, 1808, 1854, 1901, 1947, 1994, 2041, 2087, 2134, 2180, 2227, 2273, 2320, 2366, 2413, 2459, 2506, 2552, 2599, 2645, 2692, 2738, 2785, 2831, 2878, 2925, 2971, 3018, 3064, 3111, 3157, 3204, 3250, 3297, 3343, 3390, 3436, 3483, 3529, 3576, 3622, 3669]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hi0 = 18
    # 鬼印珠多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18, 18]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 鬼印珠爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 2064, 2273, 2483, 2692, 2901, 3111, 3320, 3529, 3739, 3948, 4158, 4367, 4576, 4786, 4995, 5204, 5414, 5623, 5832, 6042, 6251, 6461, 6670, 6879, 7089, 7298, 7507, 7717, 7926, 8136, 8345, 8554, 8764, 8973, 9182, 9392, 9601, 9811, 10020, 10229, 10439, 10648, 10857, 11067, 11276, 11485, 11695, 11904, 12114, 12323, 12532, 12742, 12951, 13160, 13370, 13579, 13789, 13998, 14207, 14417, 14626, 14835, 15045, 15254, 15464, 15673, 15882, 16092, 16301, 16510]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 波动刻印5个时攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 波动刻印4个时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 波动刻印3个时攻击力增加率 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 波动刻印2个时攻击力增加率 : {value6}%
    # REMOVE: data6 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 波动刻印1个时攻击力增加率 : {value7}%
    # REMOVE: data7 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [范围信息]
    # 鬼印珠大小比率 : {value8}%
    # REMOVE: data8 = [0, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185, 185]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 鬼印珠爆炸比率 : {value9}%
    # REMOVE: data9 = [0, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168, 168]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)

# 地裂 · 波动剑
# swordman_male/asura/3d8f3d438405d79f8d3ed68072674d1e
# 41f1cdc2ff58bb5fdc287be0db2a8df3/3d8f3d438405d79f8d3ed68072674d1e
class Skill2(ActiveSkill):
    """
    向前方敌人快速施放无属性的波动剑。\n
    转职为阿修罗后， 可中断基本攻击使用
    """
    name = "地裂 · 波动剑"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cd = 3
    mp = [17, 168]
    uuid = "3d8f3d438405d79f8d3ed68072674d1e"
    hasVP = False
    hasUP = True

    # 地裂攻击力 : {value0}
    # REMOVE: data0 = [0, 5833, 6425, 7017, 7608, 8200, 8792, 9384, 9975, 10567, 11159, 11751, 12342, 12934, 13526, 14118, 14709, 15301, 15893, 16485, 17076, 17668, 18260, 18852, 19443, 20035, 20627, 21219, 21810, 22402, 22994, 23586, 24177, 24769, 25361, 25953, 26544, 27136, 27728, 28320, 28911, 29503, 30095, 30687, 31278, 31870, 32462, 33054, 33645, 34237, 34829, 35421, 36012, 36604, 37196, 37788, 38379, 38971, 39563, 40155, 40746, 41338, 41930, 42522, 43113, 43705, 44297, 44889, 45480, 46072, 46664]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 地裂大小比率 : {value1}%
    # REMOVE: data1 = [0, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191, 191]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)


# 波动刻印
# swordman_male/asura/128b9ddef2262f40723deae4407bdb42
# 41f1cdc2ff58bb5fdc287be0db2a8df3/128b9ddef2262f40723deae4407bdb42
class Skill3(ActiveSkill):
    """
    施放后， 每隔一段时间生成一个波动刻印， 基本攻击和[上挑]时发射波动剑气。\n
    波动剑气攻击力受[基础精通]影响。\n
    增加施放速度， 基本攻击和转职系列技能攻击力增加， 并获得附加效果。\n
    [裂波斩]\n
    命中时生成1个波动刻印， 对无法抓取的敌人也能施放裂波。\n
    在决斗场中， 不会增加基本攻击力和技能攻击力。
    """
    name = "波动刻印"
    learnLv = 15
    masterLv = 20
    maxLv = 30
    position = 3
    rangeLv = 3
    cd = 5
    mp = [126, 1380]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 11.5, 13, 14.5, 16, 17.5, 19, 20.5, 22, 23.5, 25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 施放速度增加 : {value1}%
    # REMOVE: data1 = [0, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 波动刻印生成间隔 : {value2}秒
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 波动刻印持续时间 : {value3}秒
    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 波动刻印数量上限 : {value4}
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 波动剑气第1击攻击力 : {value5}
    # REMOVE: data5 = [0, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87, 87]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    hit5 = 1
    # 波动剑气第2击攻击力 : {value6}
    # REMOVE: data6 = [0, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172, 172]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    hit6 = 1
    # 波动剑气第3击攻击力 : {value7}
    # REMOVE: data7 = [0, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259, 259]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    hit7 = 1

    associate = [
        {"type":"*skillRation","data":data0},
        {"type":"*skillRation","data":[0] + [20]*maxLv,"skills":["鬼印珠","不动明王阵"]},
    ]


# 绝对感知
# swordman_male/asura/d2c6df5105577fb59fb92529a36165a0
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d2c6df5105577fb59fb92529a36165a0
class Skill4(PassiveSkill):
    """
    可以在眼睛失明的状态下感知敌人的杀气， 增加自身的失明抗性和背击回避率。\n
    减少被击时防具耐久度减少率。
    """
    name = "杀气感知"
    learnLv = 18
    line = 15
    masterLv = 1
    maxLv = 1
    position = 6
    rangeLv = 1
    uuid = "d2c6df5105577fb59fb92529a36165a0"
    hasVP = False
    hasUP = False

    # 失明抗性增加 : {value0}%
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 背击回避率增加 : {value1}%
    # REMOVE: data1 = [0, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 被击时防具耐久度减少率 : {value2}%
    # REMOVE: data2 = [0, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 邪光斩
# swordman_male/asura/92360eab6e1f378902018eca681ac629
# 41f1cdc2ff58bb5fdc287be0db2a8df3/92360eab6e1f378902018eca681ac629
class Skill5(ActiveSkill):
    """
    挥剑向前方敌人发出巨大的剑气攻击。
    """
    name = "邪光斩"
    name = "邪光斩"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cd = 10
    mp = [65, 616]
    uuid = "92360eab6e1f378902018eca681ac629"

    # 剑气攻击力 : {value0}
    # REMOVE: data0 = [0, 4784, 5269, 5755, 6240, 6725, 7211, 7696, 8181, 8667, 9152, 9637, 10123, 10608, 11093, 11579, 12064, 12549, 13035, 13520, 14005, 14491, 14976, 15461, 15947, 16432, 16917, 17403, 17888, 18373, 18859, 19344, 19829, 20315, 20800, 21285, 21771, 22256, 22741, 23227, 23712, 24197, 24683, 25168, 25653, 26139, 26624, 27109, 27595, 28080, 28565, 29051, 29536, 30021, 30507, 30992, 31477, 31963, 32448, 32933, 33419, 33904, 34389, 34875, 35360, 35845, 36331, 36816, 37301, 37787, 38272]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 3
    # 剑气发射距离 : {value1}px
    # REMOVE: data1 = [0, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420, 420]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 剑气多段攻击间隔 : {value2}秒
    # REMOVE: data2 = [0, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 剑气大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)


# 修罗邪光斩
# swordman_male/asura/1fadde0eece18649caddbca7bd58cc2f
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1fadde0eece18649caddbca7bd58cc2f
class Skill6(PassiveSkill):
    """
    蓄气达最大值时， 可以增加攻击力、 发射速度和射程， 生成1个波动印。\n
    强制中断[冰刃 · 波动剑]、 [极冰 · 裂波剑]、 [爆炎 · 波动剑]、 [极炎 · 裂波剑]技能并施放[修罗邪光斩]时， 可以施放最大蓄气状态的[修罗邪光斩]。\n
    在决斗场中， 无法强制取消技能施放后的僵直时间。
    """
    name = "修罗邪光斩"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 6
    rangeLv = 15
    uuid = "1fadde0eece18649caddbca7bd58cc2f"
    hasVP = False
    hasUP = False

    # 最大蓄气时间 : {value0}秒
    # REMOVE: data0 = [0, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 邪光斩攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 发射速度和射程增加 : {value2}%
    # REMOVE: data2 = [0, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 邪光剑气多段攻击间隔 : {value3}秒
    # REMOVE: data3 = [0, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18, 0.18]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 邪光剑气多段攻击次数 : 3次

    associate = [{"type":"*skillRation","data":data1,"skills":["邪光斩"]}]


# 慧思 관조 관조
# swordman_male/asura/4e62e33aa37394ec4207a72af2968abf
# 41f1cdc2ff58bb5fdc287be0db2a8df3/4e62e33aa37394ec4207a72af2968abf
class Skill7(PassiveSkill):
    """
    高度集中精神， 通过气的流动感知敌人。\n
    增加魔法暴击率。
    """
    name = "慧思"
    learnLv = 20
    masterLv = 1
    maxLv = 10
    position = 3
    rangeLv = 3
    uuid = "4e62e33aa37394ec4207a72af2968abf"
    hasVP = False
    hasUP = False

    # 魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 6.5, 8, 9.5, 11, 12.5, 14, 15.5, 17, 18.5, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 波动爆发
# swordman_male/asura/03bb5314ffd41e9458d67ef924fef38f
# 41f1cdc2ff58bb5fdc287be0db2a8df3/03bb5314ffd41e9458d67ef924fef38f
class Skill8(ActiveSkill):
    """
    将体内凝聚的波动之力瞬间爆发， 可以使周围的敌人朝施放者的正前方飞出。\n
    施放时， 生成2个波动刻印。\n
    可以在地面被击状态下施放。\n
    在决斗场中， 不可在地面被击状态下施放。
    """
    name = "波动爆发"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4
    rangeLv = 3
    cd = 7.5
    mp = [65, 630]
    uuid = "03bb5314ffd41e9458d67ef924fef38f"

    uuid = "03bb5314ffd41e9458d67ef924fef38f"
    hasVP = False
    hasUP = True

    # 波动释放攻击力 : {value0}
    # REMOVE: data0 = [0, 16436, 19056, 21676, 24297, 26917, 29537, 32157, 34778, 37398, 40018, 42638, 45259, 47879, 50499, 53119, 55739, 58360, 60980, 63600, 66220, 68841, 71461, 74081, 76701, 79322, 81942, 84562, 87182, 89802, 92423, 95043, 97663, 100283, 102904, 105524, 108144, 110764, 113385, 116005, 118625, 121245, 123866, 126486, 129106, 131726, 134346, 136967, 139587, 142207, 144827, 147448, 150068, 152688, 155308, 157929, 160549, 163169, 165789, 168409, 171030, 173650, 176270, 178890, 181511, 184131, 186751, 189371, 191992, 194612, 197232]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 波动释放大小比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)


# 挫折意志
# swordman_male/asura/1803b6a67047cafb9e289b4f33cc507b
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1803b6a67047cafb9e289b4f33cc507b
class Skill9(PassiveSkill):
    """
    受敌人攻击或躲避攻击后， 可以暂时增加基本攻击、 技能攻击力和魔法值恢复量。\n
    若持续时间内再次受到攻击或闪避时， 则会刷新技能持续时间。\n
    施放[波动爆发]、 [无尽波动]、 [无双波]、 [邪光波动阵]、 [不动明王阵]时， 可以获得[挫折意志]效果。
    """
    name = "挫折意志"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 6
    rangeLv = 3
    uuid = "1803b6a67047cafb9e289b4f33cc507b"
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每分钟魔法值恢复增加 : {value2}
    # REMOVE: data2 = [0, 270, 570, 870, 1170, 1470, 1770, 2070, 2370, 2670, 2970, 3270, 3570, 3870, 4170, 4470, 4770, 5070, 5370, 5670, 5970]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    associate = [{"type":"*skillRation","data":data1}]


# 冰刃 · 波动剑
# swordman_male/asura/ade01c1d6afc8a05055225045e89fe49
# 41f1cdc2ff58bb5fdc287be0db2a8df3/ade01c1d6afc8a05055225045e89fe49
class Skill10(ActiveSkill):
    """
    发射沿着地面移动的冰柱。\n
    使命中的敌人进入冰冻状态。\n
    施放时， 生成1个波动刻印。\n
    在决斗场中， 武器的攻击属性不影响技能的攻击属性。
    """
    name = "冰刃 · 波动剑"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 4
    rangeLv = 2
    cd = 7
    mp = [27, 308]
    uuid = "ade01c1d6afc8a05055225045e89fe49"
    hasVP = False
    hasUP = True

    # 冰柱攻击力 : {value0}
    # REMOVE: data0 = [0, 1674, 1844, 2014, 2183, 2353, 2523, 2693, 2863, 3033, 3202, 3372, 3542, 3712, 3882, 4052, 4221, 4391, 4561, 4731, 4901, 5071, 5240, 5410, 5580, 5750, 5920, 6089, 6259, 6429, 6599, 6769, 6939, 7108, 7278, 7448, 7618, 7788, 7958, 8127, 8297, 8467, 8637, 8807, 8977, 9146, 9316, 9486, 9656, 9826, 9995, 10165, 10335, 10505, 10675, 10845, 11014, 11184, 11354, 11524, 11694, 11864, 12033, 12203, 12373, 12543, 12713, 12883, 13052, 13222, 13392]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 9
    # 冰柱多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 冰柱生成数量 : {value2}个
    # REMOVE: data2 = [0, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [冰冻效果]
    # 冰冻几率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冰冻持续时间 : {value4}秒
    # REMOVE: data4 = [0, 2.8, 2.86, 2.92, 2.98, 3.04, 3.1, 3.16, 3.22, 3.28, 3.34, 3.4, 3.46, 3.52, 3.58, 3.64, 3.7, 3.76, 3.82, 3.88, 3.94, 4, 4.06, 4.12, 4.18, 4.24, 4.3, 4.36, 4.42, 4.48, 4.54, 4.6, 4.66, 4.72, 4.78, 4.84, 4.9, 4.96, 5.02, 5.08, 5.14, 5.2, 5.26, 5.32, 5.38, 5.44, 5.5, 5.56, 5.62, 5.68, 5.74, 5.8, 5.86, 5.92, 5.98, 6.04, 6.1, 6.16, 6.22, 6.28, 6.34, 6.4, 6.46, 6.52, 6.58, 6.64, 6.7, 6.76, 6.82, 6.88, 6.94]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 冰柱大小比率 : {value5}%
    # REMOVE: data5 = [0, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101, 101]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)


# 无尽波动
# swordman_male/asura/d0cdaca82892e54097f22a1f60817048
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d0cdaca82892e54097f22a1f60817048
class Skill11(ActiveSkill):
    """
    向敌人喷射强烈的波动， 使周围敌人持续受到伤害。\n
    挑衅周围的敌人， 将攻击集中到自己身上。\n
    增加周围队友的物理暴击率和魔法暴击率， 并强化自身的基本攻击力和技能攻击力。\n
    施放时发动技能， 再次施放时解除攻击功能。\n
    技能施放后会持续消耗魔法值， 若魔法值不足则自动解除技能。\n
    对人类目标只能造成部分伤害。
    """
    name = "无尽波动"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 6
    rangeLv = 2
    cd = 5
    mp = [268, 2935]
    uuid = "d0cdaca82892e54097f22a1f60817048"
    hasUP = False

    # 波动攻击力 : {value0}
    # REMOVE: data0 = [0, 555, 611, 668, 724, 780, 837, 893, 949, 1005, 1062, 1118, 1174, 1231, 1287, 1343, 1400, 1456, 1512, 1568, 1625]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 波动多段攻击间隔 : {value1}秒
    # REMOVE: data1 = [0, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 波动领域 : {value2}px
    # REMOVE: data2 = [0, 276, 280, 283, 286, 290, 293, 297, 301, 304, 307, 311, 315, 318, 322, 325, 328, 332, 336, 339, 342]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 波动领域高度 : {value3}px
    # REMOVE: data3 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 物理暴击率增加 : {value4}%
    # REMOVE: data4 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法暴击率增加 : {value5}%
    # REMOVE: data5 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value6}%
    # REMOVE: data6 = [0, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 人类目标伤害比率 : {value7}%
    # REMOVE: data7 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    def getSkillCD(self,mode=None):
        return 0.5


# 爆炎 · 波动剑
# swordman_male/asura/ff171dc487807bb9aa28900ca9a46b41
# 41f1cdc2ff58bb5fdc287be0db2a8df3/ff171dc487807bb9aa28900ca9a46b41
class Skill12(ActiveSkill):
    """
    引发火焰连锁爆炸。\n
    使命中的敌人进入灼伤状态。\n
    施放时， 生成1个波动刻印。
    """
    name = "爆炎 · 波动剑"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [130, 1092]
    uuid = "ff171dc487807bb9aa28900ca9a46b41"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 爆炸攻击力 : {value0}
    # REMOVE: data0 = [0, 9393, 10346, 11299, 12252, 13205, 14158, 15110, 16063, 17016, 17969, 18922, 19875, 20828, 21781, 22734, 23687, 24640, 25593, 26545, 27498, 28451, 29404, 30357, 31310, 32263, 33216, 34169, 35122, 36075, 37027, 37980, 38933, 39886, 40839, 41792, 42745, 43698, 44651, 45604, 46557, 47510, 48462, 49415, 50368, 51321, 52274, 53227, 54180, 55133, 56086, 57039, 57992, 58944, 59897, 60850, 61803, 62756, 63709, 64662, 65615, 66568, 67521, 68474, 69427, 70379, 71332, 72285, 73238, 74191, 75144]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 3
    # 爆炸多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [灼伤效果]
    # 灼伤攻击力 : {value2}
    # REMOVE: data2 = [0, 13, 14, 16, 17, 18, 20, 21, 22, 24, 25, 26, 28, 29, 30, 32, 33, 34, 36, 37, 38, 40, 41, 42, 44, 45, 47, 48, 49, 51, 52, 53, 55, 56, 57, 59, 60, 61, 63, 64, 65, 67, 68, 69, 71, 72, 73, 75, 76, 77, 79, 80, 81, 83, 84, 85, 87, 88, 89, 91, 92, 93, 95, 96, 97, 99, 100, 101, 103, 104, 105]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 3
    # 灼伤几率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 灼伤持续时间 : {value4}秒
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 爆炸大小比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [爆炎 · 波动剑]\n
        将火焰之息注入剑中发出剑气\n
        - 总攻击力相同\n
        施放时波动刻印生成数量额外 +2个\n
        [暗天波动眼]发动时， 不适用效果
        """
        ...

    def vp_2(self):
        """
        [爆炎 · 波动剑]\n
        施放时消耗波动刻印， 获得移动速度增加增益\n
        - 增益持续时间 : 7.5秒\n
        - 每个波动刻印移动速度增加5% (最多叠加3次)\n
        删除施放时生成波动刻印的功能\n
        爆炸范围 +20%\n
        [暗天波动眼]发动时， 不适用效果
        """
        ...

# 无双波
# swordman_male/asura/1721e94897e9961d5c98130a13392f17
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1721e94897e9961d5c98130a13392f17
class Skill13(ActiveSkill):
    """
    可在[无尽波动]状态下施放。\n
    施放时， 在前方生成波动裂缝吸附周围的敌人。 施放过程中再次按技能键， 可发动终结爆炸。\n
    施放时， 可以预输入追加操作。\n
    施放过程中可以强制中断并施放[不动明王阵]\n
    在决斗场中， 无法连接施放[不动明王阵]。
    """
    name = "无双波"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 7
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [140, 1176]
    uuid = "1721e94897e9961d5c98130a13392f17"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 波动爆炸攻击力 : {value0}
    # REMOVE: data0 = [0, 32584, 35890, 39195, 42501, 45806, 49112, 52418, 55723, 59029, 62335, 65640, 68946, 72251, 75557, 78863, 82168, 85474, 88780, 92085, 95391, 98696, 102002, 105308, 108613, 111919, 115225, 118530, 121836, 125141, 128447, 131753, 135058, 138364, 141670, 144975, 148281, 151586, 154892, 158198, 161503, 164809, 168115, 171420, 174726, 178031, 181337, 184643, 187948, 191254, 194560, 197865, 201171, 204476, 207782, 211088, 214393, 217699, 221005, 224310, 227616, 230921, 234227, 237533, 240838, 244144, 247450, 250755, 254061, 257366, 260672]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 波动裂痕大小比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [无双波]\n
        在前方生成波动裂缝后， 角色可以行动\n
        可以强制中断波动剑技能的施放后僵直并施放\n
        - 适用技能 : [冰刃 · 波动剑]、 [爆炎 · 波动剑]\n
        波动裂缝大小 +20%
        """
        ...

    def vp_2(self):
        """
        [无双波]\n
        施放时消耗波动刻印， 获得增加回避率的增益效果\n
        - 增益持续时间 : 10秒\n
        - 每个波动刻印回避率增加5% (最多叠加3次)\n
        施放过程中所受伤害 -90%
        """
        ...



# 邪光波动阵
# swordman_male/asura/c61f5a010370101402b05b21916c2071
# 41f1cdc2ff58bb5fdc287be0db2a8df3/c61f5a010370101402b05b21916c2071
class Skill14(ActiveSkill):
    """
    用剑下劈并形成波动， 对命中的敌人造成伤害并生成圆形波动阵。\n
    可以强制中断施放后僵直并施放[无双波]。\n
    在决斗场中， 攻击失败时僵直时间会增加， 无法连接[无双波]。
    """
    name = "邪光波动阵"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [180, 1512]
    uuid = "c61f5a010370101402b05b21916c2071"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 波动攻击力 : {value0}
    # REMOVE: data0 = [0, 3633, 4001, 4370, 4738, 5107, 5475, 5844, 6212, 6581, 6950, 7318, 7687, 8055, 8424, 8792, 9161, 9529, 9898, 10266, 10635, 11003, 11372, 11740, 12109, 12478, 12846, 13215, 13583, 13952, 14320, 14689, 15057, 15426, 15794, 16163, 16531, 16900, 17268, 17637, 18006, 18374, 18743, 19111, 19480, 19848, 20217, 20585, 20954, 21322, 21691, 22059, 22428, 22797, 23165, 23534, 23902, 24271, 24639, 25008, 25376, 25745, 26113, 26482, 26850, 27219, 27587, 27956, 28325, 28693, 29062]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 波动阵攻击力 : {value1}
    # REMOVE: data1 = [0, 3321, 3658, 3995, 4332, 4669, 5006, 5343, 5680, 6017, 6354, 6691, 7028, 7365, 7702, 8039, 8376, 8712, 9049, 9386, 9723, 10060, 10397, 10734, 11071, 11408, 11745, 12082, 12419, 12756, 13093, 13430, 13767, 14104, 14441, 14777, 15114, 15451, 15788, 16125, 16462, 16799, 17136, 17473, 17810, 18147, 18484, 18821, 19158, 19495, 19832, 20169, 20506, 20843, 21179, 21516, 21853, 22190, 22527, 22864, 23201, 23538, 23875, 24212, 24549, 24886, 25223, 25560, 25897, 26234, 26571]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 7
    # 波动阵多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 波动阵持续时间 : {value3}秒
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 波动阵爆炸攻击力 : {value4}
    # REMOVE: data4 = [0, 9445, 10403, 11361, 12320, 13278, 14236, 15194, 16152, 17111, 18069, 19027, 19985, 20943, 21901, 22860, 23818, 24776, 25734, 26692, 27651, 28609, 29567, 30525, 31483, 32442, 33400, 34358, 35316, 36274, 37233, 38191, 39149, 40107, 41065, 42023, 42982, 43940, 44898, 45856, 46814, 47773, 48731, 49689, 50647, 51605, 52564, 53522, 54480, 55438, 56396, 57355, 58313, 59271, 60229, 61187, 62145, 63104, 64062, 65020, 65978, 66936, 67895, 68853, 69811, 70769, 71727, 72686, 73644, 74602, 75560]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 1
    # [范围信息]
    # 波动范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [邪光波动阵]\n
        命中时， 波动阵立即爆炸\n
        - 总攻击力相同\n
        命中时， 生成最大数量的波动刻印\n
        可以强制中断施放后僵直并施放[波动爆发]\n
        波动范围 +25%
        """
        ...

    def vp_2(self):
        """
        [邪光波动阵]\n
        对命中的最强敌人降下落雷， 并在一定范围内生成波动阵\n
        - 未命中敌人时无法施放技能\n
        - 总攻击力相同\n
        转职技能命中时， 可以施放[邪光波动阵]\n
        - 删除施放动作
        """
        ...

# 不动明王阵
# swordman_male/asura/b3659936a9a74c4ed6f7faf07cca1f9e
# 41f1cdc2ff58bb5fdc287be0db2a8df3/b3659936a9a74c4ed6f7faf07cca1f9e
class Skill15(ActiveSkill):
    """
    拥有1个以上波动刻印时， 可消耗波动刻印发动。\n
    在前方生成波动阵， 强控敌人后， 释放不动明王之焰珠在波动阵周围旋转后爆炸。\n
    消耗波动刻印数量越多， 攻击力越高。\n
    施放中按跳跃键， 则焰珠会立即爆炸。\n
    在决斗场中， 无法使用立即爆炸功能。
    """
    name = "不动明王阵"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 2
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [400, 3360]
    uuid = "b3659936a9a74c4ed6f7faf07cca1f9e"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501
    # 焰珠旋转攻击力 : {value0}
    # REMOVE: data0 = [0, 2918, 3214, 3510, 3806, 4102, 4399, 4695, 4991, 5287, 5583, 5879, 6175, 6471, 6767, 7063, 7359, 7655, 7951, 8247, 8543, 8839, 9135, 9431, 9728, 10024, 10320, 10616, 10912, 11208, 11504, 11800, 12096, 12392, 12688, 12984, 13280, 13576, 13872, 14168, 14464, 14760, 15056, 15353, 15649, 15945, 16241, 16537, 16833, 17129, 17425, 17721, 18017, 18313, 18609, 18905, 19201, 19497, 19793, 20089, 20385, 20682, 20978, 21274, 21570, 21866, 22162, 22458, 22754, 23050, 23346]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 15
    # 焰珠旋转多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 焰珠爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 21560, 23747, 25935, 28122, 30309, 32497, 34684, 36871, 39058, 41246, 43433, 45620, 47807, 49995, 52182, 54369, 56557, 58744, 60931, 63118, 65306, 67493, 69680, 71867, 74055, 76242, 78429, 80616, 82804, 84991, 87178, 89366, 91553, 93740, 95927, 98115, 100302, 102489, 104676, 106864, 109051, 111238, 113426, 115613, 117800, 119987, 122175, 124362, 126549, 128736, 130924, 133111, 135298, 137485, 139673, 141860, 144047, 146235, 148422, 150609, 152796, 154984, 157171, 159358, 161545, 163733, 165920, 168107, 170294, 172482]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 5个波动印时， 攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 4个波动印时， 攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 3个波动印时， 攻击力增加率 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 2个波动印时， 攻击力增加率 : {value6}%
    # REMOVE: data6 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 1个波动印时， 攻击力增加率 : {value7}%
    # REMOVE: data7 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [范围信息]
    # 波动阵大小比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

    def vp_1(self):
        """
        [不动明王阵]\n
        施放时进入无敌状态\n
        波动阵大小 +20%
        """
        ...

    def vp_2(self):
        """
        [不动明王阵]\n
        在前方生成波动阵后角色可以行动\n
        球体旋转时间 -20%
        """
        ...


# 心眼
# swordman_male/asura/2391a27457b5a8c6fa4b4670a91bdd11
# 41f1cdc2ff58bb5fdc287be0db2a8df3/2391a27457b5a8c6fa4b4670a91bdd11
class Skill16(PassiveSkill):
    """
    用心神洞察万物， 可以增加自身的回避率， 效果持续一定时间。\n
    随着[心眼]技能等级提升， 增加基本攻击力、 技能攻击力和命中率。\n
    进入地下城时， 自动施放[波动刻印]。
    """
    name = "心眼"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 7
    rangeLv = 3
    uuid = "2391a27457b5a8c6fa4b4670a91bdd11"
    hasVP = False
    hasUP = False

    # 增加回避率效果冷却时间  : {value0}秒
    # REMOVE: data0 = [0, 8, 7.9, 7.8, 7.7, 7.6, 7.5, 7.4, 7.3, 7.2, 7.1, 7, 6.9, 6.8, 6.7, 6.6, 6.5, 6.4, 6.3, 6.2, 6.1, 6, 5.9, 5.8, 5.7, 5.6, 5.5, 5.4, 5.3, 5.2, 5.1, 5, 4.9, 4.8, 4.7, 4.6, 4.5, 4.4, 4.3, 4.2, 4.1, 4, 3.9, 3.8, 3.7, 3.6, 3.5, 3.4, 3.3, 3.2, 3.1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 回避率增加 : {value1}%
    # REMOVE: data1 = [0, 30, 31.4, 33.5, 35.1, 36.9, 38.6, 40.4, 42.1, 43.9, 45.6, 47.4, 49.1, 50.9, 52.6, 54.4, 56.1, 57.9, 59.6, 61.4, 63.1, 64.9, 66.6, 68.4, 70.1, 71.9, 73.6, 75.4, 77.1, 78.9, 80.6, 82.4, 84.1, 85.9, 87.6, 89.4, 91.1, 92.9, 94.6, 96.4, 98.1, 99.9, 101.6, 103.4, 105.1, 106.9, 108.6, 110.4, 112.1, 113.9, 115.6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 转职技能攻击力增加率 : {value2}%
    # REMOVE: data2 = [0, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 基本攻击、 [裂波斩]、 [地裂 · 波动剑]技能攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 16, 17.5, 19, 20.5, 22, 23.5, 25, 26.5, 28, 29.5, 31, 32.5, 34, 35.5, 37, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5, 104.5, 106.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 命中率增加 : {value4}%
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    data0 = [0, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95]# noqa: E501

    data1 = [0, 16, 17.5, 19, 20.5, 22, 23.5, 25, 26.5, 28, 29.5, 31, 32.5, 34, 35.5, 37, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5, 104.5, 106.5]# noqa: E501

    associate = [
        {"type":"*skillRation","data":data2,"exceptSkills":["地裂 · 波动剑"]},
        {"type":"*skillRation","data":data3,"skills":["地裂 · 波动剑"]},
    ]


# 暗天波动眼
# swordman_male/asura/d53301bb328baf12a3ae482cc6a565dd
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d53301bb328baf12a3ae482cc6a565dd
class Skill17(ActiveSkill):
    """
    只能在[无尽波动]状态下使用。\n
    创造持续一段时间的波动领域， 强化自身， 削弱敌人。\n
    一段时间后， 领域内部出现无数眼睛， 引发爆炸后领域结束。\n
    再次按技能键， 可发动终结爆炸。\n
    降低领域内敌人的命中率， 并使敌人进入减速状态。\n
    领域维持期间， 基本攻击和部分波动剑技能会产生变化。\n
    [波动剑 · 刺轮]\n
    基本攻击第3击时， 生成向前滚动的刺轮。\n
    [波动剑 · 光翼]\n
    变更[地裂 · 波动剑]， 向敌人发出交叉的光翼攻击。\n
    [波动剑 · 天照]\n
    变更[冰刃 · 波动剑]， 地面产生尖锐的尖刺， 并生成波动刻印。\n
    [波动剑 · 闪枪]\n
    变更[爆炎 · 波动剑]， 在敌人背后生成一定数量的长枪并使其极速穿刺前方敌人， 并生成波动刻印。\n
    转职技能施放过程中， 可以发动[暗天波动眼]终结攻击。\n
    减少命中率的技能效果叠加时， 只适用数值最高的效果。
    """
    name = "暗天波动眼"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 6
    rangeLv = 5
    cube = 7
    cd = 140
    mp = [1500, 12600]
    uuid = "d53301bb328baf12a3ae482cc6a565dd"
    hasVP = False
    hasUP = False


    # 增益持续时间 : {value0}秒
    # REMOVE: data0 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率减少范围 : {value1}px
    # REMOVE: data1 = [0, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 命中率减少 : {value2}%
    # REMOVE: data2 = [0, 9, 10.5, 12, 13.5, 15.3, 16.9, 18.6, 20.2, 21.9, 23.5, 25.2, 26.8, 28.5, 30.1, 31.8, 33.4, 35.1, 36.7, 38.4, 40, 41.7, 43.3, 45, 46.6, 48.3, 49.9, 51.6, 53.2, 54.9, 56.5, 58.2, 59.8, 61.5, 63.1, 64.8, 66.4, 68.1, 69.7, 71.4, 73, 74.7, 76.3, 78, 79.6, 81.3, 82.9, 84.6, 86.2, 87.9, 89.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后一击攻击力 : {value3}
    # REMOVE: data3 = [0, 83639, 103034, 122428, 141823, 161217, 180612, 200006, 219401, 238795, 258190, 277585, 296979, 316374, 335768, 355163, 374557, 393952, 413346, 432741, 452135, 471530, 490925, 510319, 529714, 549108, 568503, 587897, 607292, 626686, 646081, 665476, 684870, 704265, 723659, 743054, 762448, 781843, 801237, 820632, 840026, 859421, 878816, 898210, 917605, 936999, 956394, 975788, 995183, 1014577, 1033972]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [基本攻击信息]
    # 第1次基本攻击攻击力 : {value4}
    # REMOVE: data4 = [0, 1522, 1875, 2228, 2581, 2934, 3287, 3640, 3993, 4346, 4699, 5052, 5405, 5758, 6111, 6464, 6817, 7170, 7523, 7876, 8229, 8582, 8935, 9288, 9641, 9994, 10347, 10700, 11053, 11406, 11759, 12112, 12465, 12818, 13171, 13524, 13877, 14230, 14583, 14936, 15288, 15641, 15994, 16347, 16700, 17053, 17406, 17759, 18112, 18465, 18818]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 第2次基本攻击攻击力 : {value5}
    # REMOVE: data5 = [0, 1706, 2102, 2498, 2893, 3289, 3684, 4080, 4476, 4871, 5267, 5663, 6058, 6454, 6850, 7245, 7641, 8037, 8432, 8828, 9224, 9619, 10015, 10411, 10806, 11202, 11597, 11993, 12389, 12784, 13180, 13576, 13971, 14367, 14763, 15158, 15554, 15950, 16345, 16741, 17137, 17532, 17928, 18323, 18719, 19115, 19510, 19906, 20302, 20697, 21093]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 第3次基本攻击攻击力 : {value6}
    # REMOVE: data6 = [0, 1899, 2339, 2779, 3219, 3660, 4100, 4540, 4980, 5421, 5861, 6301, 6741, 7182, 7622, 8062, 8502, 8943, 9383, 9823, 10263, 10704, 11144, 11584, 12025, 12465, 12905, 13345, 13786, 14226, 14666, 15106, 15547, 15987, 16427, 16867, 17308, 17748, 18188, 18628, 19069, 19509, 19949, 20389, 20830, 21270, 21710, 22150, 22591, 23031, 23471]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 波动剑 · 刺轮攻击力 : {value7}
    # REMOVE: data7 = [0, 438, 540, 642, 743, 845, 946, 1048, 1150, 1251, 1353, 1455, 1556, 1658, 1759, 1861, 1963, 2064, 2166, 2268, 2369, 2471, 2572, 2674, 2776, 2877, 2979, 3081, 3182, 3284, 3385, 3487, 3589, 3690, 3792, 3894, 3995, 4097, 4198, 4300, 4402, 4503, 4605, 4707, 4808, 4910, 5012, 5113, 5215, 5316, 5418]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 波动剑 · 刺轮多段攻击次数 : {value8}次
    # REMOVE: data8 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # [波动剑技能信息]
    # 波动剑 · 光翼冷却时间 : {value9}秒
    # REMOVE: data9 = [0, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2, 1.2]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 波动剑 · 天照冷却时间 : {value10}秒
    # REMOVE: data10 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 波动剑 · 闪枪冷却时间 : {value11}秒
    # REMOVE: data11 = [0, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9, 4.9]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # 波动剑 · 光翼攻击力 : {value12}
    # REMOVE: data12 = [0, 6733, 8294, 9855, 11417, 12978, 14539, 16101, 17662, 19223, 20784, 22346, 23907, 25468, 27029, 28591, 30152, 31713, 33274, 34836, 36397, 37958, 39519, 41081, 42642, 44203, 45764, 47326, 48887, 50448, 52010, 53571, 55132, 56693, 58255, 59816, 61377, 62938, 64500, 66061, 67622, 69183, 70745, 72306, 73867, 75428, 76990, 78551, 80112, 81673, 83235]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)
    # 波动剑 · 天照攻击力 : {value13}
    # REMOVE: data13 = [0, 1654, 2038, 2422, 2805, 3189, 3573, 3956, 4340, 4723, 5107, 5491, 5874, 6258, 6641, 7025, 7409, 7792, 8176, 8560, 8943, 9327, 9710, 10094, 10478, 10861, 11245, 11629, 12012, 12396, 12779, 13163, 13547, 13930, 14314, 14698, 15081, 15465, 15848, 16232, 16616, 16999, 17383, 17767, 18150, 18534, 18917, 19301, 19685, 20068, 20452]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13, lambda x = None: x)
    # 波动剑 · 天照多段攻击次数 : {value14}次
    # REMOVE: data14 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14, lambda x = None: x)
    # 波动剑 · 闪枪攻击力 : {value15}
    # REMOVE: data15 = [0, 1905, 2346, 2788, 3230, 3671, 4113, 4554, 4996, 5438, 5879, 6321, 6763, 7204, 7646, 8088, 8529, 8971, 9412, 9854, 10296, 10737, 11179, 11621, 12062, 12504, 12946, 13387, 13829, 14271, 14712, 15154, 15595, 16037, 16479, 16920, 17362, 17804, 18245, 18687, 19129, 19570, 20012, 20454, 20895, 21337, 21778, 22220, 22662, 23103, 23545]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15, lambda x = None: x)
    # 波动剑 · 闪枪多段攻击次数 : {value16}次
    # REMOVE: data16 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data16 = get_data(f'{prefix}/{uuid}', 16, lambda x = None: x)
    # [减速效果]
    # 减速范围 : {value17}px
    # REMOVE: data17 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data17 = get_data(f'{prefix}/{uuid}', 17, lambda x = None: x)
    # 减速几率 : {value18}%
    # REMOVE: data18 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data18 = get_data(f'{prefix}/{uuid}', 18, lambda x = None: x)
    # 减速持续时间 : {value19}秒
    # REMOVE: data19 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data19 = get_data(f'{prefix}/{uuid}', 19, lambda x = None: x)
    # 减速攻击速度减少率 : {value20}%
    # REMOVE: data20 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data20 = get_data(f'{prefix}/{uuid}', 20, lambda x = None: x)

    mode = ['开眼','平X','光翼','天照','闪枪']

    def setMode(self, mode):
        if mode == "开眼":
            self.hit3 = 1
        else:
            self.hit3 = 0
        if mode == "平X":
            self.hit4 = self.hit5 = self.hit6 = 1
            self.hit7 = 10
        elif mode == "光翼":
            self.hit12 = 1
            self.cd = 1.2
        elif mode == "天照":
            self.hit13 = 5
            self.cd = 2
        elif mode == "闪枪":
            self.hit15 = 7
            self.cd = 4.9

    def getSkillCD(self,mode=None):
        if mode == "光翼":
            pre = self.char.GetSkillByName("地裂 · 波动剑")
            return 1.2 * pre.getSkillCD(mode) / pre.cd
        elif mode == "天照":
            pre = self.char.GetSkillByName("冰刃 · 波动剑")
            return 2 * pre.getSkillCD(mode) / pre.cd
        elif mode == "闪枪":
            pre = self.char.GetSkillByName("爆炎 · 波动剑")
            return 4.9 * pre.getSkillCD(mode) / pre.cd
        elif mode == "平X":
            return 1.0
        else:
            return super().getSkillCD(mode)

# 极冰 · 裂波剑
# swordman_male/asura/7cf17936a039b418660424125dc968d7
# 41f1cdc2ff58bb5fdc287be0db2a8df3/7cf17936a039b418660424125dc968d7
class Skill18(ActiveSkill):
    """
    发射分裂为三叉戟形状的强化冰柱掠过地面。\n
    使命中的敌人进入冰冻状态。
    """
    name = "极冰 · 裂波剑"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [400, 1120]
    uuid = "7cf17936a039b418660424125dc968d7"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    vps = [
          {
            "name": "极冰剑 : 绝对零度",
            "desc": "增加立即爆炸功能<br/>范围增加",
            "explain": "[极冰 · 裂波剑]<br/>生成冰柱后再次按技能键时直接爆炸<br/><br/>冰柱生成数量 + 3个<br/>冰柱大小 + 30%<br/>冰柱爆炸范围 + 30%"
          },
          {
            "name": "冰花盛开",
            "desc": "攻击力和冷却时间增加",
            "explain": "[极冰 · 裂波剑]<br/>将剑插入地面后， 以魔法阵为中心展开冰花后同时发生爆炸<br/>- 基本冷却时间变更为40秒<br/>- 总攻击力 100%"
          }
        ]

    # 冰柱攻击力 : {value0}
    # REMOVE: data0 = [0, 4259, 4691, 5123, 5555, 5987, 6419, 6851, 7283, 7715, 8148, 8580, 9012, 9444, 9876, 10308, 10740, 11172, 11604, 12036, 12468, 12900, 13332, 13764, 14196, 14629, 15061, 15493, 15925, 16357, 16789, 17221, 17653, 18085, 18517, 18949, 19381, 19813, 20245, 20677, 21110, 21542, 21974, 22406, 22838, 23270, 23702, 24134, 24566, 24998, 25430]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 3
    # 冰柱多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 冰柱生成数量 : {value2}个
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 冰柱爆炸攻击力 : {value3}
    # REMOVE: data3 = [0, 6317, 6958, 7599, 8240, 8881, 9522, 10163, 10804, 11445, 12086, 12726, 13367, 14008, 14649, 15290, 15931, 16572, 17213, 17854, 18495, 19135, 19776, 20417, 21058, 21699, 22340, 22981, 23622, 24263, 24904, 25544, 26185, 26826, 27467, 28108, 28749, 29390, 30031, 30672, 31312, 31953, 32594, 33235, 33876, 34517, 35158, 35799, 36440, 37081, 37721]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 5
    # 冰柱爆炸多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [冰冻效果]
    # 冰冻几率 : {value5}%
    # REMOVE: data5 = [0, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250, 260, 270, 280, 290, 300, 310, 320, 330, 340, 350, 360, 370, 380, 390, 400, 410, 420, 430, 440, 450, 460, 470, 480, 490, 500, 510, 520]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 冰冻持续时间 : {value6}秒
    # REMOVE: data6 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 冰柱大小比率 : {value7}%
    # REMOVE: data7 = [0, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106, 106]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 冰柱爆炸大小比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

    def vp_1(self):
        """
        [极冰 · 裂波剑]\n
        生成冰柱后再次按技能键时直接爆炸\n
        冰柱生成数量 +3个\n
        冰柱大小 +30%\n
        冰柱爆炸范围 +30%
        """
        ...

    def vp_2(self):
        """
        [极冰 · 裂波剑]\n
        将剑插入地面后， 以魔法阵为中心展开冰花后同时发生爆炸\n
        - 基本冷却时间变更为40秒\n
        - 总攻击力 +100%
        """
        self.cd = 40
        self.skillRation *= 2
        ...


# 极炎 · 裂波剑
# swordman_male/asura/b89c9ab317bc0a443f6497b7cca2f6a8
# 41f1cdc2ff58bb5fdc287be0db2a8df3/b89c9ab317bc0a443f6497b7cca2f6a8
class Skill19(ActiveSkill):
    """
    挥舞蕴含火焰气息的剑， 气息渗入地面生成火焰地带后， 引发剧烈爆炸。\n
    使命中的敌人进入灼伤状态。\n
    火焰地带内的敌人会进入减速状态。
    """
    name = "极炎 · 裂波剑"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [800, 1680]
    uuid = "b89c9ab317bc0a443f6497b7cca2f6a8"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 火焰地带持续时间 : {value0}秒
    # REMOVE: data0 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 火焰地带多段攻击力 : {value1}
    # REMOVE: data1 = [0, 6073, 6689, 7305, 7921, 8537, 9153, 9769, 10385, 11001, 11617, 12234, 12850, 13466, 14082, 14698, 15314, 15930, 16546, 17162, 17778, 18394, 19010, 19626, 20243, 20859, 21475, 22091, 22707, 23323, 23939, 24555, 25171, 25787, 26403, 27019, 27635, 28251, 28868, 29484, 30100, 30716, 31332, 31948, 32564, 33180, 33796, 34412, 35028, 35644, 36260]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 8
    # 火焰地带多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 火焰爆炸攻击力 : {value3}
    # REMOVE: data3 = [0, 12146, 13378, 14610, 15842, 17074, 18306, 19538, 20771, 22003, 23235, 24467, 25699, 26931, 28163, 29396, 30628, 31860, 33092, 34324, 35556, 36789, 38021, 39253, 40485, 41717, 42949, 44181, 45414, 46646, 47878, 49110, 50342, 51574, 52807, 54039, 55271, 56503, 57735, 58967, 60199, 61432, 62664, 63896, 65128, 66360, 67592, 68825, 70057, 71289, 72521]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 4
    # 火焰爆炸多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [灼伤效果]
    # 灼伤攻击力 : {value5}
    # REMOVE: data5 = [0, 136, 150, 164, 177, 191, 205, 219, 233, 246, 260, 274, 288, 302, 315, 329, 343, 357, 371, 384, 398, 412, 426, 440, 453, 467, 481, 495, 509, 522, 536, 550, 564, 578, 591, 605, 619, 633, 647, 660, 674, 688, 702, 716, 729, 743, 757, 771, 785, 798, 812]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 灼伤几率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 灼伤持续时间 : {value7}秒
    # REMOVE: data7 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [减速效果]
    # 减速持续时间 : {value8}秒
    # REMOVE: data8 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 减速移动速度减少率 : {value9}%
    # REMOVE: data9 = [0, 54.8, 55.9, 56.9, 57.9, 59, 60, 61, 62.1, 63.1, 64.1, 65.2, 66.2, 67.2, 68.3, 69.3, 70.3, 71.4, 72.4, 73.4, 74.5, 75.5, 76.6, 77.6, 78.6, 79.7, 80.7, 81.7, 82.8, 83.8, 84.8, 85.9, 86.9, 87.9, 89, 90, 91, 92.1, 93.1, 94.1, 95.2, 96.2, 97.2, 98.3, 99.3, 100.3, 101.4, 102.4, 103.4, 104.4, 105.4]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 减速攻击速度减少率 : {value10}%
    # REMOVE: data10 = [0, 18.3, 18.6, 19, 19.3, 19.7, 20, 20.3, 20.7, 21, 21.4, 21.7, 22.1, 22.4, 22.8, 23.1, 23.4, 23.8, 24.1, 24.5, 24.8, 25.2, 25.5, 25.9, 26.2, 26.6, 26.9, 27.2, 27.6, 27.9, 28.3, 28.6, 29, 29.3, 29.7, 30, 30.3, 30.7, 31, 31.4, 31.7, 32.1, 32.4, 32.8, 33.1, 33.4, 33.8, 34.1, 34.5, 34.8, 35.2]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # [范围信息]
    # 火焰地带大小比率 : {value11}%
    # REMOVE: data11 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)

    vps = [
          {
            "name": "极炎爆裂剑",
            "desc": "攻击时间减少<br/>可多次发动",
            "explain": "[极炎 · 裂波剑]<br/>删除火焰地带， 变更为立即发生火焰爆炸的技能<br/>- 总攻击力 -50%<br/><br/>变更为可填充2次的技能<br/>- 每次填充冷却时间 : 25秒"
          },
          {
            "name": "爆炎修罗道",
            "desc": "可以同时使用[爆炎 · 波动剑]<br/>范围增加",
            "explain": "[极炎 · 裂波剑]<br/>发动火焰地带中施放[爆炎 · 波动剑]时， 引发强化的火焰爆炸<br/>- 删除[爆炎 · 波动剑]施放动作， 并入攻击力<br/><br/>火焰地带大小 + 50%<br/><br/>灼伤持续时间 + 2秒<br/>减速持续时间 +4秒"
          }
        ]

    def vp_1(self):
        """
        [极炎 · 裂波剑]\n
        删除火焰地带， 立即发生火焰爆炸\n
        - 总攻击力 -50%\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 25秒
        """
        self.cd = 25
        self.skillRation *= 0.5
        ...

    def vp_2(self):
        """
        [极炎 · 裂波剑]\n
        火焰地带发动过程中施放[爆炎 · 波动剑]时， 引发强化的火焰爆炸\n
        - 删除[爆炎 · 波动剑]施放动作， 合算攻击力\n
        火焰地带大小 +50%\n
        灼伤持续时间 +2秒\n
        减速持续时间 +4秒
        """
        ...


# 雷神之息
# swordman_male/asura/949849d5791944973d60af7e2a7eefb0
# 41f1cdc2ff58bb5fdc287be0db2a8df3/949849d5791944973d60af7e2a7eefb0
class Skill20(ActiveSkill):
    """
    降下蕴含雷神气息的落雷， 每隔一段时间攻击周围的敌人。\n
    雷神的气息攻击功能只有在激活无尽波动攻击功能时适用。\n
    增加基本攻击力和技能攻击力， 部分技能附加额外效果。\n
    [极冰 · 裂波剑]\n
    冰柱攻击时， 强制控制3秒敌人。\n
    [极炎 · 裂波剑]\n
    攻击时， 强制控制3秒敌人。\n
    令特定技能变为光属性， 攻击时使敌人进入感电状态。\n
    [适用技能]\n
    [裂波斩]、 [鬼印珠]、 [地裂 · 波动剑]、 [邪光斩]、 [修罗邪光斩]、 [波动爆发]、 [冰刃 · 波动剑]、 [爆炎 · 波动剑]、 [邪光波动阵]、 [邪光波动阵]、 [极冰 · 裂波剑]、 [极炎 · 裂波剑]、 [雷神之息]
    """
    name = "雷神之息"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    type = 'passive'
    uuid = "949849d5791944973d60af7e2a7eefb0"
    hasUP = False
    hasVP = False

    hasVP = False
    hasUP = False

    # 落雷攻击力 : {value0}
    # REMOVE: data0 = [0, 6426, 7450, 8475, 9499, 10524, 11548, 12573, 13597, 14621, 15646, 16670, 17695, 18719, 19744, 20768, 21793, 22817, 23841, 24866, 25890, 26915, 27939, 28964, 29988, 31012, 32037, 33061, 34086, 35110, 36135, 37159, 38183, 39208, 40232, 41257, 42281, 43306, 44330, 45355, 46379, 47403, 48428, 49452, 50477, 51501, 52526, 53550, 54574, 55599, 56623]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 落雷冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value2}%
    # REMOVE: data2 = [0, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [攻击时感电效果]
    # 感电攻击力 : {value3}
    # REMOVE: data3 = [0, 6, 7, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 52, 53, 54, 55, 56, 57]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 感电几率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 感电持续时间 : {value5}秒
    # REMOVE: data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    associate = [{"type":"*skillRation","data":data2}]

    def getSkillCD(self,mode=None):
        return 2.5


# 天雷 · 波动剑
# swordman_male/asura/e1daab884dd07fc9e70d08b83d1790eb
# 41f1cdc2ff58bb5fdc287be0db2a8df3/e1daab884dd07fc9e70d08b83d1790eb
class Skill21(ActiveSkill):
    """
    向目标挥动波动剑， 在一定时间内对敌人生成波动珠， 持续一段时间后爆炸。\n
    最少生成3个波动珠， 并随着波动印的数量增加。\n
    如果存在2个以上的波动珠， 则波动珠之间会相互连接。\n
    再次按技能键， 可引发爆炸。\n
    施放技能时， 可以生成波动印。\n
    攻击时， 附加感电状态、
    """
    name = "天雷 · 波动剑"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "天雷·波动剑"
    uuid = "e1daab884dd07fc9e70d08b83d1790eb"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 波动珠攻击力 : {value0}
    # REMOVE: data0 = [0, 18696, 20592, 22489, 24386, 26282, 28179, 30076, 31972, 33869, 35766, 37662, 39559, 41456, 43352, 45249, 47146, 49042, 50939, 52836, 54732, 56629, 58526, 60422, 62319, 64216, 66112, 68009, 69906, 71802, 73699, 75596, 77492, 79389, 81286, 83182, 85079, 86976, 88872, 90769, 92666, 94562, 96459, 98356, 100252, 102149, 104046, 105942, 107839, 109736, 111632]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 5
    # 波动珠多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 波动珠爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 23370, 25740, 28111, 30482, 32853, 35224, 37595, 39965, 42336, 44707, 47078, 49449, 51820, 54190, 56561, 58932, 61303, 63674, 66045, 68415, 70786, 73157, 75528, 77899, 80269, 82640, 85011, 87382, 89753, 92124, 94494, 96865, 99236, 101607, 103978, 106349, 108719, 111090, 113461, 115832, 118203, 120574, 122944, 125315, 127686, 130057, 132428, 134799, 137169, 139540]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [感电效果]
    # 感电攻击力 : {value3}
    # REMOVE: data3 = [0, 119, 131, 143, 155, 167, 179, 191, 203, 215, 227, 239, 251, 263, 275, 288, 300, 312, 324, 336, 348, 360, 372, 384, 396, 408, 420, 432, 444, 456, 468, 480, 492, 504, 517, 529, 541, 553, 565, 577, 589, 601, 613, 625, 637, 649, 661, 673, 685, 697, 709]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 6
    # 感电几率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 感电持续时间 : {value5}秒
    # REMOVE: data5 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 波动阵大小比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 波动珠爆炸大小比率 : {value7}%
    # REMOVE: data7 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    def vp_1(self):
        """
        [天雷 · 波动剑]\n
        在魔法阵中生成波动珠并引发爆炸\n
        - 总攻击力相同\n
        命中时生成数量上限的波动刻印
        """
        ...

    def vp_2(self):
        """
        [天雷 · 波动剑]\n
        增加命中时控制敌人的功能； 消耗波动刻印， 增加波动珠爆炸后的控制持续时间\n
        - 每个波动刻印的控制持续时间 +0.6秒 (最多叠加5次)\n
        - 删除施放时生成波动刻印的功能\n
        可以强制中断[邪光波动阵]的施放后僵直并施放\n
        施放时初始化[邪光波动阵]的冷却时间\n
        - [邪光波动阵]攻击力 -33%\n
        波动阵大小 +20%\n
        - 波动珠爆炸大小 +20%
        """
        ...

# 天雷 · 降魔杵
# swordman_male/asura/8d996a242c5c0efd8cfe6cb4bc6defcc
# 41f1cdc2ff58bb5fdc287be0db2a8df3/8d996a242c5c0efd8cfe6cb4bc6defcc
class Skill22(ActiveSkill):
    """
    召唤出可以产生闪电的天雷云， 每隔一段时间， 天雷云还会生成闪电下落袭击敌人。\n
    降魔杵的攻击功能只能[无尽波动]攻击功能发动的状态下适用。\n
    天雷云持续时间内再次按技能键， 可将剩余的降魔杵转化为一个巨型金刚降魔杵， 砸向地面使敌人受到伤害。\n
    降魔杵的攻击可以使敌人进入感电状态。\n
    施放转职技能过程中， 可以发动[天雷 · 降魔杵]终结攻击。
    """
    name = "天雷 · 降魔杵"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [800, 6000]
    uuid = "8d996a242c5c0efd8cfe6cb4bc6defcc"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 天雷云持续时间 : {value0}秒
    # REMOVE: data0 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 降魔杵生成间隔 : {value1}秒
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 降魔杵的数量上限 : {value2}
    # REMOVE: data2 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 降魔杵攻击力 : {value3}
    # REMOVE: data3 = [0, 1413, 1556, 1699, 1843, 1986, 2129, 2272, 2416, 2559, 2702, 2846, 2989, 3132, 3276, 3419, 3562, 3706, 3849, 3992, 4135, 4279, 4422, 4565, 4709, 4852, 4995, 5139, 5282, 5425, 5568, 5712, 5855, 5998, 6142, 6285, 6428, 6572, 6715, 6858, 7002, 7145, 7288, 7431, 7575, 7718, 7861, 8005, 8148, 8291, 8435]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 16
    # 降魔杵多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 降魔杵的爆炸攻击力 : {value5}
    # REMOVE: data5 = [0, 1413, 1556, 1699, 1843, 1986, 2129, 2272, 2416, 2559, 2702, 2846, 2989, 3132, 3276, 3419, 3562, 3706, 3849, 3992, 4135, 4279, 4422, 4565, 4709, 4852, 4995, 5139, 5282, 5425, 5568, 5712, 5855, 5998, 6142, 6285, 6428, 6572, 6715, 6858, 7002, 7145, 7288, 7431, 7575, 7718, 7861, 8005, 8148, 8291, 8435]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 降魔杵的爆炸多段攻击次数 : {value6}次
    # REMOVE: data6 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [最后一击信息]
    # 降魔杵多段攻击次数 : {value7}次
    # REMOVE: data7 = [0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 巨型降魔杵攻击力 : {value8}
    # REMOVE: data8 = [0, 17846, 19656, 21467, 23277, 25087, 26898, 28708, 30519, 32329, 34140, 35950, 37760, 39571, 41381, 43192, 45002, 46813, 48623, 50434, 52244, 54054, 55865, 57675, 59486, 61296, 63107, 64917, 66727, 68538, 70348, 72159, 73969, 75780, 77590, 79400, 81211, 83021, 84832, 86642, 88453, 90263, 92073, 93884, 95694, 97505, 99315, 101126, 102936, 104747, 106557]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 巨型降魔杵爆炸攻击力 : {value9}
    # REMOVE: data9 = [0, 49914, 54977, 60041, 65105, 70169, 75232, 80296, 85360, 90423, 95487, 100551, 105615, 110678, 115742, 120806, 125869, 130933, 135997, 141061, 146124, 151188, 156252, 161315, 166379, 171443, 176507, 181570, 186634, 191698, 196761, 201825, 206889, 211953, 217016, 222080, 227144, 232207, 237271, 242335, 247399, 252462, 257526, 262590, 267653, 272717, 277781, 282845, 287908, 292972, 298036]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [感电效果]
    # 感电攻击力 : {value10}
    # REMOVE: data10 = [0, 63, 70, 76, 83, 89, 95, 102, 108, 115, 121, 127, 134, 140, 147, 153, 160, 166, 172, 179, 185, 192, 198, 204, 211, 217, 224, 230, 237, 243, 249, 256, 262, 269, 275, 281, 288, 294, 301, 307, 314, 320, 326, 333, 339, 346, 352, 358, 365, 371, 378]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 感电几率 : {value11}%
    # REMOVE: data11 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # 感电持续时间 : {value12}秒
    # REMOVE: data12 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)
    # [范围信息]
    # 降魔杵爆炸大小比率 : {value13}%
    # REMOVE: data13 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13, lambda x = None: x)

    mode = ['雷针','终结']

    def setMode(self, mode):
        if mode == "雷针":
            self.hit3 = self.hit10 = 6
            self.hit8 = self.hit9 = 0
        elif mode == "终结":
            self.hit3 = self.hit10 = 0
            self.hit8 = self.hit9 = 1

    def getSkillCD(self, mode=None):
        if mode == "雷针" or self.vp == 2:
            return 2
        return super().getSkillCD(mode)

    def vp_1(self):
        """
        [天雷 · 降魔杵]\n
        雷云持续时间变更为无限制\n
        - 施放时， 删除无色小晶块消耗量\n
        再次按技能键时， 在前方范围内最强敌人的位置生成雷云\n
        - 发动最后一击时， 立即适用冷却时间和无色小晶块消耗量
        """
        ...

    def vp_2(self):
        """
        [天雷 · 降魔杵]\n
        召唤红色雷云\n
        - 向范围内所有敌人发射降魔杵\n
        - 删除发动终结攻击功能\n
        - 降魔杵攻击力 +48%\n
        - 降魔杵爆炸攻击力 +48%
        """
        self.setMode('雷针')
        self.skillRation *= 1.48
        ...



# 雷神降世 : 裁决
# swordman_male/asura/087d1068ff506d090710566608a17760
# 41f1cdc2ff58bb5fdc287be0db2a8df3/087d1068ff506d090710566608a17760
class Skill23(ActiveSkill):
    """
    生成召唤阵， 强制控制周围敌人后， 雷神登场。\n
    雷神抬起手吸收周围的雷光后捶地， 雷光爆炸审判所有敌人。\n
    雷神的攻击可诱发感电， 造成光属性伤害。
    """
    name = "雷神降世 : 裁决"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [1500, 5000]
    uuid = "087d1068ff506d090710566608a17760"

    # 雷神出现时的攻击力 : {value0}
    # REMOVE: data0 = [0, 27271, 33595, 39919, 46242, 52566, 58890, 65214, 71537, 77861, 84185, 90508, 96832, 103156, 109480, 115803, 122127, 128451, 134775, 141098, 147422, 153746, 160070, 166393, 172717, 179041, 185364, 191688, 198012, 204336, 210659, 216983, 223307, 229631, 235954, 242278, 248602, 254926, 261249, 267573, 273897, 280220, 286544, 292868, 299192, 305515, 311839, 318163, 324487, 330810, 337134]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 雷光爆炸攻击力 : {value1}
    # REMOVE: data1 = [0, 49088, 60471, 71853, 83236, 94619, 106002, 117384, 128767, 140150, 151532, 162915, 174298, 185681, 197063, 208446, 219829, 231212, 242594, 253977, 265360, 276742, 288125, 299508, 310891, 322273, 333656, 345039, 356421, 367804, 379187, 390570, 401952, 413335, 424718, 436100, 447483, 458866, 470249, 481631, 493014, 504397, 515779, 527162, 538545, 549928, 561310, 572693, 584076, 595459, 606841]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 5
    # 雷光爆炸多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [感电效果]
    # 感电攻击力 : {value3}
    # REMOVE: data3 = [0, 173, 213, 253, 293, 333, 373, 413, 453, 493, 533, 573, 613, 653, 693, 733, 773, 814, 854, 894, 934, 974, 1014, 1054, 1094, 1134, 1174, 1214, 1254, 1294, 1334, 1374, 1414, 1454, 1494, 1534, 1574, 1615, 1655, 1695, 1735, 1775, 1815, 1855, 1895, 1935, 1975, 2015, 2055, 2095, 2135]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 25
    # 感电几率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 感电持续时间 : {value5}秒
    # REMOVE: data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)


# 波动视界 : 慧眼
# swordman_male/asura/854997c3bdfc3a2b498b4c4001f69e06
# 41f1cdc2ff58bb5fdc287be0db2a8df3/854997c3bdfc3a2b498b4c4001f69e06
class Skill24(PassiveSkill):
    """
    获得波动之秘技“慧眼”。\n
    增加基本攻击力和转职技能攻击力， 部分技能附加特殊效果。\n
    [修罗邪光斩]\n
    施放技能时立即以蓄气状态发动， 增加波动印生成数量。\n
    [波动爆发]\n
    可以强制中断基本攻击并立即使用[波动爆发]； 按前方向键时， 喷发波动之力， 并向前方突进。\n
    鼠标右键可开启/关闭突进功能。
    """
    name = "波动视界 : 慧眼"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    uuid = "854997c3bdfc3a2b498b4c4001f69e06"

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [修罗邪光斩]施放时波动刻印额外生成数量 : {value1}个
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    associate = [{"type":"*skillRation","data":data0}]


# 波动慧眼 : 无为法
# swordman_male/asura/61c8cb33dd20b4ff335e8deed70d3d9c
# 41f1cdc2ff58bb5fdc287be0db2a8df3/61c8cb33dd20b4ff335e8deed70d3d9c
class Skill25(ActiveSkill):
    """
    随着敌人无法看到的波动之纹移动， 并生成魔法阵后引发爆炸\n
    移动过程中， 按向前方向键， 可以向魔法阵的反方向移动。
    """
    name = "波动慧眼 : 无为法"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1067, 8000]
    uuid = "61c8cb33dd20b4ff335e8deed70d3d9c"

    # 波动之纹攻击力 : {value0}
    # REMOVE: data0 = [0, 12815, 14115, 15415, 16715, 18016, 19316, 20616, 21916, 23216, 24516, 25816, 27116, 28416, 29716, 31016, 32317, 33617, 34917, 36217, 37517, 38817, 40117, 41417, 42717, 44017, 45318, 46618, 47918, 49218, 50518, 51818, 53118, 54418, 55718, 57018, 58318, 59619, 60919, 62219, 63519, 64819, 66119, 67419, 68719, 70019, 71319, 72619, 73920, 75220, 76520]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 5
    # 波动之纹多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法阵爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 192228, 211729, 231231, 250732, 270234, 289735, 309236, 328738, 348239, 367741, 387242, 406743, 426245, 445746, 465247, 484749, 504250, 523752, 543253, 562754, 582256, 601757, 621259, 640760, 660261, 679763, 699264, 718766, 738267, 757768, 777270, 796771, 816273, 835774, 855275, 874777, 894278, 913779, 933281, 952782, 972284, 991785, 1011286, 1030788, 1050289, 1069791, 1089292, 1108793, 1128295, 1147796]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1


# 波动神诀 : 万空
# swordman_male/asura/94c450d6214cafdc673f763badceeaf1
# 41f1cdc2ff58bb5fdc287be0db2a8df3/94c450d6214cafdc673f763badceeaf1
class Skill26(ActiveSkill):
    """
    阿修罗使用“慧眼”， 看到波动的流动， 掌握所有生命体的弱点。\n
    利用雷神之力凝聚成剑后下斩， 闪电沿着波纹向四方扩散后引发光属性爆炸。\n
    [三次觉醒技能]\n
    选择[暗天波动眼]使用三次觉醒技能时， [暗天波动眼]的最后天眼爆炸变更为三次觉醒技能。 三次觉醒技能在冷却中或[暗天波动眼]未激活的状态下， 无法使用三次觉醒技能。\n
    选择[雷神降世 : 裁决]使用三次觉醒技能时， 与[雷神降世 : 裁决]共享冷却时间。 [雷神降世 : 裁决]在冷却中时， 无法使用三次觉醒技能。
    """
    name = "波动神诀 : 万空"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "94c450d6214cafdc673f763badceeaf1"

    # 雷剑生成冲击波攻击力 : {value0}
    # REMOVE: data0 = [0, 215097, 264974, 314852, 364729, 414607, 464484, 514362, 564239, 614117, 663994, 713872, 763749, 813627, 863504, 913382, 963259, 1013137, 1063014, 1112892, 1162769, 1212647, 1262524, 1312402, 1362279, 1412157, 1462034, 1511912, 1561789, 1611667, 1661544, 1711422, 1761299, 1811177, 1861054, 1910932, 1960810, 2010687, 2060565, 2110442, 2160320, 2210197, 2260075, 2309952, 2359830, 2409707, 2459585, 2509462, 2559340, 2609217, 2659095]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 闪电攻击力 : {value1}
    # REMOVE: data1 = [0, 35849, 44162, 52475, 60788, 69101, 77414, 85727, 94040, 102353, 110666, 118979, 127292, 135604, 143917, 152230, 160543, 168856, 177169, 185482, 193795, 202108, 210421, 218734, 227047, 235359, 243672, 251985, 260298, 268611, 276924, 285237, 293550, 301863, 310176, 318489, 326802, 335115, 343427, 351740, 360053, 368366, 376679, 384992, 393305, 401618, 409931, 418244, 426557, 434870, 443182]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 6
    # 闪电多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 波动爆炸攻击力 : {value3}
    # REMOVE: data3 = [0, 107548, 132487, 157426, 182365, 207303, 232242, 257181, 282120, 307058, 331997, 356936, 381875, 406813, 431752, 456691, 481630, 506568, 531507, 556446, 581385, 606323, 631262, 656201, 681140, 706078, 731017, 755956, 780895, 805833, 830772, 855711, 880650, 905588, 930527, 955466, 980405, 1005344, 1030282, 1055221, 1080160, 1105099, 1130037, 1154976, 1179915, 1204854, 1229792, 1254731, 1279670, 1304609, 1329547]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 2
    # 波动爆炸攻击次数 : 2次
    # 闪电爆炸攻击力 : {value4}
    # REMOVE: data4 = [0, 215097, 264974, 314852, 364729, 414607, 464484, 514362, 564239, 614117, 663994, 713872, 763749, 813627, 863504, 913382, 963259, 1013137, 1063014, 1112892, 1162769, 1212647, 1262524, 1312402, 1362279, 1412157, 1462034, 1511912, 1561789, 1611667, 1661544, 1711422, 1761299, 1811177, 1861054, 1910932, 1960810, 2010687, 2060565, 2110442, 2160320, 2210197, 2260075, 2309952, 2359830, 2409707, 2459585, 2509462, 2559340, 2609217, 2659095]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 1

class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'asura'
        self.nameCN = '极诣·阿修罗'
        self.role = 'swordman_male'
        self.角色 = '鬼剑士(男)'
        self.职业 = '阿修罗'
        self.jobId = '41f1cdc2ff58bb5fdc287be0db2a8df3'
        self.jobGrowId = 'c9b492038ee3ca8d27d7004cf58d59f3'

        self.武器选项 = ['太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['魔法固伤']
        self.输出类型 = '魔法固伤'
        self.防具精通属性 = ['智力']
        self.防具类型 = '板甲'
        self.buff = 1.638

        super().__init__(equVersion, __name__)

