#41f1cdc2ff58bb5fdc287be0db2a8df3
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "swordman_male/berserker/cn/skillDetail"

# 血气旺盛
# swordman_male/berserker/d296043df164385a14cb973c8c7c4d07
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d296043df164385a14cb973c8c7c4d07
class Skill2(PassiveSkill):
    """
    施放[十字刃]时， 用生命值的消减来代替魔法值消减， 并增加召唤出的十字的大小。\n
    包括[十字刃]与[崩山击]在内的转职后技能新增出血效果。
    """
    name = "血气旺盛"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "d296043df164385a14cb973c8c7c4d07"
    hasVP = False
    hasUP = False

    # [十字刃]攻击范围增加 : {value0}%
    # REMOVE: data0 = [0, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 出血几率 : {value1}%
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 出血持续时间 : {value2}秒
    # REMOVE: data2 = [0, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 出血攻击力 : {value3}
    # REMOVE: data3 = [0, 14]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 崩山击
# swordman_male/berserker/6e33d47e6622ce03b6defdd912140270
# 41f1cdc2ff58bb5fdc287be0db2a8df3/6e33d47e6622ce03b6defdd912140270
class Skill13(ActiveSkill):
    """
    向前低跃并用武器砸击地面， 对敌人造成多段攻击伤害， 最后一击可以使敌人倒地。\n
    跳跃距离和冲击波范围会随技能键按放间隔长短而改变。\n
    转职为狂战士后， 可以强制中断基本攻击动作， 并立即施放该技能。
    """
    name = "崩山击"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cd = 4
    mp = [17, 150]
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 下砸攻击力 : {value0}
    # REMOVE: data0 = [0, 340, 374, 409, 443, 478, 512, 547, 581, 616, 650, 685, 719, 754, 788, 823, 857, 892, 926, 961, 995, 1030, 1064, 1099, 1133, 1168, 1202, 1237, 1271, 1306, 1340, 1375, 1409, 1444, 1478, 1513, 1547, 1582, 1616, 1651, 1685, 1720, 1754, 1789, 1823, 1858, 1892, 1927, 1961, 1996, 2030, 2065, 2099, 2134, 2168, 2203, 2237, 2272, 2306, 2341, 2375, 2410, 2444, 2479, 2513, 2548, 2582, 2617, 2651, 2686, 2720]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 3 # 3.4
    # 下砸多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 冲击波攻击力 : {value2}
    # REMOVE: data2 = [0, 1919, 2114, 2308, 2503, 2698, 2892, 3087, 3282, 3477, 3671, 3866, 4061, 4255, 4450, 4645, 4839, 5034, 5229, 5423, 5618, 5813, 6007, 6202, 6397, 6591, 6786, 6981, 7175, 7370, 7565, 7760, 7954, 8149, 8344, 8538, 8733, 8928, 9122, 9317, 9512, 9706, 9901, 10096, 10290, 10485, 10680, 10874, 11069, 11264, 11459, 11653, 11848, 12043, 12237, 12432, 12627, 12821, 13016, 13211, 13405, 13600, 13795, 13989, 14184, 14379, 14573, 14768, 14963, 15158, 15352]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # [范围信息]
    # 冲击波范围比率 : {value3} ~ {value4}%
    # REMOVE: data3 = [0, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # REMOVE: data4 = [0, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192, 192]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)


# 狂暴血气
# swordman_male/berserker/2f5d03c7848effbc0a23f4df45d9ca46
# 41f1cdc2ff58bb5fdc287be0db2a8df3/2f5d03c7848effbc0a23f4df45d9ca46
class Skill17(PassiveSkill):
    """
    进入狂暴血气状态， 乱刀攻击敌人。\n
    激活该技能后， [狂暴之力]下的基本攻击会一直反复第一击和第二击。\n
    可使用右键点击技能On/Off技能特效。
    """
    name = "狂暴血气"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 5
    rangeLv = 3
    uuid = "2f5d03c7848effbc0a23f4df45d9ca46"
    hasVP = False
    hasUP = False


# 力量唤醒
# swordman_male/berserker/42c82812f86ff6704ae9952a2e6093a4
# 41f1cdc2ff58bb5fdc287be0db2a8df3/42c82812f86ff6704ae9952a2e6093a4
class Skill22(PassiveSkill):
    """
    增加技能攻击力、 攻击速度和移动速度。\n
    生命值越低增加的值越大， 且根据剩余生命值的比例阶段性增加。
    """
    name = "力量唤醒"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 7
    rangeLv = 3
    uuid = "42c82812f86ff6704ae9952a2e6093a4"
    hasVP = False
    hasUP = False

    # 技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 28.7, 30.7, 32.7, 34.7, 36.7, 38.7, 40.7, 42.7, 44.7, 46.7, 48.7, 50.7, 52.7, 54.7, 56.7, 58.7, 60.7, 62.7, 64.7, 66.7]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 攻击速度增加率 : {value1}%
    # REMOVE: data1 = [0, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 移动速度增加率 : {value2}%
    # REMOVE: data2 = [0, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [力量唤醒1阶段]
    # 发动的生命值比率 : {value3}%
    # REMOVE: data3 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 攻击速度增加率 : {value4}%
    # REMOVE: data4 = [0, 11.2, 11.4, 11.6, 11.8, 12, 12.2, 12.4, 12.6, 12.8, 13, 13.2, 13.4, 13.6, 13.8, 14, 14.2, 14.4, 14.6, 14.8, 15]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 移动速度增加率 : {value5}%
    # REMOVE: data5 = [0, 11.2, 11.4, 11.6, 11.8, 12, 12.2, 12.4, 12.6, 12.8, 13, 13.2, 13.4, 13.6, 13.8, 14, 14.2, 14.4, 14.6, 14.8, 15]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 回避率增加率 : {value6}%
    # REMOVE: data6 = [0, 0.5, 0.5, 0.6, 0.6, 0.6, 0.7, 0.7, 0.7, 0.8, 0.8, 0.9, 0.9, 0.9, 1, 1, 1, 1.1, 1.1, 1.2, 1.2]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # [力量唤醒2阶段]
    # 发动的生命值比率 : {value7}%
    # REMOVE: data7 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 攻击速度增加率 : {value8}%
    # REMOVE: data8 = [0, 11.6, 12, 12.4, 12.8, 13.2, 13.6, 14, 14.4, 14.8, 15.2, 15.6, 16, 16.4, 16.8, 17.2, 17.6, 18, 18.4, 18.8, 19.2]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 移动速度增加率 : {value9}%
    # REMOVE: data9 = [0, 11.6, 12, 12.4, 12.8, 13.2, 13.6, 14, 14.4, 14.8, 15.2, 15.6, 16, 16.4, 16.8, 17.2, 17.6, 18, 18.4, 18.8, 19.2]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 回避率增加率 : {value10}%
    # REMOVE: data10 = [0, 2.7, 3, 3.2, 3.4, 3.6, 3.9, 4.1, 4.3, 4.5, 4.8, 5, 5.2, 5.4, 5.7, 5.9, 6.1, 6.3, 6.6, 6.8, 7]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # [力量唤醒3阶段]
    # 发动的生命值比率 : {value11}%
    # REMOVE: data11 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 攻击速度增加率 : {value12}%
    # REMOVE: data12 = [0, 12, 12.6, 13.2, 13.8, 14.4, 15, 15.6, 16.2, 16.8, 17.4, 18, 18.6, 19.2, 19.8, 20.4, 21, 21.6, 22.2, 22.8, 23.4]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 移动速度增加率 : {value13}%
    # REMOVE: data13 = [0, 12, 12.6, 13.2, 13.8, 14.4, 15, 15.6, 16.2, 16.8, 17.4, 18, 18.6, 19.2, 19.8, 20.4, 21, 21.6, 22.2, 22.8, 23.4]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)
    # 回避率增加率 : {value14}%
    # REMOVE: data14 = [0, 4.5, 4.9, 5.3, 5.7, 6, 6.4, 6.8, 7.2, 7.5, 7.9, 8.3, 8.7, 9, 9.4, 9.8, 10.2, 10.5, 10.9, 11.3, 11.7]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14)

    associate = [{"data":data0}]

# 十字刃
# swordman_male/berserker/ca75c965f20a150f99f54155a37400df
# 41f1cdc2ff58bb5fdc287be0db2a8df3/ca75c965f20a150f99f54155a37400df
class Skill24(ActiveSkill):
    """
    挥动武器向敌人发出十字形攻击， 并召唤出十字攻击敌人。\n
    若已学习[血气旺盛]， 则施放技能时用生命值的消耗来代替魔法值消耗， 并且使被击中的敌人进入出血状态。\n
    转职为狂战士后， 可以强制中断其他动作并立即施放该技能。 若在召唤十字的瞬间按技能键， 可以发动可击退敌人的强力追击。\n
    [学习血气界限后]\n
    删除斩击和追加按键功能； 发动交叉斩击， 向前方发射十字。
    """
    name = "十字刃"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cd = 6
    mp = [58, 249]
    uuid = "ca75c965f20a150f99f54155a37400df"
    hasVP = False
    hasUP = True

    # 斩击攻击力 : {value0}
    # REMOVE: data0 = [0, 651, 717, 783, 849, 915, 981, 1047, 1113, 1179, 1245, 1311, 1377, 1443, 1509, 1575, 1641, 1708, 1774, 1840, 1906, 1972, 2038, 2104, 2170, 2236, 2302, 2368, 2434, 2500, 2566, 2632, 2698, 2764, 2830, 2896, 2962, 3028, 3094, 3160, 3226, 3292, 3358, 3424, 3491, 3557, 3623, 3689, 3755, 3821, 3887, 3953, 4019, 4085, 4151, 4217, 4283, 4349, 4415, 4481, 4547, 4613, 4679, 4745, 4811, 4877, 4943, 5009, 5075, 5141, 5207]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 2
    # 斩击次数 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 血十字攻击力 : {value2}
    # REMOVE: data2 = [0, 1508, 1661, 1814, 1967, 2120, 2273, 2426, 2579, 2732, 2885, 3038, 3191, 3344, 3497, 3650, 3803, 3956, 4109, 4262, 4415, 4568, 4721, 4874, 5027, 5180, 5333, 5486, 5639, 5792, 5945, 6098, 6251, 6404, 6557, 6710, 6863, 7016, 7169, 7322, 7475, 7628, 7781, 7934, 8087, 8240, 8393, 8546, 8699, 8852, 9005, 9158, 9311, 9464, 9617, 9770, 9923, 10076, 10229, 10382, 10535, 10688, 10841, 10994, 11147, 11300, 11453, 11606, 11759, 11912, 12065]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 追击攻击力 : {value3}
    # REMOVE: data3 = [0, 1593, 1755, 1916, 2078, 2239, 2401, 2563, 2724, 2886, 3047, 3209, 3371, 3532, 3694, 3855, 4017, 4179, 4340, 4502, 4664, 4825, 4987, 5148, 5310, 5472, 5633, 5795, 5956, 6118, 6280, 6441, 6603, 6764, 6926, 7088, 7249, 7411, 7572, 7734, 7896, 8057, 8219, 8381, 8542, 8704, 8865, 9027, 9189, 9350, 9512, 9673, 9835, 9997, 10158, 10320, 10481, 10643, 10805, 10966, 11128, 11289, 11451, 11613, 11774, 11936, 12097, 12259, 12421, 12582, 12744]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1
    # 学习[血气旺盛]后生命值消耗量 : {value4}
    # REMOVE: data4 = [0, 4, 6, 8, 9, 10, 13, 14, 16, 17, 19, 20, 23, 25, 28, 30, 31, 33, 35, 38, 41, 47, 54, 60, 65, 71, 76, 82, 87, 93, 100, 108, 115, 123, 130, 138, 145, 153, 160, 168, 175, 183, 190, 198, 205, 213, 220, 228, 235, 243, 250, 227, 232, 238, 243, 248, 253, 258, 264, 269, 274, 279, 284, 290, 295, 300, 305, 310, 316, 321, 326]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 学习[血气界限]后
    # 血十字攻击力 : {value5}
    # REMOVE: data5 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [范围信息]
    # 血十字大小比率 : {value6}%
    # REMOVE: data6 = [0, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

# 狂暴之力
# swordman_male/berserker/6a1d1f08a6572be420bb3a256c44c015
# 41f1cdc2ff58bb5fdc287be0db2a8df3/6a1d1f08a6572be420bb3a256c44c015
class Skill25(ActiveSkill):
    """
    施放[狂暴之力]后， 每隔一段时间会消耗一定量的生命值， 提升命中率和硬直， 同时增加基本攻击力和[崩山击]、 [十字刃]等狂战士转职技能的攻击力， 并减少冷却时间。\n
    基本攻击会转变成二刀流攻击。\n
    [连突刺]、 [空之连刃]变更为独立攻击力。\n
    若击败出血状态的敌人， 则可以恢复自身一定量的生命值。\n
    可以通过On/Off激活或关闭技能。\n
    [狂暴之力]处于On状态时， 进入地下城或复活时将自动施放[狂暴之力]。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "狂暴之力"
    learnLv = 15
    masterLv = 20
    maxLv = 30
    position = 4
    rangeLv = 3
    cd = 10
    mp = [10, 35]
    uuid = "6a1d1f08a6572be420bb3a256c44c015"
    hasVP = False
    hasUP = False

    # 施放时生命值消耗量 : {value0}
    # REMOVE: data0 = [0, 220, 244, 267, 291, 315, 338, 362, 386, 409, 438, 470, 501, 532, 563, 595, 625, 657, 688, 719, 750, 782, 812, 844, 875, 906, 937, 969, 999, 1031, 1062]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 每10秒生命值消耗量 : {value1}
    # REMOVE: data1 = [0, 75, 87, 99, 111, 122, 134, 146, 158, 170, 182, 193, 205, 217, 229, 241, 253, 264, 276, 288, 300, 312, 324, 336, 347, 359, 371, 383, 395, 407, 418]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.2, 0.4, 0.6, 0.9, 1.1, 1.3, 1.5, 1.8, 2, 2.2, 2.4, 2.7, 2.9, 3.1, 3.3, 3.6, 3.8, 4, 4.2, 4.4, 4.7, 4.9, 5.1, 5.3, 5.6, 5.8, 6, 6.2, 6.5, 6.7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 硬直增加量 : {value3}
    # REMOVE: data3 = [0, 10, 21, 32, 44, 55, 66, 77, 88, 99, 111, 122, 133, 144, 155, 166, 178, 189, 200, 211, 222, 234, 245, 256, 267, 278, 289, 301, 312, 323, 334]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 基本攻击力和技能攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21.5, 23, 24.5, 26, 27.5, 29, 30.5, 32, 33.5, 35]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 转职系列技能冷却时间减少率 : {value5}% (觉醒技能除外)
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 生命值吸收量上限 : {value6}
    # REMOVE: data6 = [0, 2, 3, 4, 4, 5, 6, 7, 9, 10, 12, 13, 15, 17, 19, 22, 24, 27, 30, 33, 36, 40, 44, 48, 52, 56, 61, 66, 72, 77, 83]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

    associate = [
        {"data": data4, "type": '*skillRation'},
        {'data': data5, 'type': '*cdReduce', 'exceptSkills': ['魔狱血刹', '血魔·弑天', '血魔 : 极道灭世']}
    ]

# 死亡抗拒
# swordman_male/berserker/1dad88963abdc96b091fcab185a8820d
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1dad88963abdc96b091fcab185a8820d
class Skill27(ActiveSkill):
    """
    恢复自身一定量的生命值并增加物理/魔法防御力和硬直， 效果持续一定时间， 但只能在自身生命值较低时施放。
    """
    name = "死亡抗拒"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 6
    rangeLv = 3
    cd = 10
    mp = [40, 448]
    uuid = "1dad88963abdc96b091fcab185a8820d"
    hasVP = False
    hasUP = False

    # 恢复时间 : {value0}秒
    # REMOVE: data0 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 生命值恢复 : {value1}%
    # REMOVE: data1 = [0, 20, 21.5, 23, 24.5, 26, 27.5, 29, 30.5, 32, 33.5, 35]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 增加物防 : {value2}
    # REMOVE: data2 = [0, 8382, 9011, 9664, 10338, 11035, 11755, 12498, 13264, 14051, 14862, 15696]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 增加魔防 : {value3}
    # REMOVE: data3 = [0, 8382, 9011, 9664, 10338, 11035, 11755, 12498, 13264, 14051, 14862, 15696]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 增加硬直 : {value4}
    # REMOVE: data4 = [0, 373, 385, 398, 410, 424, 436, 449, 461, 474, 486, 499]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 持续时间 : {value5}秒
    # REMOVE: data5 = [0, 31, 32.1, 33.1, 34.2, 35.2, 36.3, 37.3, 38.4, 39.4, 40.5, 41.5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 可发动技能的生命值比率 : {value6}%
    # REMOVE: data6 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

# 狂气斩
# swordman_male/berserker/bbc15561bec24f9c1e79e23d715b1dd2
# 41f1cdc2ff58bb5fdc287be0db2a8df3/bbc15561bec24f9c1e79e23d715b1dd2
class Skill29(ActiveSkill):
    """
    只能在[狂暴之力]状态下使用。\n
    用双手的剑斩击敌人。 斩击过程中再次按技能键时， 可以额外攻击1次。\n
    按前方向键时， 可以向前滑行并施放技能， 按后方向键则往反方向施放。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "狂气斩"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cd = 6
    mp = [62, 266]
    uuid = "bbc15561bec24f9c1e79e23d715b1dd2"
    hasVP = False
    hasUP = True

    # 第一次斩击攻击力 : {value0}
    # REMOVE: data0 = [0, 1125, 1239, 1353, 1467, 1582, 1696, 1810, 1924, 2038, 2152, 2266, 2380, 2495, 2609, 2723, 2837, 2951, 3065, 3179, 3294, 3408, 3522, 3636, 3750, 3864, 3978, 4092, 4207, 4321, 4435, 4549, 4663, 4777, 4891, 5006, 5120, 5234, 5348, 5462, 5576, 5690, 5804, 5919, 6033, 6147, 6261, 6375, 6489, 6603, 6718, 6832, 6946, 7060, 7174, 7288, 7402, 7516, 7631, 7745, 7859, 7973, 8087, 8201, 8315, 8430, 8544, 8658, 8772, 8886, 9000]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 2
    # 第一次斩击多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 第二次斩击攻击力 : {value2}
    # REMOVE: data2 = [0, 1603, 1766, 1928, 2091, 2253, 2416, 2579, 2741, 2904, 3067, 3229, 3392, 3554, 3717, 3880, 4042, 4205, 4368, 4530, 4693, 4855, 5018, 5181, 5343, 5506, 5668, 5831, 5994, 6156, 6319, 6482, 6644, 6807, 6969, 7132, 7295, 7457, 7620, 7783, 7945, 8108, 8270, 8433, 8596, 8758, 8921, 9084, 9246, 9409, 9571, 9734, 9897, 10059, 10222, 10384, 10547, 10710, 10872, 11035, 11198, 11360, 11523, 11685, 11848, 12011, 12173, 12336, 12499, 12661, 12824]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 2
    # 第二次斩击多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 嗜魂之手
# swordman_male/berserker/3829c15bf5f520c13998a3479ba0ce7b
# 41f1cdc2ff58bb5fdc287be0db2a8df3/3829c15bf5f520c13998a3479ba0ce7b
class Skill30(ActiveSkill):
    """
    抓取前方一名敌人并吸进其血气后， 再把吸进的血气喷发， 对敌人造成伤害。\n
    对出血状态的敌人施放时， 可以造成更多伤害。\n
    对无法抓取的敌人不适用控制效果。\n
    [转职为狂战士后]\n
    在[饥渴]状态下， 可增加吸血次数。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。\n
    学习[血气界限]后， 血气喷发范围变更为全方位； 即使未抓住敌人， 也可以生成血块后使其爆炸。
    """
    name = "嗜魂之手"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cd = 6
    mp = [37, 290]
    uuid = "3829c15bf5f520c13998a3479ba0ce7b"
    hasVP = False
    hasUP = True

    # 抓取攻击力 : {value0}
    # REMOVE: data0 = [0, 1032, 1137, 1241, 1346, 1451, 1555, 1660, 1765, 1869, 1974, 2079, 2183, 2288, 2393, 2497, 2602, 2707, 2811, 2916, 3021, 3126, 3230, 3335, 3440, 3544, 3649, 3754, 3858, 3963, 4068, 4172, 4277, 4382, 4486, 4591, 4696, 4800, 4905, 5010, 5114, 5219, 5324, 5429, 5533, 5638, 5743, 5847, 5952, 6057, 6161, 6266, 6371, 6475, 6580, 6685, 6789, 6894, 6999, 7103, 7208, 7313, 7417, 7522, 7627, 7732, 7836, 7941, 8046, 8150, 8255]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 喷发攻击力 : {value1}
    # REMOVE: data1 = [0, 1952, 2150, 2348, 2546, 2744, 2942, 3140, 3338, 3536, 3735, 3933, 4131, 4329, 4527, 4725, 4923, 5121, 5319, 5517, 5715, 5913, 6111, 6309, 6507, 6705, 6903, 7101, 7299, 7497, 7695, 7893, 8091, 8289, 8488, 8686, 8884, 9082, 9280, 9478, 9676, 9874, 10072, 10270, 10468, 10666, 10864, 11062, 11260, 11458, 11656, 11854, 12052, 12250, 12448, 12646, 12844, 13043, 13241, 13439, 13637, 13835, 14033, 14231, 14429, 14627, 14825, 15023, 15221, 15419, 15617]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 抓取出血状态的敌人时追加攻击力 : {value2}
    # REMOVE: data2 = [0, 3341, 3680, 4019, 4358, 4697, 5036, 5375, 5714, 6053, 6392, 6731, 7070, 7409, 7748, 8087, 8426, 8765, 9104, 9442, 9781, 10120, 10459, 10798, 11137, 11476, 11815, 12154, 12493, 12832, 13171, 13510, 13849, 14188, 14527, 14866, 15205, 15544, 15883, 16222, 16561, 16900, 17239, 17578, 17916, 18255, 18594, 18933, 19272, 19611, 19950, 20289, 20628, 20967, 21306, 21645, 21984, 22323, 22662, 23001, 23340, 23679, 24018, 24357, 24696, 25035, 25374, 25713, 26052, 26391, 26729]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 饥渴状态下吸收次数变化值 : {value3}次
    # REMOVE: data3 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 攻击无法抓取敌人时的喷发攻击力 : {value4}
    # REMOVE: data4 = [0, 5392, 5939, 6486, 7033, 7580, 8127, 8674, 9221, 9768, 10315, 10862, 11409, 11956, 12503, 13050, 13597, 14144, 14691, 15239, 15786, 16333, 16880, 17427, 17974, 18521, 19068, 19615, 20162, 20709, 21256, 21803, 22350, 22897, 23444, 23991, 24538, 25085, 25632, 26179, 26726, 27273, 27820, 28367, 28914, 29461, 30008, 30555, 31102, 31649, 32196, 32743, 33290, 33837, 34384, 34931, 35478, 36025, 36572, 37119, 37666, 38213, 38761, 39308, 39855, 40402, 40949, 41496, 42043, 42590, 43137]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 0
    # [学习血气界限后]
    # 抓取攻击力 : {value5}
    # REMOVE: data5 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 气息爆炸攻击力 : {value6}
    # REMOVE: data6 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 抓取失败时， 攻击无法抓取敌人时的气息爆炸攻击力 : {value7}
    # REMOVE: data7 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [范围信息]
    # 喷发范围比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)

    mode = ['不可抓取','可抓取']

    def setMode(self, mode):
        if mode == '可抓取':
            self.hit0 = self.hit1 = self.hit2 = 1
            self.hit4 = 0
        if mode == '不可抓取':
            self.hit0 = self.hit1 = self.hit2 = 0
            self.hit4 = 1


# 暴走
# swordman_male/berserker/0ed3148658fe37b3336ccb718dc0fdb0
# 41f1cdc2ff58bb5fdc287be0db2a8df3/0ed3148658fe37b3336ccb718dc0fdb0
class Skill31(ActiveSkill):
    """
    使自身进入暴走状态， 可以增加技能攻击力、 移动速度、 攻击速度、 眩晕和睡眠异常状态抗性和硬直， 效果持续一定时间； 但自身的智力、 物防、 魔防将减少。\n
    暴走状态下， 增加[狂暴之力]基本攻击和[崩山击]、 [十字刃]技能的僵直度， 减少动作延迟。
    """
    name = "暴走"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 6
    rangeLv = 3
    cd = 5
    uuid = "0ed3148658fe37b3336ccb718dc0fdb0"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击速度增加量 : {value2}%
    # REMOVE: data2 = [0, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 移动速度增加量 : {value3}%
    # REMOVE: data3 = [0, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 眩晕、 睡眠异常状态抗性增加量 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 智力减少量 : {value5}
    # REMOVE: data5 = [0, 105, 109, 113, 116, 120, 124, 128, 131, 135, 139, 143, 146, 150, 154, 158, 161, 165, 169, 173, 176]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 物理防御力减少量 : {value6}%
    # REMOVE: data6 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 魔法防御力减少量 : {value7}%
    # REMOVE: data7 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 硬直增加 : {value8}
    # REMOVE: data8 = [0, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # [十字刃]、 [崩山击]、 [狂暴之力]基本攻击僵直增加 : {value9}%
    # REMOVE: data9 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # [十字刃]、 [崩山击]、 [狂暴之力]基本攻击动作延迟减少 : {value10}%
    # REMOVE: data10 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)

# 怒气爆发
# swordman_male/berserker/506e7ed77d517419a6e1c437a2cedb17
# 41f1cdc2ff58bb5fdc287be0db2a8df3/506e7ed77d517419a6e1c437a2cedb17
class Skill32(ActiveSkill):
    """
    向自身周围的敌人爆发怒气， 使周围的敌人受到一定的物理伤害并浮空。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "怒气爆发"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 4
    rangeLv = 2
    cd = 13
    mp = [142, 607]
    uuid = "506e7ed77d517419a6e1c437a2cedb17"
    hasVP = False
    hasUP = True

    # 冲击波攻击力 : {value0}
    # REMOVE: data0 = [0, 2356, 2595, 2834, 3073, 3312, 3551, 3789, 4028, 4267, 4506, 4745, 4984, 5223, 5462, 5701, 5940, 6179, 6418, 6657, 6896, 7135, 7374, 7613, 7852, 8091, 8330, 8569, 8808, 9047, 9286, 9525, 9764, 10003, 10242, 10481, 10720, 10959, 11198, 11437, 11676, 11915, 12154, 12393, 12632, 12871, 13110, 13349, 13587, 13826, 14065, 14304, 14543, 14782, 15021, 15260, 15499, 15738, 15977, 16216, 16455, 16694, 16933, 17172, 17411, 17650, 17889, 18128, 18367, 18606, 18845]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 血气喷发攻击力 : {value1}
    # REMOVE: data1 = [0, 898, 989, 1080, 1171, 1262, 1354, 1445, 1536, 1627, 1718, 1809, 1900, 1991, 2082, 2174, 2265, 2356, 2447, 2538, 2629, 2720, 2811, 2902, 2993, 3085, 3176, 3267, 3358, 3449, 3540, 3631, 3722, 3813, 3905, 3996, 4087, 4178, 4269, 4360, 4451, 4542, 4633, 4724, 4816, 4907, 4998, 5089, 5180, 5271, 5362, 5453, 5544, 5636, 5727, 5818, 5909, 6000, 6091, 6182, 6273, 6364, 6455, 6547, 6638, 6729, 6820, 6911, 7002, 7093, 7184]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 10
    # 血气喷发多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 范围比率 : {value3}%
    # REMOVE: data3 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 狂热回旋
# swordman_male/berserker/de20372767d014d62dc7361ac686834e
# 41f1cdc2ff58bb5fdc287be0db2a8df3/de20372767d014d62dc7361ac686834e
class Skill33(ActiveSkill):
    """
    挥剑将两边的敌人吸附到自己的前方后， 在原地使用回旋上斩击飞敌人。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "狂热回旋"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 6
    rangeLv = 2
    cd = 10
    mp = [110, 467]
    uuid = "de20372767d014d62dc7361ac686834e"
    hasVP = False
    hasUP = True

    # 第一次吸附攻击力 : {value0}
    # REMOVE: data0 = [0, 1867, 2056, 2246, 2435, 2625, 2814, 3003, 3193, 3382, 3572, 3761, 3950, 4140, 4329, 4519, 4708, 4897, 5087, 5276, 5466, 5655, 5844, 6034, 6223, 6413, 6602, 6791, 6981, 7170, 7360, 7549, 7738, 7928, 8117, 8306, 8496, 8685, 8875, 9064, 9253, 9443, 9632, 9822, 10011, 10200, 10390, 10579, 10769, 10958, 11147, 11337, 11526, 11716, 11905, 12094, 12284, 12473, 12663, 12852, 13041, 13231, 13420, 13610, 13799, 13988, 14178, 14367, 14557, 14746, 14935]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 第二次吸附攻击力 : {value1}
    # REMOVE: data1 = [0, 1867, 2056, 2246, 2435, 2625, 2814, 3003, 3193, 3382, 3572, 3761, 3950, 4140, 4329, 4519, 4708, 4897, 5087, 5276, 5466, 5655, 5844, 6034, 6223, 6413, 6602, 6791, 6981, 7170, 7360, 7549, 7738, 7928, 8117, 8306, 8496, 8685, 8875, 9064, 9253, 9443, 9632, 9822, 10011, 10200, 10390, 10579, 10769, 10958, 11147, 11337, 11526, 11716, 11905, 12094, 12284, 12473, 12663, 12852, 13041, 13231, 13420, 13610, 13799, 13988, 14178, 14367, 14557, 14746, 14935]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 上斩物理攻击力 : {value2}
    # REMOVE: data2 = [0, 5603, 6172, 6740, 7308, 7877, 8445, 9014, 9582, 10151, 10719, 11287, 11856, 12424, 12993, 13561, 14130, 14698, 15267, 15835, 16403, 16972, 17540, 18109, 18677, 19246, 19814, 20382, 20951, 21519, 22088, 22656, 23225, 23793, 24361, 24930, 25498, 26067, 26635, 27204, 27772, 28340, 28909, 29477, 30046, 30614, 31183, 31751, 32320, 32888, 33456, 34025, 34593, 35162, 35730, 36299, 36867, 37435, 38004, 38572, 39141, 39709, 40278, 40846, 41414, 41983, 42551, 43120, 43688, 44257, 44825]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 饥渴
# swordman_male/berserker/547ab2b2bd860d3e37355a9cfbc1077c
# 41f1cdc2ff58bb5fdc287be0db2a8df3/547ab2b2bd860d3e37355a9cfbc1077c
class Skill34(ActiveSkill):
    """
    长按技能键进行蓄气， 每次蓄气都会消耗生命值， 进入饥渴状态。\n
    进入[饥渴]状态时生成攻击波。 被冲击波攻击的敌人进入出血状态。\n
    在[饥渴]状态下， 大幅度提升基本攻击力和[崩山击]、 [十字刃]等狂战士转职技能的攻击力。
    """
    name = "饥渴"
    learnLv = 35
    masterLv = 10
    maxLv = 20
    position = 3
    rangeLv = 3
    cd = 5
    uuid = "547ab2b2bd860d3e37355a9cfbc1077c"
    hasVP = False
    hasUP = False

    # 基本生命值减少 : {value0}%
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 蓄气每阶段生命值减少 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 持续时间 : {value2}秒
    # REMOVE: data2 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 基本攻击力和技能攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # - [使用饥渴时冲击波] -
    # 出血攻击力 : {value4}
    # REMOVE: data4 = [0, 14, 16, 18, 21, 23, 25, 27, 30, 32, 34, 36, 39, 41, 43, 45, 47, 50, 52, 54, 56]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 出血持续时间 : {value5}秒
    # REMOVE: data5 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 出血诱发范围 : {value6}px
    # REMOVE: data6 = [0, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    associate = [{"data":data3}]

# 嗜魂封魔斩
# swordman_male/berserker/1b1cfab062e0768bcc889e33e1f30dbf
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1b1cfab062e0768bcc889e33e1f30dbf
class Skill35(ActiveSkill):
    """
    只能在[狂暴之力]已施放的状态下使用。\n
    用旋风把前方敌人吸附到近身处， 强力击打敌人并将其击飞。\n
    对无法抓取的敌人不适用控制效果。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "嗜魂封魔斩"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [323, 1377]
    uuid = "1b1cfab062e0768bcc889e33e1f30dbf"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 击打攻击力 : {value0}
    # REMOVE: data0 = [0, 18225, 20074, 21923, 23772, 25621, 27470, 29318, 31167, 33016, 34865, 36714, 38563, 40412, 42261, 44110, 45959, 47808, 49657, 51505, 53354, 55203, 57052, 58901, 60750, 62599, 64448, 66297, 68146, 69995, 71843, 73692, 75541, 77390, 79239, 81088, 82937, 84786, 86635, 88484, 90333, 92182, 94030, 95879, 97728, 99577, 101426, 103275, 105124, 106973, 108822, 110671, 112520, 114368, 116217, 118066, 119915, 121764, 123613, 125462, 127311, 129160, 131009, 132858, 134707, 136555, 138404, 140253, 142102, 143951, 145800]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # [范围信息]
    # 击打范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [嗜魂封魔斩]\n
        变更为全方位吸附敌人\n
        斩击时将周围的敌人推向前方\n
        吸附敌人时， 可以预输入[浴血之怒]或[致命血陨]技能\n
         - 代替斩击发动预输入的技能\n
         - [浴血之怒]或[致命血陨]的最后一击会合算斩击的伤害\n
        吸附到敌人时， 恢复7%生命值
        """
        ...

    def vp_2(self):
        """
        [嗜魂封魔斩]\n
        长按技能键时， 可以维持吸附后斩击的准备动作\n
         - 最多可以维持5秒\n
        发动斩击前为止， 所受伤害 -80%\n
        可以强制中断斩击后僵直， 并施放包括格挡在内的其他攻击技能\n
        吸附范围和斩击范围 +30%
        """
        ...

# 暴怒狂斩
# swordman_male/berserker/e36ae35f8964d92e30e33529a65544d7
# 41f1cdc2ff58bb5fdc287be0db2a8df3/e36ae35f8964d92e30e33529a65544d7
class Skill36(ActiveSkill):
    """
    只能在[狂暴之力]状态下使用。\n
    用武器下劈， 使敌人浮空后发动二刀流乱砍攻击。\n
    每次挥动武器时， 在空中留下剑痕， 最后与剑痕一起撕裂敌人。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "暴怒狂斩"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 1
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [113, 1117]
    uuid = "e36ae35f8964d92e30e33529a65544d7"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 锤击攻击力 : {value0}
    # REMOVE: data0 = [0, 2524, 2780, 3036, 3292, 3548, 3804, 4060, 4316, 4573, 4829, 5085, 5341, 5597, 5853, 6109, 6365, 6621, 6877, 7133, 7389, 7645, 7901, 8157, 8414, 8670, 8926, 9182, 9438, 9694, 9950, 10206, 10462, 10718, 10974, 11230, 11486, 11742, 11998, 12254, 12511, 12767, 13023, 13279, 13535, 13791, 14047, 14303, 14559, 14815, 15071, 15327, 15583, 15839, 16095, 16351, 16608, 16864, 17120, 17376, 17632, 17888, 18144, 18400, 18656, 18912, 19168, 19424, 19680, 19936, 20192]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 乱砍攻击力 : {value1}
    # REMOVE: data1 = [0, 736, 811, 886, 960, 1035, 1110, 1184, 1259, 1334, 1408, 1483, 1558, 1632, 1707, 1782, 1856, 1931, 2006, 2081, 2155, 2230, 2305, 2379, 2454, 2529, 2603, 2678, 2753, 2827, 2902, 2977, 3051, 3126, 3201, 3275, 3350, 3425, 3500, 3574, 3649, 3724, 3798, 3873, 3948, 4022, 4097, 4172, 4246, 4321, 4396, 4470, 4545, 4620, 4694, 4769, 4844, 4919, 4993, 5068, 5143, 5217, 5292, 5367, 5441, 5516, 5591, 5665, 5740, 5815, 5889]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 8
    # 乱砍攻击次数 : {value2}次
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 最后一击攻击力 : {value3}
    # REMOVE: data3 = [0, 4207, 4634, 5060, 5487, 5914, 6341, 6767, 7194, 7621, 8048, 8474, 8901, 9328, 9755, 10182, 10608, 11035, 11462, 11889, 12315, 12742, 13169, 13596, 14023, 14449, 14876, 15303, 15730, 16156, 16583, 17010, 17437, 17863, 18290, 18717, 19144, 19571, 19997, 20424, 20851, 21278, 21704, 22131, 22558, 22985, 23411, 23838, 24265, 24692, 25119, 25545, 25972, 26399, 26826, 27252, 27679, 28106, 28533, 28960, 29386, 29813, 30240, 30667, 31093, 31520, 31947, 32374, 32800, 33227, 33654]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 2
    # 最后一击攻击次数 : {value4}次
    # REMOVE: data4 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [暴怒狂斩]\n
        删除下劈， 以强化形态发动\n
         - 总攻击力相同\n
        可以强制中断最后一击的施放后僵直， 并施放包括格挡在内的其他攻击技能\n
        施放过程中所受伤害 -50%
        """
        ...

    def vp_2(self):
        """
        [暴怒狂斩]\n
        在空中挥剑留下血痕， 然后猛击地面使血痕爆炸\n
         - 总攻击力相同\n
        施放时消耗3%的当前生命值进行强化\n
         - 攻击范围 +50%\n
         - 命中时恢复5%的生命值
        """
        ...

# 爆发之刃
# swordman_male/berserker/e0daa922b19cdc35de879e938361464e
# 41f1cdc2ff58bb5fdc287be0db2a8df3/e0daa922b19cdc35de879e938361464e
class Skill37(ActiveSkill):
    """
    只能在[狂暴之力]状态下使用。\n
    在前方生成爆发之刃， 然后向敌人发出强威力的刺击； 技能命中敌人时， 会产生爆炸。\n
    技能命中后， 可以强制中断， 施放包括格挡在内的其他攻击技能。\n
    施放技能时， 按后方向键， 可以原地刺击敌人。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "爆发之刃"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [297, 1267]
    uuid = "e0daa922b19cdc35de879e938361464e"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 爆炸攻击力 : {value0}
    # REMOVE: data0 = [0, 16802, 18507, 20211, 21916, 23620, 25325, 27029, 28734, 30438, 32143, 33848, 35552, 37257, 38961, 40666, 42370, 44075, 45779, 47484, 49188, 50893, 52598, 54302, 56007, 57711, 59416, 61120, 62825, 64529, 66234, 67939, 69643, 71348, 73052, 74757, 76461, 78166, 79870, 81575, 83279, 84984, 86689, 88393, 90098, 91802, 93507, 95211, 96916, 98620, 100325, 102030, 103734, 105439, 107143, 108848, 110552, 112257, 113961, 115666, 117370, 119075, 120780, 122484, 124189, 125893, 127598, 129302, 131007, 132711, 134416]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # [范围信息]
    # 爆炸范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [爆发之刃]\n
        即使血刃未刺中敌人也会快速发生爆炸\n
        爆炸范围 +50%\n
        若爆炸未命中敌人， 剩余冷却时间缩短为3秒
        """
        ...

    def vp_2(self):
        """
        [爆发之刃]\n
        施放时消耗当前3%的生命值， 以强化形态发动\n
         - 爆炸范围 +20%\n
         - 命中时恢复10%的生命值\n
        爆炸前会将一定范围内的敌人吸附至爆炸中心
        """
        ...

# 崩山裂地斩
# swordman_male/berserker/ecc23c980ea71450c0ad0c3fd232f329
# 41f1cdc2ff58bb5fdc287be0db2a8df3/ecc23c980ea71450c0ad0c3fd232f329
class Skill38(ActiveSkill):
    """
    只能在[狂暴之力]已施放的状态下使用。\n
    召唤出血气之剑， 跳跃后猛力捶击地面， 地面喷出的炙热岩浆攻击敌人。\n
    施放技能时， 按向后方向键可以减少前进距离， 按向前方向键可以增加前近距离。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "崩山裂地斩"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [456, 1944]
    uuid = "ecc23c980ea71450c0ad0c3fd232f329"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 捶击攻击力 : {value0}
    # REMOVE: data0 = [0, 857, 944, 1031, 1118, 1205, 1292, 1379, 1466, 1553, 1640, 1727, 1814, 1901, 1988, 2075, 2161, 2248, 2335, 2422, 2509, 2596, 2683, 2770, 2857, 2944, 3031, 3118, 3205, 3292, 3379, 3466, 3553, 3640, 3727, 3814, 3901, 3988, 4074, 4161, 4248, 4335, 4422, 4509, 4596, 4683, 4770, 4857, 4944, 5031, 5118, 5205, 5292, 5379, 5466, 5553, 5640, 5727, 5814, 5901, 5987, 6074, 6161, 6248, 6335, 6422, 6509, 6596, 6683, 6770, 6857]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 冲击波攻击力 : {value1}
    # REMOVE: data1 = [0, 5714, 6294, 6874, 7453, 8033, 8613, 9192, 9772, 10352, 10932, 11511, 12091, 12671, 13250, 13830, 14410, 14989, 15569, 16149, 16729, 17308, 17888, 18468, 19047, 19627, 20207, 20786, 21366, 21946, 22526, 23105, 23685, 24265, 24844, 25424, 26004, 26583, 27163, 27743, 28323, 28902, 29482, 30062, 30641, 31221, 31801, 32380, 32960, 33540, 34120, 34699, 35279, 35859, 36438, 37018, 37598, 38177, 38757, 39337, 39917, 40496, 41076, 41656, 42235, 42815, 43395, 43974, 44554, 45134, 45714]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 岩浆攻击力 : {value2}
    # REMOVE: data2 = [0, 3667, 4039, 4411, 4783, 5155, 5526, 5898, 6270, 6642, 7014, 7386, 7758, 8130, 8502, 8874, 9246, 9618, 9990, 10362, 10734, 11106, 11478, 11850, 12222, 12594, 12966, 13338, 13710, 14082, 14454, 14826, 15198, 15570, 15942, 16314, 16686, 17058, 17430, 17802, 18174, 18546, 18918, 19290, 19662, 20034, 20405, 20777, 21149, 21521, 21893, 22265, 22637, 23009, 23381, 23753, 24125, 24497, 24869, 25241, 25613, 25985, 26357, 26729, 27101, 27473, 27845, 28217, 28589, 28961, 29333]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 6
    # 岩浆多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 范围比率 : {value4}%
    # REMOVE: data4 = [0, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

    def vp_1(self):
        """
        [崩山裂地斩]\n
        血剑锤击地面的瞬间喷出岩浆\n
        范围 +40%\n
        被命中的敌人不会倒地， 但会进入僵直状态， 并且每次被击时逐渐向中心位置移动
        """
        ...

    def vp_2(self):
        """
        [崩山裂地斩]\n
        变更为可填充2次的技能\n
         - 单次攻击力 -50%\n
         - 每次填充冷却时间 : 20秒\n
         - 降低跳跃高度\n
        施放技能时进入无敌状态
        """
        self.cd = 20
        self.skillRation *= 0.5
        ...

# 鲜血之忆
# swordman_male/berserker/dbf8b30c7057032af0d68fcfa289fdae
# 41f1cdc2ff58bb5fdc287be0db2a8df3/dbf8b30c7057032af0d68fcfa289fdae
class Skill39(PassiveSkill):
    """
    若周围一定范围内存在处于出血状态的敌人或友军， 则可以增加自身的独立攻击力、 命中率和物理暴击率。
    """
    name = "鲜血之忆"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6
    rangeLv = 3
    uuid = "dbf8b30c7057032af0d68fcfa289fdae"
    hasVP = False
    hasUP = False

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 独立攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 12.9, 14.4, 15.9, 17.4, 18.9, 20.4, 21.9, 23.4, 24.9, 26.4, 27.9, 29.4, 30.9, 32.4, 33.9, 35.4, 36.9, 38.4, 39.9, 41.4, 42.9, 44.4, 45.9, 47.4, 48.9, 50.4, 51.9, 53.4, 54.9, 56.4, 57.9, 59.4, 60.9, 62.4, 63.9, 65.4, 66.9, 68.4, 69.9, 71.4, 72.9, 74.4, 75.9, 77.4, 78.9, 80.4, 81.9, 83.4, 84.9, 86.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12, 12.3, 12.6, 12.9, 13.2, 13.5, 13.8, 14.1, 14.4, 14.7, 15, 15.3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 物理暴击率增加 : {value3}%
    # REMOVE: data3 = [0, 8.6, 9.2, 9.8, 10.4, 11, 11.6, 12.2, 12.8, 13.4, 14, 14.6, 15.2, 15.8, 16.4, 17, 17.6, 18.2, 18.8, 19.4, 20, 20.6, 21.2, 21.8, 22.4, 23, 23.6, 24.2, 24.8, 25.4, 26, 26.6, 27.2, 27.8, 28.4, 29, 29.6, 30.2, 30.8, 31.4, 32, 32.6, 33.2, 33.8, 34.4, 35, 35.6, 36.2, 36.8, 37.4, 38]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    associate = [{"data": data1,"type": '$*PAtkI'}]

# 魔狱血刹
# swordman_male/berserker/8572675ec6a1f50b6eff6a867376c2de
# 41f1cdc2ff58bb5fdc287be0db2a8df3/8572675ec6a1f50b6eff6a867376c2de
class Skill40(ActiveSkill):
    """
    施放技能后， 召唤出血气之剑。\n
    持续时间结束或再次按技能键时， 下劈血气之剑， 引发血气爆炸并强控敌人， 使敌人受到多段伤害。\n
    召唤出血气之剑的状态下， 攻击速度和移动速度增加。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "魔狱血刹"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [900, 7559]
    uuid = "8572675ec6a1f50b6eff6a867376c2de"
    hasVP = False
    hasUP = False

    # 血气之剑持续时间 : {value0}秒
    # REMOVE: data0 = [0, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65, 65]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 攻击速度增加 : {value1}%
    # REMOVE: data1 = [0, 1, 2.3, 11, 12.2, 13.5, 14.7, 16, 17.2, 18.5, 19.7, 21, 22.2, 23.5, 24.7, 26, 27.2, 28.5, 29.7, 31, 32.2, 33.5, 34.7, 36, 37.2, 38.5, 39.7, 41, 42.2, 43.5, 44.7, 46, 47.2, 48.5, 49.7, 51, 52.2, 53.5, 54.7, 56, 57.2, 58.5, 59.7, 61, 62.2, 63.5, 64.7, 66, 67.2, 68.5, 69.7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 移动速度增加 : {value2}%
    # REMOVE: data2 = [0, 1, 2.3, 11, 12.2, 13.5, 14.7, 16, 17.2, 18.5, 19.7, 21, 22.2, 23.5, 24.7, 26, 27.2, 28.5, 29.7, 31, 32.2, 33.5, 34.7, 36, 37.2, 38.5, 39.7, 41, 42.2, 43.5, 44.7, 46, 47.2, 48.5, 49.7, 51, 52.2, 53.5, 54.7, 56, 57.2, 58.5, 59.7, 61, 62.2, 63.5, 64.7, 66, 67.2, 68.5, 69.7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 下劈攻击力 : {value3}
    # REMOVE: data3 = [0, 10760, 13255, 15750, 18245, 20741, 23236, 25731, 28226, 30721, 33216, 35711, 38206, 40701, 43196, 45691, 48187, 50682, 53177, 55672, 58167, 60662, 63157, 65652, 68147, 70642, 73138, 75633, 78128, 80623, 83118, 85613, 88108, 90603, 93098, 95593, 98089, 100584, 103079, 105574, 108069, 110564, 113059, 115554, 118049, 120544, 123040, 125535, 128030, 130525, 133020]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1
    # 血气爆发多段攻击力 : {value4}
    # REMOVE: data4 = [0, 1524, 1877, 2231, 2584, 2937, 3291, 3644, 3998, 4351, 4704, 5058, 5411, 5764, 6118, 6471, 6825, 7178, 7531, 7885, 8238, 8591, 8945, 9298, 9652, 10005, 10358, 10712, 11065, 11418, 11772, 12125, 12478, 12832, 13185, 13539, 13892, 14245, 14599, 14952, 15305, 15659, 16012, 16366, 16719, 17072, 17426, 17779, 18132, 18486, 18839]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 27
    # 血气爆发多段攻击次数 : {value5}次
    # REMOVE: data5 = [0, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27, 27]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

# 狂怒暴掠
# swordman_male/berserker/f1fdc6c2482ecc510a2a9f04201ba125
# 41f1cdc2ff58bb5fdc287be0db2a8df3/f1fdc6c2482ecc510a2a9f04201ba125
class Skill41(ActiveSkill):
    """
    抓取前方敌人后， 跳起将敌人砸向地面， 引发剧烈血气爆炸。\n
    按向前方向键施放时， 向前突进并抓取敌人。\n
    对无法抓取的敌人不适用控制效果。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "狂怒暴掠"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 2
    cube = 2
    cd = 30
    mp = [344, 963]
    uuid = "f1fdc6c2482ecc510a2a9f04201ba125"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 抓起攻击力 : {value0}
    # REMOVE: data0 = [0, 4447, 4898, 5350, 5801, 6252, 6703, 7154, 7605, 8057, 8508, 8959, 9410, 9861, 10312, 10764, 11215, 11666, 12117, 12568, 13019, 13471, 13922, 14373, 14824, 15275, 15726, 16177, 16629, 17080, 17531, 17982, 18433, 18884, 19336, 19787, 20238, 20689, 21140, 21591, 22043, 22494, 22945, 23396, 23847, 24298, 24750, 25201, 25652, 26103, 26554]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 气息爆炸攻击力 : {value1}
    # REMOVE: data1 = [0, 25201, 27757, 30314, 32871, 35427, 37984, 40540, 43097, 45654, 48210, 50767, 53323, 55880, 58437, 60993, 63550, 66106, 68663, 71220, 73776, 76333, 78889, 81446, 84003, 86559, 89116, 91672, 94229, 96786, 99342, 101899, 104455, 107012, 109569, 112125, 114682, 117239, 119795, 122352, 124908, 127465, 130022, 132578, 135135, 137691, 140248, 142805, 145361, 147918, 150474]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # [范围信息]
    # 最后一击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [狂怒暴掠]\n
        不抓取敌人也可以引发气息爆炸\n
        施放过程中发动[强悍碾压]或[崩山裂地斩]时， 引发气息爆炸的同时发动该技能\n
        气息爆炸范围 20%
        """
        ...

    def vp_2(self):
        """
        [狂怒暴掠]\n
        施放时， 追踪并抓取一定范围内最强的敌人\n
         - 若范围内没有敌人则无法施放\n
        可以强制中断气息爆炸后僵直并施放转职技能
        """
        ...

# 狂气涌动
# swordman_male/berserker/75747c67e14eec6088ce67f63ea41628
# 41f1cdc2ff58bb5fdc287be0db2a8df3/75747c67e14eec6088ce67f63ea41628
class Skill42(ActiveSkill):
    """
    在持续时间内， 狂战士即使受到伤害， 生命值也不会减少到一定程度以下。\n
    当生命值降到一定程度以下后被攻击时， 会生成血气防御罩， 并在较短的时间平复所受伤害。\n
       除被击状态以外， 该技能可以在任何状态下使用。\n
    冷却时间减少效果不适用于该技能。
    """
    name = "狂气涌动"
    learnLv = 65
    masterLv = 1
    maxLv = 1
    position = 3
    rangeLv = 3
    mp = [450, 450]
    uuid = "75747c67e14eec6088ce67f63ea41628"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 未减少的生命值比率 : {value1}%
    # REMOVE: data1 = [0, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 血气防御罩持续时间 : {value2}秒
    # REMOVE: data2 = [0, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 冷却时间 : {value3}秒
    # REMOVE: data3 = [0, 45]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 强悍碾压
# swordman_male/berserker/3a691a432c58abebc08211df45c4f4bd
# 41f1cdc2ff58bb5fdc287be0db2a8df3/3a691a432c58abebc08211df45c4f4bd
class Skill43(ActiveSkill):
    """
    伸手并用剑划开自己的手掌， 用手上喷发出来的血气形成血剑后， 高举血剑砸向地面， 引发巨大的爆炸。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "强悍碾压"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [534, 1771]
    uuid = "3a691a432c58abebc08211df45c4f4bd"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 生命值消耗量 : 当前生命值的{value0}%
    # REMOVE: data0 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 血气爆发多段攻击力 : {value1}
    # REMOVE: data1 = [0, 10518, 11585, 12652, 13719, 14786, 15853, 16920, 17987, 19054, 20121, 21188, 22255, 23323, 24390, 25457, 26524, 27591, 28658, 29725, 30792, 31859, 32926, 33993, 35060, 36127, 37194, 38261, 39328, 40395, 41462, 42529, 43596, 44663, 45730, 46797, 47865, 48932, 49999, 51066, 52133, 53200, 54267, 55334, 56401, 57468, 58535, 59602, 60669, 61736, 62803]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 5
    # 血气爆发多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [强悍碾压]\n
        爆炸范围缩小， 额外发生2次爆炸\n
         - 多段攻击次数 +80%\n
         - 总攻击力相同\n
        爆炸的血气化作盔甲将自身包围\n
         - 发生爆炸后进入霸体状态10秒\n
         - 发生爆炸后10秒内所有速度 +10%
        """
        ...

    def vp_2(self):
        """
        [强悍碾压]\n
        施放过程中发动[狂怒暴掠]或[崩山裂地斩]时， 引发气息爆炸的同时发动该技能\n
        爆炸范围 +15%
        """
        ...

# 汲血之力
# swordman_male/berserker/374f53e8989ef04a8506c8ec99d9ecdc
# 41f1cdc2ff58bb5fdc287be0db2a8df3/374f53e8989ef04a8506c8ec99d9ecdc
class Skill44(PassiveSkill):
    """
    增加基本攻击力和[崩山击]、 [十字刃]等狂战士转职技能的攻击力。 施放[嗜魂之手]时进入霸体状态。 
    """
    name = "汲血之力"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    uuid = "374f53e8989ef04a8506c8ec99d9ecdc"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    associate = [{"data": data0,"type": '*skillRation'}]

# 浴血之怒
# swordman_male/berserker/8ec9da6f808889b63adf2680fbf1f331
# 41f1cdc2ff58bb5fdc287be0db2a8df3/8ec9da6f808889b63adf2680fbf1f331
class Skill45(ActiveSkill):
    """
    爆发血气之怒， 而使角色在指定地点发动大规模的血气爆炸。\n
    被爆炸命中的敌人会受到伤害。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "浴血之怒"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "8ec9da6f808889b63adf2680fbf1f331"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 施放时生命值消耗量 : 当前生命值的{value0}%
    # REMOVE: data0 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 大规模血气爆炸攻击力 : {value1}
    # REMOVE: data1 = [0, 54024, 59505, 64985, 70466, 75947, 81427, 86908, 92389, 97870, 103350, 108831, 114312, 119792, 125273, 130754, 136234, 141715, 147196, 152677, 158157, 163638, 169119, 174599, 180080, 185561, 191041, 196522, 202003, 207483, 212964, 218445, 223926, 229406, 234887, 240368, 245848, 251329, 256810, 262290, 267771, 273252, 278733, 284213, 289694, 295175, 300655, 306136, 311617, 317097, 322578]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # [范围信息]
    # 范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [浴血之怒]\n
        气息爆炸命中敌人时吸收目标的血气\n
         - 每命中1名敌人恢复5%的生命值(最多6人)\n
         - 吸收血气时力量唤醒固定为3阶段， 效果持续20秒\n
        气息爆炸范围 +30%
        """
        ...

    def vp_2(self):
        """
        [浴血之怒]\n
        变更为可填充2次的技能\n
         - 单次攻击力 -50%\n
         - 每次填充冷却时间 : 20秒\n
        立即在手中生成血气并引爆
        """
        self.cd = 20
        self.skillRation *= 0.5
        ...

# 致命血陨
# swordman_male/berserker/00e4f916cc182df49e5efd29c3e2069c
# 41f1cdc2ff58bb5fdc287be0db2a8df3/00e4f916cc182df49e5efd29c3e2069c
class Skill46(ActiveSkill):
    """
    吸取血气生成剑， 快速斩击敌人两次后发动交叉斩击， 造成致命伤害。\n
    施放时按向前方向键， 可以增加前进距离。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "致命血陨"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 5
    cd = 50
    mp = [848, 6360]
    uuid = "00e4f916cc182df49e5efd29c3e2069c"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 上斩攻击力 : {value0}
    # REMOVE: data0 = [0, 13163, 14498, 15834, 17169, 18504, 19840, 21175, 22510, 23846, 25181, 26516, 27852, 29187, 30522, 31858, 33193, 34529, 35864, 37199, 38535, 39870, 41205, 42541, 43876, 45211, 46547, 47882, 49217, 50553, 51888, 53223, 54559, 55894, 57230, 58565, 59900, 61236, 62571, 63906, 65242, 66577, 67912, 69248, 70583, 71918, 73254, 74589, 75925, 77260, 78595]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 横斩攻击力 : {value1}
    # REMOVE: data1 = [0, 16454, 18123, 19792, 21461, 23130, 24799, 26469, 28138, 29807, 31476, 33145, 34815, 36484, 38153, 39822, 41491, 43161, 44830, 46499, 48168, 49837, 51507, 53176, 54845, 56514, 58183, 59853, 61522, 63191, 64860, 66529, 68199, 69868, 71537, 73206, 74875, 76545, 78214, 79883, 81552, 83221, 84891, 86560, 88229, 89898, 91567, 93237, 94906, 96575, 98244]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 交叉斩击攻击力 : {value2}
    # REMOVE: data2 = [0, 36198, 39870, 43542, 47214, 50887, 54559, 58231, 61903, 65576, 69248, 72920, 76592, 80264, 83937, 87609, 91281, 94953, 98626, 102298, 105970, 109642, 113315, 116987, 120659, 124331, 128003, 131676, 135348, 139020, 142692, 146365, 150037, 153709, 157381, 161054, 164726, 168398, 172070, 175742, 179415, 183087, 186759, 190431, 194104, 197776, 201448, 205120, 208793, 212465, 216137]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # [范围信息]
    # 范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [致命血陨]\n
        删除交叉斩击， 上斩、 横斩各增加1次\n
         - 总攻击力相同\n
        按向前方向键时， 可以前进更远\n
        使命中的敌人聚集到前方\n
        施放过程中所受伤害 -80%
        """
        ...

    def vp_2(self):
        """
        [致命血陨]\n
        施放时消耗当前3%的生命值， 发动一次致命斩击\n
         - 总攻击力相同\n
         - 命中时恢复15%的生命值
        """
        ...

# 血魔 · 弑天
# swordman_male/berserker/c524c4f378d1cd0ff99e4580750a4567
# 41f1cdc2ff58bb5fdc287be0db2a8df3/c524c4f378d1cd0ff99e4580750a4567
class Skill47(ActiveSkill):
    """
    化身为血魔， 暴走并突击前方的敌人， 同时引发血气爆炸。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "血魔 · 弑天"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "c524c4f378d1cd0ff99e4580750a4567"
    hasVP = False
    hasUP = False

    # 血魔突击攻击力 : {value0}
    # REMOVE: data0 = [0, 28416, 35005, 41594, 48183, 54772, 61361, 67951, 74540, 81129, 87718, 94307, 100896, 107485, 114075, 120664, 127253, 133842, 140431, 147020, 153610, 160199, 166788, 173377, 179966, 186555, 193144, 199734, 206323, 212912, 219501, 226090, 232679, 239268, 245858, 252447, 259036, 265625, 272214, 278803, 285392, 291982, 298571, 305160, 311749, 318338, 324927, 331517, 338106, 344695, 351284]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 2
    # 血魔突击多段攻击次数上限 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 血气爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 69461, 85567, 101674, 117781, 133888, 149995, 166101, 182208, 198315, 214422, 230529, 246635, 262742, 278849, 294956, 311063, 327169, 343276, 359383, 375490, 391597, 407704, 423810, 439917, 456024, 472131, 488238, 504344, 520451, 536558, 552665, 568772, 584878, 600985, 617092, 633199, 649306, 665412, 681519, 697626, 713733, 729840, 745946, 762053, 778160, 794267, 810374, 826480, 842587, 858694]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1

# 疯魔血魂斩
# swordman_male/berserker/a99040fc36c75e998aa3ed012b7759c5
# 41f1cdc2ff58bb5fdc287be0db2a8df3/a99040fc36c75e998aa3ed012b7759c5
class Skill48(ActiveSkill):
    """
    生成巨大血气团， 并下劈将其破坏， 然后将血气团在前方击碎， 飞散血气碎片。\n
    学习[血气旺盛]后， 可以使被击中的敌人进入出血状态。
    """
    name = "疯魔血魂斩"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1017, 7632]
    uuid = "a99040fc36c75e998aa3ed012b7759c5"
    hasVP = False
    hasUP = False

    # 冲击波攻击力 : {value0}
    # REMOVE: data0 = [0, 33249, 36622, 39995, 43368, 46741, 50114, 53487, 56860, 60233, 63606, 66979, 70352, 73725, 77098, 80471, 83845, 87218, 90591, 93964, 97337, 100710, 104083, 107456, 110829, 114202, 117575, 120948, 124321, 127694, 131067, 134440, 137813, 141187, 144560, 147933, 151306, 154679, 158052, 161425, 164798, 168171, 171544, 174917, 178290, 181663, 185036, 188409, 191782, 195155, 198528]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 血气碎片攻击力 : {value1}
    # REMOVE: data1 = [0, 15516, 17090, 18664, 20238, 21812, 23387, 24961, 26535, 28109, 29683, 31257, 32831, 34405, 35979, 37553, 39127, 40702, 42276, 43850, 45424, 46998, 48572, 50146, 51720, 53294, 54868, 56442, 58017, 59591, 61165, 62739, 64313, 65887, 67461, 69035, 70609, 72183, 73758, 75332, 76906, 78480, 80054, 81628, 83202, 84776, 86350, 87924, 89498, 91073, 92647]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 5
    # 血气喷发多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 血气界限
# swordman_male/berserker/b39ccc3dadab9d94569430e39cdf7d60
# 41f1cdc2ff58bb5fdc287be0db2a8df3/b39ccc3dadab9d94569430e39cdf7d60
class Skill49(PassiveSkill):
    """
    成功利用血气抑制卡赞综合征， 并获得爆发性的力量， 性情变得更加残忍。\n
    增加基本攻击力和[崩山击]、 [十字刃]等转职技能攻击力， 并变更部分技能。\n
    [十字刃]\n
    删除斩击和追加按键功能； 发动交叉斩击， 向前方发射十字。\n
    [嗜魂之手]\n
    血气喷发范围变更为全方位； 即使未抓住敌人， 也可以生成血块后使其爆炸。
    """
    name = "血气界限"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    uuid = "b39ccc3dadab9d94569430e39cdf7d60"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    associate = [{"data": data0,"type": '*skillRation'}]

# 血魔极道 : 灭世
# swordman_male/berserker/d59c9840f65381bde8487757f1753c71
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d59c9840f65381bde8487757f1753c71
class Skill50(ActiveSkill):
    """
    使血气上涨， 抑制卡赞综合征的暴走， 变身成为血魔， 获得超越肉体极限的爆发性力量。\n
    追踪最强大的敌人， 并对其连续斩击， 以压倒性的力量将敌人砸向地面， 拔出血剑攻击敌人。 然后， 地面喷发血气， 对周围所有敌人造成伤害。\n
    掌握[血气旺盛]时， 可以使被击中的敌人进入出血状态。\n
    [三次觉醒技能]\n
    选择[魔狱血刹]使用三次觉醒技能时， 可以使用三次觉醒技能代替[魔狱血刹]的终结攻击。 三次觉醒技能在冷却中或[魔狱血刹]未激活的状态下， 无法使用三次觉醒技能。\n
    选择[血魔 · 弑天]使用三次觉醒技能时， 与[血魔 · 弑天]共享冷却时间。 [血魔 · 弑天]在冷却中时， 无法使用三次觉醒技能。
    """
    name = "血魔极道 : 灭世"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4027, 8055]
    uuid = "d59c9840f65381bde8487757f1753c71"
    hasVP = False
    hasUP = False

    # 乱舞攻击力 : {value0}
    # REMOVE: data0 = [0, 13883, 17102, 20321, 23540, 26759, 29979, 33198, 36417, 39636, 42855, 46075, 49294, 52513, 55732, 58951, 62170, 65390, 68609, 71828, 75047, 78266, 81486, 84705, 87924, 91143, 94362, 97581, 100801, 104020, 107239, 110458, 113677, 116897, 120116, 123335, 126554, 129773, 132992, 136212, 139431, 142650, 145869, 149088, 152308, 155527, 158746, 161965, 165184, 168403, 171623]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 4
    # 乱舞攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 跳跃下斩攻击力 : {value2}
    # REMOVE: data2 = [0, 18510, 22803, 27095, 31387, 35679, 39972, 44264, 48556, 52848, 57140, 61433, 65725, 70017, 74309, 78602, 82894, 87186, 91478, 95771, 100063, 104355, 108647, 112940, 117232, 121524, 125816, 130109, 134401, 138693, 142985, 147278, 151570, 155862, 160154, 164447, 168739, 173031, 177323, 181616, 185908, 190200, 194492, 198785, 203077, 207369, 211661, 215954, 220246, 224538, 228830]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 2
    # 跳跃下斩多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 地面捶击攻击力 : {value4}
    # REMOVE: data4 = [0, 37021, 45605, 54190, 62774, 71359, 79943, 88528, 97112, 105696, 114281, 122865, 131450, 140034, 148619, 157203, 165788, 174372, 182957, 191541, 200126, 208710, 217295, 225879, 234464, 243048, 251633, 260217, 268802, 277386, 285971, 294555, 303140, 311724, 320309, 328893, 337478, 346062, 354647, 363231, 371816, 380400, 388985, 397569, 406154, 414738, 423323, 431907, 440491, 449076, 457660]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 1
    # 斩击攻击力 : {value5}
    # REMOVE: data5 = [0, 148082, 182420, 216758, 251096, 285434, 319772, 354110, 388448, 422786, 457124, 491462, 525800, 560138, 594476, 628814, 663152, 697490, 731828, 766165, 800503, 834841, 869179, 903517, 937855, 972193, 1006531, 1040869, 1075207, 1109545, 1143883, 1178221, 1212559, 1246897, 1281235, 1315573, 1349911, 1384249, 1418586, 1452924, 1487262, 1521600, 1555938, 1590276, 1624614, 1658952, 1693290, 1727628, 1761966, 1796304, 1830642]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 1
    # 血气喷发攻击力 : {value6}
    # REMOVE: data6 = [0, 11569, 14252, 16934, 19617, 22300, 24982, 27665, 30348, 33030, 35713, 38395, 41078, 43761, 46443, 49126, 51809, 54491, 57174, 59857, 62539, 65222, 67905, 70587, 73270, 75953, 78635, 81318, 84001, 86683, 89366, 92049, 94731, 97414, 100096, 102779, 105462, 108144, 110827, 113510, 116192, 118875, 121558, 124240, 126923, 129606, 132288, 134971, 137654, 140336, 143019]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    hit6 = 8
    # 血气喷发多段攻击次数 : {value7}次
    # REMOVE: data7 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'berserker'
        self.nameCN = '极诣·狂战士'
        self.role = 'swordman_male'
        self.角色 = '鬼剑士(男)'
        self.职业 = '狂战士'
        self.jobId = '41f1cdc2ff58bb5fdc287be0db2a8df3'
        self.jobGrowId = '6d459bc74ba73ee4fe5cdc4655400193'

        self.武器选项 = ['太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['物理固伤','魔法固伤']
        self.输出类型 = '物理固伤'
        self.防具精通属性 = ['力量']
        self.防具类型 = '重甲'
        self.buff = 2.245

        super().__init__(equVersion, __name__)
