#41f1cdc2ff58bb5fdc287be0db2a8df3
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "swordman_male/soul_bender/cn/skillDetail"

# 鬼斩
# swordman_male/soul_bender/eb71e1d82d92c7e1d40500a0dcd77aa6
# 41f1cdc2ff58bb5fdc287be0db2a8df3/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill0(ActiveSkill):
    """
    把鬼神召唤到武器上， 并向前方敌人发出强威力的暗属性斩击。\n
    转职为鬼泣且学习[噬灵鬼斩]后\n
    按住技能键可蓄气施放， 且通过追加操作可使用[噬灵鬼斩]。\n
    学习[鬼神冠冕]后\n
    无需蓄气， 攻击时在原地发动斩击。 利用黄泉之力， 生成幽魂之布雷德的气息。
    """
    name = "鬼斩"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cd = 6
    mp = [17, 196]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 2683, 2955, 3227, 3500, 3772, 4044, 4316, 4588, 4861, 5133, 5405, 5677, 5949, 6221, 6494, 6766, 7038, 7310, 7582, 7855, 8127, 8399, 8671, 8943, 9216, 9488, 9760, 10032, 10304, 10576, 10849, 11121, 11393, 11665, 11937, 12210, 12482, 12754, 13026, 13298, 13571, 13843, 14115, 14387, 14659, 14931, 15204, 15476, 15748, 16020, 16292, 16565, 16837, 17109, 17381, 17653, 17926, 18198, 18470, 18742, 19014, 19286, 19559, 19831, 20103, 20375, 20647, 20920, 21192, 21464]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 转职为鬼泣且学习[噬灵鬼斩]后
    # 最大蓄气时攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 鬼神追加攻击力 : {value2}%
    # REMOVE: data2 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    data2 = [0, 2609, 2873, 3138, 3403, 3667, 3932, 4197, 4461, 4726, 4991, 5255, 5520, 5785, 6049, 6314, 6579, 6843, 7108, 7373, 7637, 7902, 8166, 8431, 8696, 8960, 9225, 9490, 9754, 10019, 10284, 10548, 10813, 11078, 11342, 11607, 11872, 12136, 12401, 12666, 12930, 13195, 13460, 13724, 13989, 14254, 14518, 14783, 15047, 15312, 15577, 15841, 16106, 16371, 16635, 16900, 17165, 17429, 17694, 17959, 18223, 18488, 18753, 19017, 19282, 19547, 19811, 20076, 20341, 20605, 20870]# noqa: E501
    # [萨亚攻击时]
    # 冰冻几率 : {value3}%
    # REMOVE: data3 = [0, 90, 90, 90, 90, 91, 91, 91, 91, 91, 92, 92, 92, 92, 92, 93, 93, 93, 93, 93, 94, 94, 94, 94, 94, 95, 95, 95, 95, 95, 96, 96, 96, 96, 96, 97, 97, 97, 97, 97, 98, 98, 98, 98, 98, 99, 99, 99, 99, 99, 100, 100, 100, 100, 100, 101, 101, 101, 101, 101, 102, 102, 102, 102, 102, 103, 103, 103, 103, 103, 104]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 冰冻持续时间 : {value4}秒
    # REMOVE: data4 = [0, 1.8, 1.8, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 1.9, 2, 2, 2, 2, 2, 2, 2, 2.1, 2.1, 2.1, 2.1, 2.1, 2.1, 2.2, 2.2, 2.2, 2.2, 2.2, 2.2, 2.2, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.3, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.6, 2.6, 2.6, 2.6, 2.6, 2.6, 2.6, 2.7, 2.7, 2.7, 2.7, 2.7, 2.7, 2.8, 2.8, 2.8, 2.8, 2.8, 2.8, 2.8, 2.9]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [普戾蒙攻击时]
    # 睡眠几率 : {value5}%
    # REMOVE: data5 = [0, 90, 90, 90, 90, 91, 91, 91, 91, 91, 92, 92, 92, 92, 92, 93, 93, 93, 93, 93, 94, 94, 94, 94, 94, 95, 95, 95, 95, 95, 96, 96, 96, 96, 96, 97, 97, 97, 97, 97, 98, 98, 98, 98, 98, 99, 99, 99, 99, 99, 100, 100, 100, 100, 100, 101, 101, 101, 101, 101, 102, 102, 102, 102, 102, 103, 103, 103, 103, 103, 104]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 睡眠持续时间 : {value6}秒
    # REMOVE: data6 = [0, 5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5, 4.5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # [学习鬼神冠冕后]
    # 鬼神斩击攻击力 : {value7}%
    # REMOVE: data7 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    data7 = [0, 2683, 2955, 3227, 3499, 3771, 4043, 4315, 4588, 4860, 5132, 5404, 5676, 5948, 6221, 6493, 6765, 7037, 7309, 7581, 7853, 8126, 8398, 8670, 8942, 9214, 9486, 9758, 10031, 10303, 10575, 10847, 11119, 11391, 11663, 11936, 12208, 12480, 12752, 13024, 13296, 13568, 13841, 14113, 14385, 14657, 14929, 15201, 15474, 15746, 16018, 16290, 16562, 16834, 17106, 17379, 17651, 17923, 18195, 18467, 18739, 19011, 19284, 19556, 19828, 20100, 20372, 20644, 20916, 21189, 21461]# noqa: E501
    hit7 = 1
    power7 = 1
    # 幽魂之布雷德攻击力 : {value8}%
    # REMOVE: data8 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    data8 = [0, 2609, 2873, 3138, 3403, 3667, 3932, 4197, 4461, 4726, 4991, 5255, 5520, 5785, 6049, 6314, 6579, 6843, 7108, 7373, 7637, 7902, 8166, 8431, 8696, 8960, 9225, 9490, 9754, 10019, 10284, 10548, 10813, 11078, 11342, 11607, 11872, 12136, 12401, 12666, 12930, 13195, 13460, 13724, 13989, 14254, 14518, 14783, 15047, 15312, 15577, 15841, 16106, 16371, 16635, 16900, 17165, 17429, 17694, 17959, 18223, 18488, 18753, 19017, 19282, 19547, 19811, 20076, 20341, 20605, 20870]# noqa: E501
    hit8 = 1
    power8 = 1
    # [范围信息]
    # 斩击范围比率 : {value9}%
    # REMOVE: data9 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)


# 基础精通
# swordman_male/soul_bender/5a56514f35cf0270ae8d6c65f8fefd78
# 41f1cdc2ff58bb5fdc287be0db2a8df3/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [上挑]、 [连突刺]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["残影之凯贾"]}]

# 刀魂之卡赞
# swordman_male/soul_bender/a5fa08f5d509e6ff2ebc68856a470b5a
# 41f1cdc2ff58bb5fdc287be0db2a8df3/a5fa08f5d509e6ff2ebc68856a470b5a
class Skill10(ActiveSkill):
    """
    召唤出刀魂卡赞， 使在召唤领域内的我方队员增加力量和智力， 效果持续一定时间。\n
    刀魂卡赞存在的状态下， 再次施放此技能， 则原有的会消失， 并且重新在前方召唤出新的卡赞。\n
    - [转职为鬼泣后] -\n
    召唤功能消失， 增加自身技能攻击力。 (可以添加到快捷栏， 但无法使用)
    """
    name = "刀魂之卡赞"
    learnLv = 5
    masterLv = 10
    maxLv = 20
    position = 6
    rangeLv = 3
    cd = 6
    mp = [10, 400]
    uuid = "a5fa08f5d509e6ff2ebc68856a470b5a"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 力量增加 : {value1}
    # REMOVE: data1 = [0, 31, 40, 48, 58, 67, 79, 90, 103, 116, 131, 145, 161, 178, 194, 212, 230, 250, 270, 292, 313]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 智力增加 : {value2}
    # REMOVE: data2 = [0, 31, 40, 48, 58, 67, 79, 90, 103, 116, 131, 145, 161, 178, 194, 212, 230, 250, 270, 292, 313]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # - [转职为鬼泣后] -
    # 自身技能攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 领域范围 : {value4}px
    # REMOVE: data4 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    associate = [{"data":data3}]

# 短剑精通
# swordman_male/soul_bender/01c3a2fb793d293a25ed8dc7a0d70c1a
# 41f1cdc2ff58bb5fdc287be0db2a8df3/01c3a2fb793d293a25ed8dc7a0d70c1a
class Skill16(PassiveSkill):
    """
    装备短剑系武器时， 增加攻击力和命中率。\n
    [转职为剑魂后]\n
    - 3级 : 使用[上挑]后可以追加一次攻击； 且使用[上挑]时会出现剑气\n
    - 5级 : [格挡]成功时， 对敌人生成冲击波， 并有一定几率使其进入眩晕状态\n
    - 6级 : 增加[破军升龙击]的攻击力\n
    - 7级 : 施放[拔刀斩]时会出现剑气； 施放[幻影剑舞]时增加剑气的攻击次数\n
    - 9级 : 增加[猛龙断空斩]的攻击力\n
    [装备传世武器后]\n
    适用独立的攻击力/命中率增加数值。
    """
    name = "短剑精通"
    learnLv = 15
    masterLv = 30
    maxLv = 40
    line = 0
    position = 0
    rangeLv = 3
    uuid = "01c3a2fb793d293a25ed8dc7a0d70c1a"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 魔法攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1.2, 2.6, 3.9, 5.1, 6.4, 7.7, 9, 10.3, 11.6, 12.9, 14.1, 15.4, 16.7, 18, 19.3, 20.6, 21.9, 23.1, 24.4, 25.7, 27, 28.3, 29.6, 30.9, 32.1, 33.4, 34.7, 36, 37.3, 38.6, 39.9, 41.1, 42.4, 43.7, 45, 46.3, 47.6, 48.9, 50.1, 51.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [剑魂特殊附加效果]
    # [里 · 鬼剑术]剑气攻击力 : {value3}%
    # REMOVE: data3 = [0, 165, 192, 218, 244, 271, 297, 323, 350, 376, 402, 429, 455, 482, 508, 534, 561, 587, 613, 640, 666, 692, 719, 745, 771, 798, 824, 850, 877, 903, 930, 956, 982, 1009, 1035, 1061, 1088, 1114, 1140, 1167, 1193]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [格挡]冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 79, 92, 105, 117, 130, 143, 155, 168, 180, 193, 206, 218, 231, 244, 256, 269, 282, 294, 307, 319, 332, 345, 357, 370, 383, 395, 408, 421, 433, 446, 459, 471, 484, 496, 509, 522, 534, 547, 560, 572]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [格挡]冲击波眩晕几率 : {value5}%
    # REMOVE: data5 = [0, 58.9, 61.1, 63.2, 65.3, 67.4, 69.5, 71.6, 73.7, 75.8, 77.9, 80, 82.1, 84.2, 86.3, 88.4, 90.5, 92.6, 94.7, 96.8, 98.9, 101.1, 103.2, 105.3, 107.4, 109.5, 111.6, 113.7, 115.8, 117.9, 120, 122.1, 124.2, 126.3, 128.4, 130.5, 132.6, 134.7, 136.8, 138.9, 141.1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [格挡]冲击波眩晕持续时间 : {value6}秒
    # REMOVE: data6 = [0, 1.4, 1.5, 1.5, 1.5, 1.6, 1.6, 1.6, 1.7, 1.7, 1.7, 1.8, 1.8, 1.8, 1.8, 1.9, 1.9, 1.9, 2, 2, 2, 2.1, 2.1, 2.1, 2.2, 2.2, 2.2, 2.3, 2.3, 2.3, 2.4, 2.4, 2.4, 2.4, 2.5, 2.5, 2.5, 2.6, 2.6, 2.6, 2.7]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # [上挑]第1击攻击力增加率 : {value7}%
    # REMOVE: data7 = [0, 0, 0, 69.4, 70.1, 70.8, 71.5, 72.2, 72.9, 73.6, 74.3, 75, 75.7, 76.4, 77.1, 77.8, 78.5, 79.2, 79.9, 80.6, 81.3, 82, 82.7, 83.4, 84.1, 84.8, 85.5, 86.2, 86.9, 87.6, 88.3, 89, 89.7, 90.4, 91.1, 91.8, 92.5, 93.2, 93.9, 94.6, 95.3]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [上挑]第2击攻击力增加率 : {value8}%
    # REMOVE: data8 = [0, 0, 0, 35.1, 36, 36.9, 37.8, 38.7, 39.6, 40.5, 41.4, 42.3, 43.2, 44.1, 45, 45.9, 46.8, 47.7, 48.6, 49.5, 50.4, 51.3, 52.2, 53.1, 54, 54.9, 55.8, 56.7, 57.6, 58.5, 59.4, 60.3, 61.2, 62.1, 63, 63.9, 64.8, 65.7, 66.6, 67.5, 68.4]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # [上挑]浮空力 : {value9}%
    # REMOVE: data9 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # [三段刃]攻击力增加率 : {value10}%
    # REMOVE: data10 = [0, 27.2, 27.7, 28.2, 28.7, 29.2, 29.7, 30.2, 30.7, 31.2, 31.7, 32.2, 32.7, 33.2, 33.7, 34.2, 34.7, 35.2, 35.7, 36.2, 36.7, 37.2, 37.7, 38.2, 38.7, 39.2, 39.7, 40.2, 40.7, 41.2, 41.7, 42.2, 42.7, 43.2, 43.7, 44.2, 44.7, 45.2, 45.7, 46.2, 46.7]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # [破军升龙击]攻击力增加率 : {value11}%
    # REMOVE: data11 = [0, 0, 0, 0, 0, 0, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # [猛龙断空斩]攻击力增加率 : {value12}%
    # REMOVE: data12 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # [装备传世武器后]
    # 物理攻击力增加率 : {value13}%
    # REMOVE: data13 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)
    # 魔法攻击力增加率 : {value14}%
    # REMOVE: data14 = [0, 1.4, 3.1, 4.6, 6, 7.5, 9, 10.6, 12.1, 13.6, 15.1, 16.5, 18.1, 19.6, 21.1, 22.6, 24.2, 25.7, 27.1, 28.6, 30.2, 31.7, 33.2, 34.7, 36.3, 37.7, 39.2, 40.7, 42.2, 43.8, 45.3, 46.8, 48.2, 49.8, 51.3, 52.8, 54.3, 55.9, 57.4, 58.8, 60.3]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14)
    # 命中率增加 : {value15}%
    # REMOVE: data15 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15)

    def effect(self, old, new):
        weapon = self.char.charEquipInfo["武器"].equInfo
        if weapon is None or weapon.itemDetailType != "短剑":
            return
        data = self.data1
        if weapon.categorize == "传世武器":
            data = self.data14
        self.associate = [{"type":"$*PAtkM","data":data}]
        return super().effect(old, new)


# 太刀精通
# swordman_male/soul_bender/8f73f243041c2d27739fe7696f02bf9b
# 41f1cdc2ff58bb5fdc287be0db2a8df3/8f73f243041c2d27739fe7696f02bf9b
class Skill17(PassiveSkill):
    """
    装备太刀系武器时， 增加攻击力和命中率。\n
    [转职为剑魂后]\n
    - 5级 : [三段刃]增加攻击次数， 最后一击还可以浮空敌人\n
    - 7级 :使用[拔刀斩]可以发动追加攻击； 使用[幻影剑舞]可以增加斩击次数和速度， 减少斩击攻击力\n
    - 10级 :  攻击时会附加刺伤效果， 使用[空之连刃]时， 对刺伤状态的敌人增加攻击力\n
    刺伤效果最多可以叠加17次， 达到叠加上限时， 会消耗所有刺伤效果并引爆敌人造成伤害； 刺伤效果叠加3次开始， 接下来的3秒内可以持续叠加， 若没达到叠加上限， 3秒后也会引发爆炸。\n
    [装备传世武器后]\n
    适用独立的攻击力/命中率增加数值。
    """
    name = "太刀精通"
    learnLv = 15
    masterLv = 30
    maxLv = 40
    line = 0
    position = 1
    rangeLv = 3
    uuid = "8f73f243041c2d27739fe7696f02bf9b"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 9.2, 10.7, 12.2, 13.7, 15.2, 16.7, 18.2, 19.7, 21.2, 22.7, 24.2, 25.7, 27.2, 28.7, 30.2, 31.7, 33.2, 34.7, 36.2, 37.7, 39.2, 40.7, 42.7, 44.7, 46.7, 48.7, 50.7, 52.7, 54.7, 56.7, 58.7, 60.7, 62.7, 64.7, 66.7, 68.7, 70.7, 72.7, 74.7, 76.7]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 魔法攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1.3, 2.8, 4.1, 5.4, 6.8, 8.2, 9.6, 10.9, 12.3, 13.7, 15, 16.4, 17.7, 19.1, 20.5, 21.9, 23.3, 24.5, 25.9, 27.3, 28.7, 30.1, 31.4, 32.8, 34.1, 35.5, 36.9, 38.2, 39.6, 41, 42.4, 43.7, 45, 46.4, 47.8, 49.2, 50.6, 52, 53.2, 54.6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [剑魂特殊附加效果]
    # 刺伤几率 : {value3}%
    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 38, 38, 39, 39, 40, 40, 41, 41, 42, 42, 43, 43, 44, 44, 45, 45, 46, 46, 47, 47, 48, 48, 49, 49, 50, 50, 51, 51, 52, 52]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 刺伤持续时间 : {value4}秒
    # REMOVE: data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3, 3.3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 刺伤爆炸攻击力 : {value5}% ~ {value6}%
    # REMOVE: data5 = [0, 1060, 1229, 1398, 1567, 1736, 1905, 2074, 2243, 2413, 2582, 2751, 2920, 3089, 3258, 3427, 3596, 3765, 3934, 4103, 4272, 4441, 4610, 4779, 4948, 5117, 5286, 5455, 5624, 5793, 5962, 6131, 6300, 6469, 6638, 6807, 6976, 7145, 7314, 7483, 7652]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # REMOVE: data6 = [0, 7363, 8537, 9711, 10884, 12058, 13232, 14406, 15580, 16753, 17927, 19101, 20275, 21449, 22623, 23796, 24970, 26144, 27318, 28492, 29665, 30839, 32013, 33187, 34361, 35534, 36708, 37882, 39056, 40230, 41404, 42577, 43751, 44925, 46099, 47273, 48446, 49620, 50794, 51968, 53142]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 刺伤持续攻击力 : {value7}%
    # REMOVE: data7 = [0, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 18, 19, 19, 20, 20, 21, 21]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [空之连刃]附加攻击力 : {value8}%
    # REMOVE: data8 = [0, 63, 68, 72, 76, 79, 84, 87, 93, 96, 99, 104, 107, 111, 115, 120, 123, 127, 131, 134, 138, 143, 147, 150, 155, 159, 161, 166, 171, 174, 177, 183, 186, 190, 196, 198, 202, 204, 209, 214, 219]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # [空之连刃]对刺伤状态的敌人的攻击力增加率 : {value9}%
    # REMOVE: data9 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # [装备传世武器后]
    # 物理攻击力增加率 : {value10}%
    # REMOVE: data10 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 魔法攻击力增加率 : {value11}%
    # REMOVE: data11 = [0, 1.4, 3.1, 4.6, 6, 7.5, 9, 10.6, 12.1, 13.6, 15.1, 16.5, 18.1, 19.6, 21.1, 22.6, 24.2, 25.7, 27.1, 28.6, 30.2, 31.7, 33.2, 34.7, 36.3, 37.7, 39.2, 40.7, 42.2, 43.8, 45.3, 46.8, 48.2, 49.8, 51.3, 52.8, 54.3, 55.9, 57.4, 58.8, 60.3]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 命中率增加 : {value12}%
    # REMOVE: data12 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)


    def effect(self, old, new):
        weapon = self.char.charEquipInfo["武器"].equInfo
        if weapon is None or weapon.itemDetailType != "太刀":
            return
        data = self.data1
        if weapon.categorize == "传世武器":
            data = self.data11
        self.associate = [{"type":"$*PAtkM","data":data}]
        return super().effect(old, new)

# 巨剑精通
# swordman_male/soul_bender/8c2379737c5acc935c1731f67f607655
# 41f1cdc2ff58bb5fdc287be0db2a8df3/8c2379737c5acc935c1731f67f607655
class Skill18(PassiveSkill):
    """
    装备巨剑系武器时， 增加攻击力和命中率。\n
    [转职为剑魂后]\n
    - 3级 : 使用[银光落刃]时可以使自身进入霸体状态， 并对敌人进行多段攻击； 使用[里 · 鬼剑术]时， 第1次斩击会出现飓风， 按住技能键可以蓄气进行第2次斩击； 使用[拔刀斩]时， 按住技能键可以进行蓄气攻击\n
    - 5级 : [格挡]成功时， 对敌人生成冲击波， 并有一定几率使其进入眩晕状态\n
    - 7级 : 使用[破军升龙击]后还可以追加捶击攻击\n
    [装备传世武器后]\n
    适用独立的攻击力/命中率增加数值。
    """
    name = "巨剑精通"
    learnLv = 15
    masterLv = 30
    maxLv = 40
    line = 0
    position = 0
    rangeLv = 3
    uuid = "8c2379737c5acc935c1731f67f607655"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 14.4, 15.9, 17.4, 18.9, 20.4, 21.9, 23.4, 24.9, 26.4, 27.9, 29.4, 30.9, 32.4, 33.9, 35.4, 36.9, 38.4, 39.9, 41.4, 42.9, 44.4, 45.9, 47.9, 49.9, 51.9, 53.9, 55.9, 57.9, 59.9, 61.9, 63.9, 65.9, 67.9, 69.9, 71.9, 73.9, 75.9, 77.9, 79.9, 81.9]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 魔法攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1.4, 3.1, 4.6, 6, 7.5, 9, 10.6, 12.1, 13.6, 15.1, 16.5, 18.1, 19.6, 21.1, 22.6, 24.2, 25.7, 27.1, 28.6, 30.2, 31.7, 33.2, 34.7, 36.3, 37.7, 39.2, 40.7, 42.2, 43.8, 45.3, 46.8, 48.2, 49.8, 51.3, 52.8, 54.3, 55.9, 57.4, 58.8, 60.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [剑魂特殊附加效果]
    # [格挡]冲击波攻击力 : {value3}%
    # REMOVE: data3 = [0, 324, 375, 427, 479, 530, 582, 633, 685, 737, 788, 840, 891, 943, 995, 1046, 1098, 1149, 1201, 1253, 1304, 1356, 1407, 1459, 1511, 1562, 1614, 1665, 1717, 1769, 1820, 1872, 1923, 1975, 2027, 2078, 2130, 2181, 2233, 2285, 2336]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [格挡]冲击波眩晕几率 : {value4}%
    # REMOVE: data4 = [0, 47.2, 48.8, 50.5, 52.2, 53.9, 55.6, 57.3, 58.9, 60.6, 62.3, 64, 65.7, 67.4, 69.1, 70.7, 72.4, 74.1, 75.8, 77.5, 79.2, 80.8, 82.5, 84.2, 85.9, 87.6, 89.3, 90.9, 92.6, 94.3, 96, 97.7, 99.4, 101.1, 102.7, 104.4, 106.1, 107.8, 109.5, 111.2, 112.8]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [格挡]冲击波眩晕持续时间 : {value5}秒
    # REMOVE: data5 = [0, 1.3, 1.3, 1.3, 1.4, 1.4, 1.4, 1.5, 1.5, 1.5, 1.5, 1.6, 1.6, 1.6, 1.7, 1.7, 1.7, 1.7, 1.8, 1.8, 1.8, 1.9, 1.9, 1.9, 1.9, 2, 2, 2, 2.1, 2.1, 2.1, 2.1, 2.2, 2.2, 2.2, 2.3, 2.3, 2.3, 2.3, 2.4, 2.4]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [银光落刃]多段攻击力 : {value6}%
    # REMOVE: data6 = [0, 340, 358, 375, 394, 411, 429, 451, 465, 483, 506, 519, 540, 559, 573, 595, 612, 635, 648, 666, 689, 701, 724, 742, 760, 778, 796, 813, 831, 854, 868, 885, 908, 920, 943, 961, 975, 997, 1014, 1036, 1050]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # [里 · 鬼剑术]达蓄气上限时攻击力增加率 : {value7}%
    # REMOVE: data7 = [0, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520, 520]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [拔刀斩]达蓄气上限时攻击力增加率 : {value8}%
    # REMOVE: data8 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # [装备传世武器后]
    # 物理攻击力增加率 : {value9}%
    # REMOVE: data9 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 魔法攻击力增加率 : {value10}%
    # REMOVE: data10 = [0, 1.4, 3.1, 4.6, 6, 7.5, 9, 10.6, 12.1, 13.6, 15.1, 16.5, 18.1, 19.6, 21.1, 22.6, 24.2, 25.7, 27.1, 28.6, 30.2, 31.7, 33.2, 34.7, 36.3, 37.7, 39.2, 40.7, 42.2, 43.8, 45.3, 46.8, 48.2, 49.8, 51.3, 52.8, 54.3, 55.9, 57.4, 58.8, 60.3]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 命中率增加 : {value11}%
    # REMOVE: data11 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)

    def effect(self, old, new):
        weapon = self.char.charEquipInfo["武器"].equInfo
        if weapon is None or weapon.itemDetailType != "巨剑":
            return
        data = self.data1
        if weapon.categorize == "传世武器":
            data = self.data10
        self.associate = [{"type":"$*PAtkM","data":data}]
        return super().effect(old, new)

# 钝器精通
# swordman_male/soul_bender/9cb6f9ed646fa87f9b7680a42ce83d1a
# 41f1cdc2ff58bb5fdc287be0db2a8df3/9cb6f9ed646fa87f9b7680a42ce83d1a
class Skill19(PassiveSkill):
    """
    装备钝器系武器时， 增加攻击力和命中率。\n
    [转职为剑魂后]\n
    - 3级 : 使用[后跳斩]时可以生成物理冲击波使敌人浮空； 使用[里 · 鬼剑术]时， 增加对眩晕状态下的敌人的攻击力。\n
    - 5级 : 进行跳跃攻击并命中敌人时可以生成物理冲击波。\n
    - 7级 : 使用[破军升龙击]后还可以追加蓄气型捶击攻击， 并生成冲击波； [幻影剑舞]最后一击由剑气变为冲击波； 通过[银光落刃]技能升级， 可以增加冲击波范围。\n
    [装备传世武器后]\n
    适用独立的攻击力/命中率增加数值。
    """
    name = "钝器精通"
    learnLv = 15
    masterLv = 30
    maxLv = 40
    line = 0
    position = 1
    rangeLv = 3
    uuid = "9cb6f9ed646fa87f9b7680a42ce83d1a"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 11.3, 12.8, 14.3, 15.8, 17.3, 18.8, 20.3, 21.8, 23.3, 24.8, 26.3, 27.8, 29.3, 30.8, 32.3, 33.8, 35.3, 36.8, 38.3, 39.8, 41.3, 42.8, 44.8, 46.8, 48.8, 50.8, 52.8, 54.8, 56.8, 58.8, 60.8, 62.8, 64.8, 66.8, 68.8, 70.8, 72.8, 74.8, 76.8, 78.8]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 魔法攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1.4, 2.9, 4.4, 5.8, 7.3, 8.7, 10.2, 11.7, 13.2, 14.6, 16, 17.5, 18.9, 20.4, 21.9, 23.4, 24.8, 26.2, 27.7, 29.1, 30.6, 32.1, 33.6, 35, 36.4, 37.9, 39.3, 40.8, 42.3, 43.8, 45.2, 46.6, 48.1, 49.6, 51, 52.5, 54, 55.4, 56.8, 58.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.4, 0.8, 1.2, 1.6, 2, 2.4, 2.8, 3.2, 3.6, 4, 4.4, 4.8, 5.2, 5.6, 6, 6.4, 6.8, 7.2, 7.6, 8, 8.4, 8.8, 9.2, 9.6, 10, 10.4, 10.8, 11.2, 11.6, 12, 12.4, 12.8, 13.2, 13.6, 14, 14.4, 14.8, 15.2, 15.6, 16]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [剑魂特殊附加效果]
    # [后跳斩]浮空力 : {value3}
    # REMOVE: data3 = [0, 505, 515, 524, 534, 544, 553, 562, 571, 581, 590, 600, 610, 619, 629, 638, 647, 656, 666, 676, 685, 695, 704, 714, 724, 733, 742, 751, 761, 770, 780, 790, 799, 809, 818, 827, 836, 846, 856, 865, 875]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [后跳斩]冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 461, 534, 608, 681, 755, 828, 902, 975, 1048, 1122, 1195, 1269, 1342, 1416, 1489, 1563, 1636, 1710, 1783, 1857, 1930, 2003, 2077, 2150, 2224, 2297, 2371, 2444, 2518, 2591, 2665, 2738, 2812, 2885, 2958, 3032, 3105, 3179, 3252, 3326]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 对眩晕状态的敌人造成的[里 · 鬼剑术]攻击力增加率 : {value5}%
    # REMOVE: data5 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 跳跃攻击时的浮空力 : {value6}
    # REMOVE: data6 = [0, 556, 586, 616, 646, 675, 705, 735, 765, 794, 824, 854, 884, 914, 943, 973, 1003, 1033, 1063, 1092, 1122, 1152, 1182, 1212, 1241, 1271, 1301, 1331, 1361, 1390, 1420, 1450, 1480, 1510, 1539, 1569, 1599, 1629, 1658, 1688, 1718]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 跳跃攻击时的冲击波攻击力 : {value7}%
    # REMOVE: data7 = [0, 707, 819, 932, 1044, 1157, 1270, 1382, 1495, 1608, 1720, 1833, 1945, 2058, 2171, 2283, 2396, 2509, 2621, 2734, 2846, 2959, 3072, 3184, 3297, 3410, 3522, 3635, 3748, 3860, 3973, 4085, 4198, 4311, 4423, 4536, 4649, 4761, 4874, 4986, 5099]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # [后跳斩]攻击力增加率 : {value8}%
    # REMOVE: data8 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # [装备传世武器后]
    # 物理攻击力增加率 : {value9}%
    # REMOVE: data9 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 魔法攻击力增加率 : {value10}%
    # REMOVE: data10 = [0, 1.4, 3.1, 4.6, 6, 7.5, 9, 10.6, 12.1, 13.6, 15.1, 16.5, 18.1, 19.6, 21.1, 22.6, 24.2, 25.7, 27.1, 28.6, 30.2, 31.7, 33.2, 34.7, 36.3, 37.7, 39.2, 40.7, 42.2, 43.8, 45.3, 46.8, 48.2, 49.8, 51.3, 52.8, 54.3, 55.9, 57.4, 58.8, 60.3]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 命中率增加 : {value11}%
    # REMOVE: data11 = [0, 0.3, 0.6, 0.9, 1.2, 1.5, 1.8, 2.1, 2.4, 2.7, 3, 3.3, 3.6, 3.9, 4.2, 4.5, 4.8, 5.1, 5.4, 5.7, 6, 6.3, 6.6, 6.9, 7.2, 7.5, 7.8, 8.1, 8.4, 8.7, 9, 9.3, 9.6, 9.9, 10.2, 10.5, 10.8, 11.1, 11.4, 11.7, 12]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)

    def effect(self, old, new):
        weapon = self.char.charEquipInfo["武器"].equInfo
        if weapon is None or weapon.itemDetailType != "钝器":
            return
        data = self.data1
        if weapon.categorize == "传世武器":
            data = self.data9
        self.associate = [{"type":"$*PAtkM","data":data}]
        return super().effect(old, new)


# 暗月降临
# swordman_male/soul_bender/a6c8f69107f8c4f5d1a0c7a57d000290
# 41f1cdc2ff58bb5fdc287be0db2a8df3/a6c8f69107f8c4f5d1a0c7a57d000290
class Skill21(PassiveSkill):
    """
    持续增加自身和队员的暗属性抗性， 并增加自身属性攻击力。
    """
    name = "暗月降临"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 5
    rangeLv = 5
    uuid = "a6c8f69107f8c4f5d1a0c7a57d000290"
    hasVP = False
    hasUP = False

    # 自身和队员暗属性抗性增加量 : {value0}
    # REMOVE: data0 = [0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 自身属性攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [{"data":data1}]

# 封印解除
# swordman_male/soul_bender/27bade584bb42fef68148d3a0b72bace
# 41f1cdc2ff58bb5fdc287be0db2a8df3/27bade584bb42fef68148d3a0b72bace
class Skill22(PassiveSkill):
    """
    解除鬼泣左臂封印， 释放压制的鬼神力量， 使[刀魂之卡赞]、 [冰霜之萨亚]、 [侵蚀之普戾蒙]、 [鬼斩]、 [瘟疫之罗刹]、 [冥炎之卡洛]技能各增加1级。 增加魔法暴击率和卡赞的效果范围。\n
    技能等级增加效果只能生效一次。
    """
    name = "封印解除"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 2
    rangeLv = 3
    uuid = "27bade584bb42fef68148d3a0b72bace"
    hasVP = False
    hasUP = False

    # 魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 6.5, 8, 9.5, 11, 12.5, 14, 15.5, 17, 18.5, 20, 21.5, 23, 24.5, 26, 27.5, 29, 30.5, 32, 33.5, 35]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 卡赞领域范围增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 施放速度增加 : {value2}%
    # REMOVE: data2 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    associate = [{"type":"+lv","data":[0] + [1]*maxLv,"skills":["刀魂之卡赞", "冰霜之萨亚", "侵蚀之普戾蒙", "鬼斩", "瘟疫之罗刹", "冥炎之卡洛"],"ratio":1}]# noqa: E501

# 侵蚀之普戾蒙
# swordman_male/soul_bender/01384bbfc346775d1267fa0bc4ca605f
# 41f1cdc2ff58bb5fdc287be0db2a8df3/01384bbfc346775d1267fa0bc4ca605f
class Skill23(ActiveSkill):
    """
    召唤普戾蒙， 使进入普戾蒙的领域内的敌人减少控制型异常状态抗性， 并增加自身造成的物理和魔法伤害。\n
    敌人走出普戾蒙的领域后， 普戾蒙效果仍会持续一定时间。\n
    普戾蒙存在的状态下， 再次施放此技能， 则原有的会消失， 并且重新在前方召唤出新的普戾蒙。\n
    学习[御鬼之极]时\n
    召唤功能消失， 变更为被动技能， 增加自身造成的伤害量、 减少受到攻击的敌人的控制型异常状态抗性。
    """
    name = "侵蚀之普戾蒙"
    learnLv = 15
    masterLv = 1
    maxLv = 11
    position = 6
    rangeLv = 3
    cd = 6
    mp = [40, 644]
    uuid = "01384bbfc346775d1267fa0bc4ca605f"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 44.2, 45, 45.7, 46.5, 47.2, 48, 48.7, 49.5, 50.2, 51, 51.7]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 敌人控制型异常状态抗性减少 : {value1}%
    # REMOVE: data1 = [0, 31.3, 31.5, 31.8, 32, 32.3, 32.5, 32.8, 33, 33.3, 33.5, 33.8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 伤害增加率 : {value2}%
    # REMOVE: data2 = [0, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 敌人离开领域后效果持续时间 : {value3}秒
    # REMOVE: data3 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [学习御鬼之极后]
    # 控制型异常状态抗性减少效果持续时间 : {value4}秒
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 效果范围 : {value5}px
    # REMOVE: data5 = [0, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    associate  = [{"data":data2}]


# 月光斩
# swordman_male/soul_bender/a2d943797daca862a6f321aca6ac9bfa
# 41f1cdc2ff58bb5fdc287be0db2a8df3/a2d943797daca862a6f321aca6ac9bfa
class Skill25(ActiveSkill):
    """
    向敌人发出暗属性伤害的单手月形斩击， 并追加一个发动单手上斩的[月光斩]。\n
    向前方前进的同时施放[月光斩]， 可以通过方向键调整移动距离。\n
    [转职为鬼泣后]\n
    可以强制中断并施放。\n
    可掌握[满月斩]\n
    若掌握[满月斩]时， 使用单手上斩后可以追加一个双手上斩。\n
    学习[鬼神冠冕]后\n
    制造月亮并用斩击将鬼气注入到月亮之中， 然后破坏黑月攻击敌人。 破坏黑月时使敌人进入失明状态。 删除追加按键功能。
    """
    name = "月光斩"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 4
    rangeLv = 2
    cd = 4
    mp = [17, 182]
    uuid = "a2d943797daca862a6f321aca6ac9bfa"
    hasVP = False
    hasUP = True

    # 月形斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1221, 1345, 1469, 1593, 1716, 1840, 1964, 2088, 2212, 2336, 2460, 2583, 2707, 2831, 2955, 3079, 3203, 3327, 3451, 3574, 3698, 3822, 3946, 4070, 4194, 4318, 4441, 4565, 4689, 4813, 4937, 5061, 5185, 5309, 5432, 5556, 5680, 5804, 5928, 6052, 6176, 6299, 6423, 6547, 6671, 6795, 6919, 7043, 7167, 7290, 7414, 7538, 7662, 7786, 7910, 8034, 8157, 8281, 8405, 8529, 8653, 8777, 8901, 9024, 9148, 9272, 9396, 9520, 9644, 9768]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 单手上斩攻击力 : {value1}%
    # REMOVE: data1 = [0, 1379, 1519, 1659, 1799, 1939, 2079, 2218, 2358, 2498, 2638, 2778, 2918, 3058, 3198, 3338, 3478, 3617, 3757, 3897, 4037, 4177, 4317, 4457, 4597, 4737, 4877, 5017, 5156, 5296, 5436, 5576, 5716, 5856, 5996, 6136, 6276, 6416, 6555, 6695, 6835, 6975, 7115, 7255, 7395, 7535, 7675, 7815, 7954, 8094, 8234, 8374, 8514, 8654, 8794, 8934, 9074, 9214, 9353, 9493, 9633, 9773, 9913, 10053, 10193, 10333, 10473, 10613, 10753, 10892, 11032]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 双手上斩攻击力 : {value2}%
    # REMOVE: data2 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 学习[鬼神冠冕]后
    # 制造月亮攻击力 : {value3}%
    # REMOVE: data3 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    data3 = [0, 1936, 2135, 2332, 2526, 2725, 2919, 3116, 3313, 3511, 3708, 3903, 4100, 4294, 4493, 4687, 4884, 5085, 5282, 5472, 5673, 5872, 6066, 6263, 6460, 6659, 6851, 7048, 7245, 7443, 7638, 7835, 8033, 8230, 8422, 8621, 8821, 9013, 9212, 9410, 9602, 9801, 9998, 10197, 10394, 10588, 10788, 10980, 11179, 11375, 11570, 11769, 11968, 12160, 12357, 12556, 12750, 12949, 13144, 13343, 13537, 13734, 13930, 14127, 14324, 14525, 14717, 14916, 15108, 15307, 15507]# noqa: E501
    hit3 = 1
    # 染月攻击力 : {value4}%
    # REMOVE: data4 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    data4 = [0, 1221, 1338, 1465, 1588, 1712, 1836, 1960, 2079, 2205, 2332, 2453, 2579, 2701, 2827, 2948, 3072, 3194, 3320, 3444, 3568, 3689, 3815, 3937, 4061, 4185, 4306, 4430, 4558, 4680, 4803, 4930, 5049, 5173, 5297, 5420, 5547, 5671, 5790, 5916, 6038, 6163, 6287, 6407, 6531, 6659, 6781, 6904, 7031, 7152, 7276, 7398, 7521, 7647, 7772, 7893, 8017, 8141, 8264, 8388, 8512, 8631, 8758, 8884, 9007, 9131, 9255, 9377, 9500, 9624, 9748]# noqa: E501
    hit4 = 1
    # 黑月爆炸攻击力 : {value5}%
    # REMOVE: data5 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    data5 = [0, 1379, 1520, 1658, 1799, 1936, 2077, 2220, 2360, 2502, 2637, 2780, 2919, 3058, 3198, 3337, 3480, 3618, 3759, 3896, 4036, 4175, 4316, 4459, 4595, 4740, 4881, 5018, 5160, 5297, 5438, 5576, 5719, 5860, 5996, 6137, 6276, 6418, 6554, 6695, 6839, 6979, 7120, 7259, 7398, 7538, 7677, 7820, 7959, 8097, 8238, 8378, 8515, 8655, 8798, 8940, 9078, 9217, 9357, 9498, 9639, 9780, 9920, 10057, 10198, 10338, 10477, 10617, 10758, 10900, 11036]# noqa: E501
    hit5 = 1
    # 失明几率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 失明持续时间 : {value7}秒
    # REMOVE: data7 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 视野 : {value8}px
    # REMOVE: data8 = [0, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 命中率减少量 : {value9}%
    # REMOVE: data9 = [0, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5, 5, 5, 6, 6, 7, 7, 7, 8, 8, 9, 9, 9, 10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 15, 16, 16, 17, 17, 17, 18, 18, 19, 19, 19, 20, 20, 21, 21, 21, 22, 22, 23, 23, 24, 24, 24, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # [范围信息]
    # 斩击范围比率 : {value10}%
    # REMOVE: data10 = [0, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135, 135]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)

# 暗之亲和
# swordman_male/soul_bender/da6e37c1e3f0e8867f70007d89c239ff
# 41f1cdc2ff58bb5fdc287be0db2a8df3/da6e37c1e3f0e8867f70007d89c239ff
class Skill26(PassiveSkill):
    """
    强化对黑暗的亲和力， 可以增加自身的暗属性抗性， 但光属性抗性将减少。
    """
    name = "暗之亲和"
    learnLv = 18
    masterLv = 1
    maxLv = 1
    line = 15
    position = 7
    rangeLv = 1
    uuid = "da6e37c1e3f0e8867f70007d89c239ff"
    hasVP = False
    hasUP = False

    # 暗属性抗性增加 : {value0}
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 光属性抗性减少 : {value1}
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 残影之凯贾
# swordman_male/soul_bender/d085127b0edd719782bd618d5688f4a1
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d085127b0edd719782bd618d5688f4a1
class Skill27(ActiveSkill):
    """
    借鬼神之力增加自身的暴击伤害和移动速度， 且前冲的一定时间内会进入无敌状态； 基本攻击和前冲攻击会转换成受[基础精通]影响的暗属性魔法攻击。\n
    同时， 增加物理/魔法防御力， 且被击时有一定几率进入无敌状态。
    """
    name = "残影之凯贾"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5
    rangeLv = 3
    cd = 5
    uuid = "d085127b0edd719782bd618d5688f4a1"
    hasVP = False
    hasUP = False
    buff = True

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 暴击伤害增加率 : {value2}%
    # REMOVE: data2 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 移动速度增加 : {value3}%
    # REMOVE: data3 = [0, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 第1击攻击力 : {value4}%
    # REMOVE: data4 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 1
    # 第2击攻击力 : {value5}%
    # REMOVE: data5 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 1
    # 第3击攻击力 : {value6}%
    # REMOVE: data6 = [0, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175, 175]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    hit6 = 1
    # 第4击攻击力 : {value7}%
    # REMOVE: data7 = [0, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194, 194]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    hit7 = 1
    # 前冲攻击力 : {value8}%
    # REMOVE: data8 = [0, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151, 151]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 物理防御力增加量 : {value9}
    # REMOVE: data9 = [0, 1409, 2818, 4228, 5637, 7046, 8455, 9865, 11274, 12683, 14092, 15501, 16911, 18320, 19729, 21138, 22548, 23957, 25366, 26775, 28184]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 魔法防御力增加量 : {value10}
    # REMOVE: data10 = [0, 1409, 2818, 4228, 5637, 7046, 8455, 9865, 11274, 12683, 14092, 15501, 16911, 18320, 19729, 21138, 22548, 23957, 25366, 26775, 28184]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 回避率增加 : {value11}%
    # REMOVE: data11 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 被击时无敌发动几率 : {value12}%
    # REMOVE: data12 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 被击时无敌持续时间 : {value13}秒
    # REMOVE: data13 = [0, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)

# 满月斩
# swordman_male/soul_bender/c77a417c43de80c4ce32c1ed405d174a
# 41f1cdc2ff58bb5fdc287be0db2a8df3/c77a417c43de80c4ce32c1ed405d174a
class Skill28(PassiveSkill):
    """
    施放月光斩的单手上斩后， 追加一个造成暗属性伤害的双手上斩。
    """
    name = "满月斩"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 4
    rangeLv = 1
    uuid = "c77a417c43de80c4ce32c1ed405d174a"
    hasVP = False
    hasUP = False



# 湮灭仪式
# swordman_male/soul_bender/2e9c5a06ff3fe8aea672a2a55c40fdbf
# 41f1cdc2ff58bb5fdc287be0db2a8df3/2e9c5a06ff3fe8aea672a2a55c40fdbf
class Skill30(ActiveSkill):
    """
    消除地图中的[侵蚀之普戾蒙]、 [冰霜之萨亚]、 [瘟疫之罗刹]。
    """
    name = "湮灭仪式"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 7
    rangeLv = 2
    cd = 1
    mp = [50, 50]
    uuid = "2e9c5a06ff3fe8aea672a2a55c40fdbf"
    hasVP = False
    hasUP = False


# 鬼神解放
# swordman_male/soul_bender/b1ccbd90d0b40f543ece3b18fcef827f
# 41f1cdc2ff58bb5fdc287be0db2a8df3/b1ccbd90d0b40f543ece3b18fcef827f
class Skill31(PassiveSkill):
    """
    施放[裂波斩]、 [鬼斩]、 [月光斩]、 [鬼影鞭]、 [死亡墓碑]、 [鬼影闪]、 [鬼斩 : 狂怒]、 [第7鬼神 : 怖拉修]、 [鬼斩 : 炼狱]、 [幽魂降临 : 式]、 [王者号令 : 吉格降临]、 [鬼神剑·黄泉摆渡]过程中， 可以无施放动作立即发动[侵蚀之普戾蒙]、 [冰霜之萨亚]、 [瘟疫之罗刹]、 [冥祭之沼]、 [幽魂之布雷德]。\n
    攻击技能倾向不同， 地板技能设置的位置也不相同。\n
    只有学习[噬灵鬼斩]、 [满月斩]后， 才能在[鬼斩]和[月光斩]施放中发动以上技能。
    """
    name = "鬼神解放"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 2
    rangeLv = 2
    uuid = "b1ccbd90d0b40f543ece3b18fcef827f"
    hasVP = False
    hasUP = False

    # 前方100px设置技能 : [裂波斩]、 [鬼斩]、 [月光斩]、 [鬼影鞭]、 [鬼斩 - 狂怒]、 [冥炎剑]
    # 中央设置技能 : [死亡墓碑]
    # 后方100px设置技能 : [鬼影闪]
    # 前方200px设置技能 : [第7鬼神 - 怖拉修]、 [鬼斩 - 炼狱]、 [幽魂降临 - 式]、 [王者号令 - 吉格降临]、 [鬼神剑·黄泉摆渡]

# 噬灵鬼斩
# swordman_male/soul_bender/4655101518604f874721b3cc249aae10
# 41f1cdc2ff58bb5fdc287be0db2a8df3/4655101518604f874721b3cc249aae10
class Skill32(PassiveSkill):
    """
    使用[鬼斩]后， 可追加操作施放[噬灵鬼斩]。\n
    持续按住[鬼斩]技能键可以蓄气， 使攻击力大幅度增加； 攻击后， 可通过追加操作施放[噬灵鬼斩]。\n
    当蓄气达最大值时， 可以使自身进入霸体状态， 并可通过追加操作向前推进斩击敌人并喷射鬼神冲波。\n
    鬼神冲波为卡赞、 萨亚、 普戾蒙三者中最后召唤出的鬼神； 若未召唤过任何鬼神， 则鬼神冲波默认为卡赞。\n
    按前方向键或不按方向键， 自身和鬼神一起向前推进； 按后方向键， 只有鬼神向前推进。
    """
    name = "噬灵鬼斩"
    learnLv = 25
    masterLv = 1
    maxLv = 5
    position = 3
    rangeLv = 3
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = False

    # 蓄气时间上限 : {value0}秒
    # REMOVE: data0 = [0, 0.15, 0.15, 0.15, 0.15, 0.15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 噬灵鬼斩攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 20, 30, 40, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 最大蓄气时霸体持续时间 : {value2}秒n[范围信息]
    # REMOVE: data2 = [0, 1, 1.5, 2, 2.5, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 噬灵鬼斩大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 105, 110, 115, 120]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    associate = [{"type":"*power7","data":data1,"skills":["鬼斩"]}]# noqa: E501


# 冰霜之萨亚
# swordman_male/soul_bender/04883563896fe1adac7505c6146b5f59
# 41f1cdc2ff58bb5fdc287be0db2a8df3/04883563896fe1adac7505c6146b5f59
class Skill34(ActiveSkill):
    """
    召唤出萨亚， 使其以一定的时间间隔给予召唤领域内的敌人冰和暗属性魔法伤害， 并使敌人进入冰冻状态， 效果持续一定时间。\n
    已经召唤萨亚的状态下施放萨亚时， 会在回收后在前方重新召唤萨亚\n
    利用ON/OFF可以开启或关闭冰冻效果。
    """
    name = "冰霜之萨亚"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 6
    rangeLv = 2
    cd = 15
    mp = [150, 1260]
    uuid = "04883563896fe1adac7505c6146b5f59"
    hasVP = False
    hasUP = True

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 攻击间隔 : {value1}秒
    # REMOVE: data1 = [0, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击力 : {value2}%
    # REMOVE: data2 = [0, 902, 993, 1085, 1176, 1268, 1359, 1451, 1542, 1634, 1725, 1817, 1908, 2000, 2091, 2183, 2274, 2366, 2457, 2549, 2640, 2732, 2823, 2915, 3006, 3098, 3189, 3281, 3372, 3464, 3555, 3647, 3738, 3830, 3921, 4013, 4104, 4196, 4287, 4379, 4470, 4562, 4653, 4745, 4836, 4928, 5019, 5111, 5202, 5294, 5385, 5477, 5568, 5660, 5751, 5843, 5934, 6026, 6117, 6209, 6300, 6392, 6483, 6575, 6666, 6758, 6849, 6941, 7032, 7124, 7215]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 20
    # 冰冻几率 : {value3}%
    # REMOVE: data3 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 冰冻持续时间 : {value4}秒
    # REMOVE: data4 = [0, 1.5, 1.5, 1.6, 1.7, 1.8, 1.8, 1.9, 2, 2.1, 2.2, 2.2, 2.3, 2.4, 2.5, 2.6, 2.6, 2.7, 2.8, 2.9, 3, 3, 3.1, 3.2, 3.3, 3.3, 3.4, 3.5, 3.6, 3.7, 3.7, 3.8, 3.9, 4, 4.1, 4.1, 4.2, 4.3, 4.4, 4.5, 4.5, 4.6, 4.7, 4.8, 4.8, 4.9, 5, 5.1, 5.2, 5.2, 5.3, 5.4, 5.5, 5.6, 5.6, 5.7, 5.8, 5.9, 6, 6, 6.1, 6.2, 6.3, 6.3, 6.4, 6.5, 6.6, 6.7, 6.7, 6.8, 6.9]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 领域范围 : {value5}px
    # REMOVE: data5 = [0, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

# 鬼影鞭
# swordman_male/soul_bender/d429147c372b549c3dadcabcba50787f
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d429147c372b549c3dadcabcba50787f
class Skill35(ActiveSkill):
    """
    像挥鞭子一样挥舞手中的武器， 并把远距离的敌人拉到身前。\n
    若对自身在[冥炎之卡洛]状态， 则会对敌人附着冥炎。
    """
    name = "鬼影鞭"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 3
    cd = 8
    mp = [55, 700]
    uuid = "d429147c372b549c3dadcabcba50787f"
    hasVP = False
    hasUP = True

    # 第1击攻击力 : {value0}%
    # REMOVE: data0 = [0, 3035, 3519, 4003, 4487, 4971, 5455, 5938, 6422, 6906, 7390, 7874, 8358, 8842, 9325, 9809, 10293, 10777, 11261, 11745, 12229, 12713, 13196, 13680, 14164, 14648, 15132, 15616, 16100, 16583, 17067, 17551, 18035, 18519, 19003, 19487, 19971, 20454, 20938, 21422, 21906, 22390, 22874, 23358, 23842, 24325, 24809, 25293, 25777, 26261, 26745, 27229, 27712, 28196, 28680, 29164, 29648, 30132, 30616, 31100, 31583, 32067, 32551, 33035, 33519, 34003, 34487, 34970, 35454, 35938, 36422]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 第2击攻击力 : {value1}%
    # REMOVE: data1 = [0, 7089, 8219, 9349, 10479, 11609, 12739, 13869, 15000, 16130, 17260, 18390, 19520, 20650, 21780, 22910, 24040, 25170, 26301, 27431, 28561, 29691, 30821, 31951, 33081, 34211, 35341, 36471, 37602, 38732, 39862, 40992, 42122, 43252, 44382, 45512, 46642, 47773, 48903, 50033, 51163, 52293, 53423, 54553, 55683, 56813, 57943, 59074, 60204, 61334, 62464, 63594, 64724, 65854, 66984, 68114, 69244, 70375, 71505, 72635, 73765, 74895, 76025, 77155, 78285, 79415, 80545, 81676, 82806, 83936, 85066]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 僵直率 : {value2}%
    # REMOVE: data2 = [0, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 范围比率 : {value3}%
    # REMOVE: data3 = [0, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 死亡墓碑
# swordman_male/soul_bender/e49e57b2e8fbeceb0a2c56a0c63fe6c5
# 41f1cdc2ff58bb5fdc287be0db2a8df3/e49e57b2e8fbeceb0a2c56a0c63fe6c5
class Skill36(ActiveSkill):
    """
    在自身周围一定区域内落下墓碑攻击敌人， 有一定几率使被击中的敌人进入诅咒状态。\n
    墓碑掉落时， 自身会进入霸体状态并无法移动， 按跳跃键可以中断技能。\n
    按住向前方向键的状态下施放技能时， 在前方落下墓碑， 鬼神解放效果位置也变更到前方。\n
    在[冥炎之卡洛]状态下施放[死亡墓碑]时， 可以使冥炎附身在敌人身上。
    """
    name = "死亡墓碑"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [165, 1386]
    uuid = "e49e57b2e8fbeceb0a2c56a0c63fe6c5"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 施放范围 : {value0}px
    # REMOVE: data0 = [0, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 每秒掉落数量 : {value1}个
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 持续时间 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 攻击力 : {value3}%
    # REMOVE: data3 = [0, 1953, 2151, 2349, 2547, 2746, 2944, 3142, 3340, 3538, 3736, 3934, 4132, 4331, 4529, 4727, 4925, 5123, 5321, 5519, 5717, 5916, 6114, 6312, 6510, 6708, 6906, 7104, 7303, 7501, 7699, 7897, 8095, 8293, 8491, 8689, 8888, 9086, 9284, 9482, 9680, 9878, 10076, 10274, 10473, 10671, 10869, 11067, 11265, 11463, 11661, 11860, 12058, 12256, 12454, 12652, 12850, 13048, 13246, 13445, 13643, 13841, 14039, 14237, 14435, 14633, 14831, 15030, 15228, 15426, 15624]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 诅咒几率 : {value4}%
    # REMOVE: data4 = [0, 24, 25.2, 26.4, 27.6, 28.8, 30, 31.2, 32.4, 33.6, 34.8, 36, 37.2, 38.4, 39.6, 40.8, 42, 43.2, 44.4, 45.6, 46.8, 48, 49.2, 50.4, 51.6, 52.8, 54, 55.2, 56.4, 57.6, 58.8, 60, 61.2, 62.4, 63.6, 64.8, 66, 67.2, 68.4, 69.6, 70.8, 72, 73.2, 74.4, 75.6, 76.8, 78, 79.2, 80.4, 81.6, 82.8, 84, 85.2, 86.4, 87.6, 88.8, 90, 91.2, 92.4, 93.6, 94.8, 96, 97.2, 98.4, 99.6, 100.8, 102, 103.2, 104.4, 105.6, 106.8]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 诅咒持续时间 : {value5}秒
    # REMOVE: data5 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [范围信息]
    # 范围比率 : {value6}%
    # REMOVE: data6 = [0, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360, 360]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

    def vp_1(self):
        """
        [死亡墓碑]\n
        死亡墓碑变更为吉格召集的墓碑， 可通过[鬼神解放]施放\n
        吉格召集墓碑期间， 所受伤害 -70%
        """
        ...

    def vp_2(self):
        """
        [死亡墓碑]\n
        灵魂们被引导至冥界， 其墓碑一次性落下攻击敌人\n
        - 墓碑掉落数量 +100%\n
        - 总攻击力相同\n
        - 墓碑掉落范围 +40%
        """
        ...

# 瘟疫之罗刹
# swordman_male/soul_bender/38612d8f2561edc2eb68d5057a837bfa
# 41f1cdc2ff58bb5fdc287be0db2a8df3/38612d8f2561edc2eb68d5057a837bfa
class Skill37(ActiveSkill):
    """
    制造瘟疫鬼神的领域， 召唤罗刹。\n
    罗刹会附到敌人身上， 对敌人造成腐蚀伤害， 减少硬直并使其进入减速状态， 并周期性诱发失明和诅咒状态中的任意一种异常状态。\n
     罗刹对单个敌人可以附着1个分身。\n
    召唤出罗刹的状态下， 若再次施放[瘟疫之罗刹]， 则原有的会消失， 并且重新在前方召唤出新的罗刹。\n
    在决斗场中， 敌人进入领域内时， 罗刹经过一定时间后附在敌人身上。
    """
    name = "瘟疫之罗刹"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 7
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [154, 1293]
    uuid = "38612d8f2561edc2eb68d5057a837bfa"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # [鬼神领域]
    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [罗刹减益效果]
    # 分身持续时间 : {value1}秒
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 腐蚀攻击力 : {value2}%
    # REMOVE: data2 = [0, 1854, 2042, 2230, 2418, 2606, 2794, 2983, 3171, 3359, 3547, 3735, 3923, 4111, 4299, 4487, 4675, 4863, 5051, 5240, 5428, 5616, 5804, 5992, 6180, 6368, 6556, 6744, 6932, 7120, 7309, 7497, 7685, 7873, 8061, 8249, 8437, 8625, 8813, 9001, 9189, 9377, 9566, 9754, 9942, 10130, 10318, 10506, 10694, 10882, 11070, 11258, 11446, 11635, 11823, 12011, 12199, 12387, 12575, 12763, 12951, 13139, 13327, 13515, 13703, 13892, 14080, 14268, 14456, 14644, 14832]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 15
    # 异常状态诱发间隔 : {value3}秒
    # REMOVE: data3 = [0, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 减速几率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 减速状态下攻击速度减少率 : {value5}%
    # REMOVE: data5 = [0, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11, 12, 12, 12, 12, 12, 13, 13, 13, 13, 13, 14, 14, 14]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 减速状态下移动速度减少率 : {value6}%
    # REMOVE: data6 = [0, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 硬直减少量 : {value7}
    # REMOVE: data7 = [0, 15, 31, 46, 62, 77, 92, 108, 123, 138, 154, 169, 185, 200, 215, 231, 246, 262, 277, 292, 308, 323, 338, 354, 369, 385, 400, 415, 431, 446, 462, 477, 492, 508, 523, 539, 554, 569, 585, 600, 615, 631, 646, 662, 677, 692, 708, 723, 739, 754, 769, 785, 800, 815, 831, 846, 862, 877, 892, 908, 923, 939, 954, 969, 985, 1000, 1015, 1031, 1046, 1062, 1077]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 诅咒几率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 诅咒时间 : {value9}秒
    # REMOVE: data9 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 失明几率 : {value10}%
    # REMOVE: data10 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 失明持续时间 : {value11}秒
    # REMOVE: data11 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 视野 : {value12}px
    # REMOVE: data12 = [0, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 命中率减少量 : {value13}%
    # REMOVE: data13 = [0, 1, 1, 2, 2, 3, 3, 3, 4, 4, 5, 5, 5, 6, 6, 7, 7, 7, 8, 8, 9, 9, 9, 10, 10, 11, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 15, 16, 16, 17, 17, 17, 18, 18, 19, 19, 19, 20, 20, 21, 21, 21, 22, 22, 23, 23, 24, 24, 24, 25, 25, 26, 26, 27, 27, 28, 28, 28, 29, 29]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)
    # [范围信息]
    # 召唤范围 : {value14}px
    # REMOVE: data14 = [0, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14)
    # [决斗场]
    # 罗刹附在敌人身上的前置时间 : {value15}秒
    # REMOVE: data15 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15)

    def vp_1(self):
        """
        [瘟疫之罗刹]\n
        罗刹分身会离开领域范围搜寻周围敌人\n
         - 总攻击力相同\n
         - 施放时生成12个罗刹分身\n
        罗刹领域范围 +40%
        """
        ...

    def vp_2(self):
        """
        [瘟疫之罗刹]\n
        罗刹降临于现世， 根据鬼泣的攻击直接攻击敌人\n
         - 总攻击力相同\n
         - 罗刹反应技能 :  [鬼斩]、 [月光斩]、 [鬼影鞭]、 [鬼斩 : 狂怒]、 [鬼斩 : 炼狱]\n
         - 使被锚命中的敌人进入强制控制状态， 同时吸附敌人\n
         - 罗刹降临持续时间上限 : 3秒
        """
        ...

# 鬼影闪
# swordman_male/soul_bender/bc11d28c04e01923a093d65752c55516
# 41f1cdc2ff58bb5fdc287be0db2a8df3/bc11d28c04e01923a093d65752c55516
class Skill38(ActiveSkill):
    """
    以极快的速度向前移动一段距离并斩击敌人， 但只能在[残影之凯贾]使用前冲后进入无敌状态时施放。\n
    被斩击的敌人在一定时间内会进入禁锢状态， 状态结束时会对敌人造成暗属性伤害。\n
    - 学习[御鬼之极]时 -\n
    “只能在[残影之凯贾]使用前冲后进入无敌状态时施放”变更为可无条件施放， 大幅减少施放后僵直。
    """
    name = "鬼影闪"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 5
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [200, 1680]
    uuid = "bc11d28c04e01923a093d65752c55516"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 17363, 19124, 20886, 22647, 24409, 26170, 27932, 29693, 31455, 33216, 34978, 36739, 38501, 40262, 42023, 43785, 45546, 47308, 49069, 50831, 52592, 54354, 56115, 57877, 59638, 61400, 63161, 64923, 66684, 68445, 70207, 71968, 73730, 75491, 77253, 79014, 80776, 82537, 84299, 86060, 87822, 89583, 91344, 93106, 94867, 96629, 98390, 100152, 101913, 103675, 105436, 107198, 108959, 110721, 112482, 114244, 116005, 117766, 119528, 121289, 123051, 124812, 126574, 128335, 130097, 131858, 133620, 135381, 137143, 138904]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 移动距离 : {value1}px
    # REMOVE: data1 = [0, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370, 370]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [鬼影闪]\n
        可以在施放转职技能过程中施放\n
         - 施放转职技能过程中施放时， 仅由凯贾向前移动并施放[鬼影闪]\n
        [鬼影闪]命中时， 对敌人附加[冥炎之卡洛]的黑色火焰\n
         - 只能在[冥炎之卡洛]状态下发动\n
        攻击范围 +30%
        """
        ...

    def vp_2(self):
        """
        [鬼影闪]\n
        可以强制中断部分技能并施放[鬼影闪]\n
         - 可强制中断的技能 : [鬼斩]、 [鬼斩 : 狂怒]、 [鬼斩 : 炼狱]、 [鬼神剑·黄泉摆渡]\n
        可以在空中施放[鬼影闪]\n
         - 在空中施放时， 沿对角线方向快速落下并斩击
        """
        ...

# 鬼斩 : 狂怒
# swordman_male/soul_bender/56aa7844a2da23f5bea9b585aea5ae45
# 41f1cdc2ff58bb5fdc287be0db2a8df3/56aa7844a2da23f5bea9b585aea5ae45
class Skill39(ActiveSkill):
    """
    在剑中注入鬼神之力后， 正面下斩并引发爆炸。 使被爆炸命中的敌人受到暗属性魔法伤害。
    """
    name = "鬼斩 : 狂怒"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 3
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [165, 1386]
    uuid = "56aa7844a2da23f5bea9b585aea5ae45"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 21162, 23309, 25456, 27603, 29749, 31896, 34043, 36190, 38337, 40484, 42631, 44778, 46924, 49071, 51218, 53365, 55512, 57659, 59806, 61953, 64099, 66246, 68393, 70540, 72687, 74834, 76981, 79127, 81274, 83421, 85568, 87715, 89862, 92009, 94156, 96302, 98449, 100596, 102743, 104890, 107037, 109184, 111331, 113477, 115624, 117771, 119918, 122065, 124212, 126359, 128505, 130652, 132799, 134946, 137093, 139240, 141387, 143534, 145680, 147827, 149974, 152121, 154268, 156415, 158562, 160709, 162855, 165002, 167149, 169296]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [鬼斩 : 狂怒]\n
        基本冷却时间变更为40秒\n
        总攻击力 +100%\n
        攻击后生成对前方造成持续伤害的灵魂旋风\n
         - 总攻击力与原攻击力相同\n
         - 灵魂旋风命中时将敌人聚集到中心位置\n
        长按技能键可以蓄气\n
         - 最大蓄气状态维持时间 : 0.6秒\n
         - 蓄气0.2秒以上时旋风范围增加
        """
        self.cd = 40
        self.skillRation *= 2
        ...

    def vp_2(self):
        """
        [鬼斩 : 狂怒]\n
        施放时利用卡洛之力对一定范围内的所有敌人发动鬼神斩击\n
         - 总攻击力相同\n
        存在附着卡洛的黑色火焰的敌人时， 适用以下效果\n
         - 在任何位置都会受到鬼神斩击的伤害\n
         - 利用鬼神之力引发爆炸， 一次性结算卡洛的黑色火焰伤害
        """
        ...

# 冥炎之卡洛
# swordman_male/soul_bender/0b8db1e10b3abbd24d38564e708675d5
# 41f1cdc2ff58bb5fdc287be0db2a8df3/0b8db1e10b3abbd24d38564e708675d5
class Skill40(ActiveSkill):
    """
    冥炎之卡洛附身， 并向敌人发射卡洛的分身进行攻击。 受到攻击的敌人身上将会出现黑色火焰。\n
    再次施放卡洛时， 卡洛将变成紫色， 在该状态下击中敌人时， 不会触发黑色火焰。
    """
    name = "冥炎之卡洛"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 7
    rangeLv = 2
    cube = 2
    cd = 5
    mp = [492, 4920]
    uuid = "0b8db1e10b3abbd24d38564e708675d5"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 分身攻击力 : {value1}%
    # REMOVE: data1 = [0, 521, 574, 627, 680, 732, 785, 838, 891, 944, 997, 1050, 1102, 1155, 1208, 1261, 1314, 1367, 1420, 1472, 1525, 1578, 1631, 1684, 1737, 1790, 1842, 1895, 1948, 2001, 2054, 2107, 2159, 2212, 2265, 2318, 2371, 2424, 2477, 2529, 2582, 2635, 2688, 2741, 2794, 2847, 2899, 2952, 3005, 3058, 3111, 3164, 3217, 3269, 3322, 3375, 3428, 3481, 3534, 3587, 3639, 3692, 3745, 3798, 3851, 3904, 3957, 4009, 4062, 4115, 4168]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 火焰攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 火焰伤害间隔 : {value3}秒
    # REMOVE: data3 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 火焰攻击力 : {value4}%
    # REMOVE: data4 = [0, 318, 350, 383, 415, 447, 479, 512, 544, 576, 608, 641, 673, 705, 737, 770, 802, 834, 866, 899, 931, 963, 995, 1028, 1060, 1092, 1125, 1157, 1189, 1221, 1254, 1286, 1318, 1350, 1383, 1415, 1447, 1479, 1512, 1544, 1576, 1608, 1641, 1673, 1705, 1737, 1770, 1802, 1834, 1867, 1899, 1931, 1963, 1996, 2028, 2060, 2092, 2125, 2157, 2189, 2221, 2254, 2286, 2318, 2350, 2383, 2415, 2447, 2479, 2512, 2544]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 0

    mode = ["分身","冥炎"]

    def setMode(self, mode):
        if mode == "冥炎":
            self.hit1 = 0
            self.hit4 = 1
        return super().setMode(mode)

# 冥炎剑
# swordman_male/soul_bender/1c1a9606eb702ebe5a7bb4397f3aeae0
# 41f1cdc2ff58bb5fdc287be0db2a8df3/1c1a9606eb702ebe5a7bb4397f3aeae0
class Skill41(ActiveSkill):
    """
    只能在[冥炎之卡洛]状态下使用。\n
    召唤凝聚卡洛之力的冥炎剑， 以二刀流动作向前突进， 连续攻击敌人。\n
    被击中的敌人会被附着黑色火焰。
    """
    name = "冥炎剑"
    learnLv = 45
    masterLv = 1
    line = 50
    maxLv = 70
    position = 7
    rangeLv = 2
    cube = 2
    cd = 45
    uuid = "1c1a9606eb702ebe5a7bb4397f3aeae0"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 第1击攻击力 : {value0}%
    # REMOVE: data0 = [0, 2070, 2280, 2490, 2700, 2910, 3120, 3330, 3540, 3750, 3960, 4170, 4380, 4589, 4799, 5009, 5219, 5429, 5639, 5849, 6059, 6269, 6479, 6689, 6899, 7109, 7319, 7529, 7739, 7949, 8159, 8369, 8579, 8789, 8999, 9209, 9419, 9629, 9839, 10049, 10259, 10469, 10679, 10889, 11099, 11309, 11519, 11729, 11939, 12149, 12359, 12569, 12779, 12989, 13199, 13408, 13618, 13828, 14038, 14248, 14458, 14668, 14878, 15088, 15298, 15508, 15718, 15928, 16138, 16348, 16558]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 第2击攻击力 : {value1}%
    # REMOVE: data1 = [0, 3030, 3337, 3644, 3952, 4259, 4566, 4874, 5181, 5488, 5796, 6103, 6410, 6718, 7025, 7332, 7640, 7947, 8255, 8562, 8869, 9177, 9484, 9791, 10099, 10406, 10713, 11021, 11328, 11635, 11943, 12250, 12557, 12865, 13172, 13479, 13787, 14094, 14401, 14709, 15016, 15324, 15631, 15938, 16246, 16553, 16860, 17168, 17475, 17782, 18090, 18397, 18704, 19012, 19319, 19626, 19934, 20241, 20548, 20856, 21163, 21471, 21778, 22085, 22393, 22700, 23007, 23315, 23622, 23929, 24237]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 第3击攻击力 : {value2}%
    # REMOVE: data2 = [0, 6494, 7153, 7812, 8471, 9130, 9789, 10447, 11106, 11765, 12424, 13083, 13742, 14401, 15059, 15718, 16377, 17036, 17695, 18354, 19013, 19671, 20330, 20989, 21648, 22307, 22966, 23624, 24283, 24942, 25601, 26260, 26919, 27578, 28236, 28895, 29554, 30213, 30872, 31531, 32189, 32848, 33507, 34166, 34825, 35484, 36143, 36801, 37460, 38119, 38778, 39437, 40096, 40755, 41413, 42072, 42731, 43390, 44049, 44708, 45366, 46025, 46684, 47343, 48002, 48661, 49320, 49978, 50637, 51296, 51955]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 第4击攻击力 : {value3}%
    # REMOVE: data3 = [0, 10550, 11620, 12690, 13760, 14831, 15901, 16971, 18041, 19112, 20182, 21252, 22322, 23393, 24463, 25533, 26603, 27673, 28744, 29814, 30884, 31954, 33025, 34095, 35165, 36235, 37306, 38376, 39446, 40516, 41587, 42657, 43727, 44797, 45868, 46938, 48008, 49078, 50149, 51219, 52289, 53359, 54430, 55500, 56570, 57640, 58711, 59781, 60851, 61921, 62992, 64062, 65132, 66202, 67273, 68343, 69413, 70483, 71554, 72624, 73694, 74764, 75835, 76905, 77975, 79045, 80115, 81186, 82256, 83326, 84396]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1
    # [范围信息]
    # [冥炎剑]最后一击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

    def skillInfo(self, mode: str | None = None):
        self.lv = self.char.GetSkillByName("冥炎之卡洛").lv
        return super().skillInfo(mode)

    def vp_1(self):
        """
        [冥炎剑]\n
        施放时召唤冥炎剑立即斩击敌人\n
         - 总攻击力相同\n
         - 按向前方向键时增加移动距离\n
        斩击攻击范围 +30%
        """
        ...

    def vp_2(self):
        """
        [冥炎剑]\n
        召唤卡洛持续一定时间， 为领域内的敌人附着上黑色火焰， 以一定时间间隔造成火/暗属性伤害\n
         - 总攻击力相同\n
         - 卡洛召唤状态下再次施放时， 回收原有的卡洛， 并在前方召唤\n
         - 可以通过鬼神解放使用
        """
        ...

# 恐惧光环
# swordman_male/soul_bender/7e904ea3d2a9faa054604e55120a9268
# 41f1cdc2ff58bb5fdc287be0db2a8df3/7e904ea3d2a9faa054604e55120a9268
class Skill42(PassiveSkill):
    """
    散发可以使周围敌人恐惧的黑暗光环， 可以增加自身技能攻击力， 每隔一定时间持续对敌人赋予减速状态。\n
    利用ON/OFF可以开启或关闭减速功能。
    """
    name = "恐惧光环"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 2
    rangeLv = 3
    uuid = "7e904ea3d2a9faa054604e55120a9268"
    hasVP = False
    hasUP = False

    # 光环范围 : {value0}px
    # REMOVE: data0 = [0, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275, 275]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 减速几率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 敌人攻击速度减少 : {value2}%
    # REMOVE: data2 = [0, 4, 5, 6, 8, 9, 10, 11, 12, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 32, 33, 34, 35, 36, 38, 39, 40, 41, 42, 44, 45, 46, 47, 48, 50, 51, 52, 53, 54, 56, 57, 58, 59, 60, 62, 63]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 敌人移动速度减少 : {value3}%
    # REMOVE: data3 = [0, 4, 5, 6, 8, 9, 10, 11, 12, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 26, 27, 28, 29, 30, 32, 33, 34, 35, 36, 38, 39, 40, 41, 42, 44, 45, 46, 47, 48, 50, 51, 52, 53, 54, 56, 57, 58, 59, 60, 62, 63]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 减速发生间隔 : {value4}秒
    # REMOVE: data4 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 减速持续时间 : {value5}秒
    # REMOVE: data5 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 技能攻击力增加率 : {value6}%
    # REMOVE: data6 = [0, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5, 33, 34.5, 36, 37.5, 39, 40.5, 42, 43.5, 45, 46.5, 48, 49.5, 51, 52.5, 54, 55.5, 57, 58.5, 60, 61.5, 63, 64.5, 66, 67.5, 69, 70.5, 72, 73.5, 75, 76.5, 78, 79.5, 81, 82.5, 84, 85.5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    associate = [{"data":data6}]

# 第7鬼神 : 怖拉修
# swordman_male/soul_bender/b8f4966608e4ebb3cc80ba4eac3649bb
# 41f1cdc2ff58bb5fdc287be0db2a8df3/b8f4966608e4ebb3cc80ba4eac3649bb
class Skill43(ActiveSkill):
    """
    召唤出怖拉修协助自身战斗。\n
    技能施放后， 会出现范围缓缓变大的怖拉修沼泽， 当沼泽面积达到最大时， 怖拉修会出现并攻击敌人。\n
    怖拉修出现时， 会引发冲击波并使敌人受到暗属性伤害； 当他合上大颚时， 还会使敌人受到第2次暗属性伤害。\n
    减少命中率的技能效果叠加时， 只适用数值最高的效果。\n
    召唤出的鬼神越多 (最多4只)， 怖拉修造成的伤害越大。\n
    可以提升怖拉修攻击力的鬼神 : 卡赞、 普戾蒙、 萨亚、 罗刹、 凯贾、 卡洛
    """
    name = "第7鬼神 : 怖拉修"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 8
    rangeLv = 5
    cube = 5
    cd = 140
    mp = [600, 5040]
    uuid = "b8f4966608e4ebb3cc80ba4eac3649bb"
    hasVP = False
    hasUP = False

    # 冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 9673, 11916, 14159, 16402, 18645, 20888, 23131, 25374, 27617, 29860, 32103, 34346, 36589, 38832, 41075, 43318, 45561, 47804, 50047, 52290, 54533, 56776, 59019, 61262, 63505, 65748, 67991, 70234, 72477, 74720, 76963, 79206, 81449, 83692, 85935, 88178, 90421, 92664, 94907, 97150, 99393, 101636, 103879, 106122, 108365, 110608, 112851, 115094, 117337, 119580]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    power0 = 1.8
    # 吞噬敌人时攻击力 : {value1}%
    # REMOVE: data1 = [0, 13079, 16112, 19145, 22177, 25210, 28243, 31276, 34309, 37341, 40374, 43407, 46440, 49473, 52505, 55538, 58571, 61604, 64637, 67669, 70702, 73735, 76768, 79801, 82833, 85866, 88899, 91932, 94965, 97997, 101030, 104063, 107096, 110129, 113161, 116194, 119227, 122260, 125293, 128325, 131358, 134391, 137424, 140457, 143489, 146522, 149555, 152588, 155621, 158653, 161686]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    power1 = 1.8
    # 减速、 命中率减少范围 : {value2}px
    # REMOVE: data2 = [0, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700, 700]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 减速几率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 移动速度减少率 : {value4}%
    # REMOVE: data4 = [0, 51, 54, 64, 67, 69, 72, 74, 77, 80, 82, 85, 87, 90, 92, 95, 98, 100, 103, 105, 108, 111, 113, 116, 118, 121, 124, 126, 129, 131, 134, 137, 139, 142, 144, 147, 149, 152, 155, 157, 160, 162, 165, 168, 170, 173, 175, 178, 181, 183, 186]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 减速持续时间 : {value5}秒
    # REMOVE: data5 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 减速发生间隔 : {value6}秒
    # REMOVE: data6 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 命中率减少率 : {value7}%
    # REMOVE: data7 = [0, 8.8, 11, 20, 21.5, 23.6, 25.7, 27.8, 29.9, 32, 34.1, 36.2, 38.3, 40.4, 42.5, 44.6, 46.7, 48.8, 50.9, 53.1, 55.2, 57.3, 59.4, 61.5, 63.6, 65.7, 67.8, 69.9, 72, 74.1, 76.2, 78.3, 80.4, 82.5, 84.6, 86.7, 88.8, 90.9, 93, 95.1, 97.2, 99.3, 101.4, 103.5, 105.6, 107.7, 109.8, 111.9, 114, 116.1, 118.2]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 怖拉修攻击力增加率 : {value8}%
    # REMOVE: data8 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 沼泽攻击力 : {value9}%
    # REMOVE: data9 = [0, 2605, 3209, 3813, 4417, 5021, 5625, 6229, 6833, 7438, 8042, 8646, 9250, 9854, 10458, 11062, 11666, 12270, 12874, 13478, 14082, 14686, 15290, 15894, 16498, 17103, 17707, 18311, 18915, 19519, 20123, 20727, 21331, 21935, 22539, 23143, 23747, 24351, 24955, 25559, 26163, 26767, 27372, 27976, 28580, 29184, 29788, 30392, 30996, 31600, 32204]# noqa: E501
    hit2 = 5
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 每只鬼神对怖拉修的攻击力增加量 : {value10}%
    # REMOVE: data10 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # 鬼神叠加数上限 : {value11} 
    # REMOVE: data11 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)

    skillDamage = 1.1

# 鬼斩 : 炼狱
# swordman_male/soul_bender/d89f26862e348a801b30bb9fd7125db5
# 41f1cdc2ff58bb5fdc287be0db2a8df3/d89f26862e348a801b30bb9fd7125db5
class Skill44(ActiveSkill):
    """
    劈开大地， 召唤冥界刀刃， 对敌人造成暗属性魔法伤害。 被刀刃击中的敌人进入控制状态， 效果持续一定时间。
    """
    name = "鬼斩 : 炼狱"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [400, 1120]
    uuid = "d89f26862e348a801b30bb9fd7125db5"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 2797, 3081, 3365, 3648, 3932, 4216, 4500, 4784, 5067, 5351, 5635, 5919, 6202, 6486, 6770, 7054, 7337, 7621, 7905, 8189, 8473, 8756, 9040, 9324, 9608, 9891, 10175, 10459, 10743, 11026, 11310, 11594, 11878, 12162, 12445, 12729, 13013, 13297, 13580, 13864, 14148, 14432, 14716, 14999, 15283, 15567, 15851, 16134, 16418, 16702]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 冥界刀刃攻击力 : {value1}%
    # REMOVE: data1 = [0, 10887, 11991, 13096, 14200, 15305, 16409, 17514, 18618, 19723, 20827, 21932, 23036, 24141, 25245, 26349, 27454, 28558, 29663, 30767, 31872, 32976, 34081, 35185, 36290, 37394, 38499, 39603, 40708, 41812, 42916, 44021, 45125, 46230, 47334, 48439, 49543, 50648, 51752, 52857, 53961, 55066, 56170, 57275, 58379, 59483, 60588, 61692, 62797, 63901, 65006]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 2
    # 爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 9334, 10281, 11228, 12175, 13122, 14069, 15016, 15963, 16910, 17856, 18803, 19750, 20697, 21644, 22591, 23538, 24485, 25432, 26379, 27326, 28273, 29220, 30167, 31113, 32060, 33007, 33954, 34901, 35848, 36795, 37742, 38689, 39636, 40583, 41530, 42477, 43424, 44371, 45317, 46264, 47211, 48158, 49105, 50052, 50999, 51946, 52893, 53840, 54787, 55734]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 控制时间 : {value3}秒
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 攻击次数上限 : {value4}次
    # REMOVE: data4 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [鬼斩 : 炼狱]\n
        通过冥界之力， 使更多的刀刃以前方最强敌人为中心涌出\n
         - 总攻击力相同\n
         - 寻敌范围 : 700px
        """
        ...

    def vp_2(self):
        """
        [鬼斩 : 炼狱]\n
        可以强制中断转职技能的施放后僵直， 并施放[鬼斩 : 炼狱]\n
         - 可以强制中断[鬼斩 : 炼狱]施放后僵直， 并施放转职技能
        """
        ...

# 冥祭之沼
# swordman_male/soul_bender/2ff50c35efcf0f287c4c418c8454da48
# 41f1cdc2ff58bb5fdc287be0db2a8df3/2ff50c35efcf0f287c4c418c8454da48
class Skill45(ActiveSkill):
    """
    在自身周围一定区域内升起墓碑， 强制开启通往冥界之门。\n
    在持续时间内， 冥界之门将周围的敌人吸附到中央。\n
    经过一段时间或再次按技能键， 墓碑周围会发生暗属性爆炸， 同时墓碑消失。\n
    施放技能时按前、 后方向键， 可以在前、 后方设置墓碑。
    """
    name = "冥祭之沼"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 4
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [822, 1726]
    uuid = "2ff50c35efcf0f287c4c418c8454da48"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 吸附敌人持续时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 35804, 39436, 43069, 46701, 50333, 53965, 57598, 61230, 64862, 68495, 72127, 75759, 79391, 83024, 86656, 90288, 93921, 97553, 101185, 104818, 108450, 112082, 115714, 119347, 122979, 126611, 130244, 133876, 137508, 141140, 144773, 148405, 152037, 155670, 159302, 162934, 166566, 170199, 173831, 177463, 181096, 184728, 188360, 191992, 195625, 199257, 202889, 206522, 210154, 213786]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 前方设置 : {value2}px
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 后方设置 : {value3}px
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 吸附敌人的范围 : {value4}px
    # REMOVE: data4 = [0, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418, 418]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 爆炸范围比率 : {value5}%
    # REMOVE: data5 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [冥祭之沼]\n
        封印的墓碑爆炸时对自身施加鬼神之力， 获得速度增加增益效果\n
         - 所有速度增加量 : 15%\n
         - 增益持续时间 : 30秒
        """
        ...

    def vp_2(self):
        """
        [冥祭之沼]\n
        可指定被封印的墓碑的召唤位置\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 20秒\n
         - 攻击力 -50%\n
        爆炸范围 +40%\n
        通过鬼神解放施放时， 无法指定位置
        """
        self.cd = 20
        self.skillRation *= 0.5
        ...

# 幽魂之布雷德
# swordman_male/soul_bender/c4a5b868f1e8e60cd1867a2cfab4a242
# 41f1cdc2ff58bb5fdc287be0db2a8df3/c4a5b868f1e8e60cd1867a2cfab4a242
class Skill46(ActiveSkill):
    """
    召唤出幽魂之布雷德的残影并攻击敌人。\n
    召唤阵中的幽魂攻击将附加暗属性， 并且可以对敌人造成较高的僵直。 幽魂消失时， 会发动强力的最后一击。\n
    若再按一次技能键， 会立即发动最后一击。
    """
    name = "幽魂之布雷德"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "c4a5b868f1e8e60cd1867a2cfab4a242"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 幽魂攻击力 : {value0}%
    # REMOVE: data0 = [0, 487, 536, 586, 635, 685, 734, 783, 833, 882, 931, 981, 1030, 1080, 1129, 1178, 1228, 1277, 1327, 1376, 1425, 1475, 1524, 1574, 1623, 1672, 1722, 1771, 1821, 1870, 1919, 1969, 2018, 2068, 2117, 2166, 2216, 2265, 2315, 2364, 2413, 2463, 2512, 2562, 2611, 2660, 2710, 2759, 2809, 2858, 2907]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 32
    # 范围斩击攻击力 : {value1}%
    # REMOVE: data1 = [0, 5444, 5997, 6549, 7101, 7654, 8206, 8758, 9311, 9863, 10415, 10968, 11520, 12072, 12625, 13177, 13729, 14282, 14834, 15386, 15939, 16491, 17043, 17596, 18148, 18700, 19253, 19805, 20357, 20909, 21462, 22014, 22566, 23119, 23671, 24223, 24776, 25328, 25880, 26433, 26985, 27537, 28090, 28642, 29194, 29747, 30299, 30851, 31404, 31956, 32508]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 4
    # 最后的斩击攻击力 : {value2}%
    # REMOVE: data2 = [0, 30627, 33735, 36842, 39949, 43056, 46163, 49270, 52377, 55485, 58592, 61699, 64806, 67913, 71020, 74127, 77234, 80342, 83449, 86556, 89663, 92770, 95877, 98984, 102092, 105199, 108306, 111413, 114520, 117627, 120734, 123842, 126949, 130056, 133163, 136270, 139377, 142484, 145591, 148699, 151806, 154913, 158020, 161127, 164234, 167341, 170449, 173556, 176663, 179770, 182877]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 持续时间 : {value3}秒
    # REMOVE: data3 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 僵直率 : {value4}%
    # REMOVE: data4 = [0, 200, 220, 240, 260, 280, 300, 320, 340, 360, 380, 400, 420, 440, 460, 480, 500, 520, 540, 560, 580, 600, 620, 640, 660, 680, 700, 720, 740, 760, 780, 800, 820, 840, 860, 880, 900, 920, 940, 960, 980, 1000, 1020, 1040, 1060, 1080, 1100, 1120, 1140, 1160, 1180]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 领域范围 : {value5}px
    # REMOVE: data5 = [0, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350, 350]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    mode = ["打满","终结"]

    def setMode(self, mode):
        if mode == "终结":
            self.hit0 = 4
        return super().setMode(mode)

    def vp_1(self):
        """
        [幽魂之布雷德]\n
        幽魂之布雷德跟随自身， 对周围敌人进行攻击\n
         - 再次按技能键时， 立即发动终结攻击\n
        领域持续时间 -2秒\n
         - 总攻击力相同\n
         - 幽魂多段攻击间隔 -75%
        """
        ...

    def vp_2(self):
        """
        [幽魂之布雷德]\n
        施放[幽魂之布雷德]时， 召唤包括卡赞和普戾蒙在内， 所有可召唤的鬼神\n
         - 卡赞 : 4.5秒内， 领域中鬼泣的所有速度 +10%\n
         - 普戾蒙 : 4.5秒内， 领域中鬼泣的回避率 +20%
        """
        ...

# 御鬼之极
# swordman_male/soul_bender/95103ae7c54eaedea3bbcf726520db6c
# 41f1cdc2ff58bb5fdc287be0db2a8df3/95103ae7c54eaedea3bbcf726520db6c
class Skill47(PassiveSkill):
    """
    掌握[御鬼之极]后， 增加[鬼斩]、 [月光斩]， 以及鬼泣的转职技能攻击力。\n
    [鬼影闪] - “只能在[残影之凯贾]使用前冲后进入无敌状态时施放”变更为可无条件施放， 并大幅减少施放后僵直。\n
    [侵蚀之普戾蒙] - 召唤功能消失， 变更为增加伤害、 减少异常状态抗性的被动技能。\n
    可使用ON/OFF功能自由开闭[死亡墓碑]、 [王者号令 : 吉格降临]的诅咒功能。
    """
    name = "御鬼之极"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    uuid = "95103ae7c54eaedea3bbcf726520db6c"
    hasVP = False
    hasUP = False

    # 技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    associate = [{"data":data0}]

# 幽魂降临 : 式
# swordman_male/soul_bender/96e72ec364dada85600c907ecd95a140
# 41f1cdc2ff58bb5fdc287be0db2a8df3/96e72ec364dada85600c907ecd95a140
class Skill48(ActiveSkill):
    """
    跳跃到空中， 使幽魂之布雷德降临到自己身上， 释放强大的剑气。 剑气劈裂地面后爆炸。\n
    施放技能时， 按前方向键可以向前方跳跃、 按下方向键向后跳跃。\n
    可以在空中施放。
    """
    name = "幽魂降临 : 式"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [800, 6000]
    uuid = "96e72ec364dada85600c907ecd95a140"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 26978, 29714, 32451, 35188, 37925, 40662, 43399, 46136, 48872, 51609, 54346, 57083, 59820, 62557, 65294, 68030, 70767, 73504, 76241, 78978, 81715, 84452, 87188, 89925, 92662, 95399, 98136, 100873, 103610, 106346, 109083, 111820, 114557, 117294, 120031, 122768, 125504, 128241, 130978, 133715, 136452, 139189, 141926, 144662, 147399, 150136, 152873, 155610, 158347, 161084]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 40466, 44572, 48677, 52782, 56888, 60993, 65098, 69203, 73309, 77414, 81519, 85625, 89730, 93835, 97940, 102046, 106151, 110256, 114362, 118467, 122572, 126677, 130783, 134888, 138993, 143099, 147204, 151309, 155414, 159520, 163625, 167730, 171836, 175941, 180046, 184151, 188257, 192362, 196467, 200573, 204678, 208783, 212888, 216994, 221099, 225204, 229310, 233415, 237520, 241625]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # [范围信息]
    # 爆炸范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [幽魂降临 : 式]\n
        可以在后跳过程中施放； 在地面施放时不再跳跃， 立即施放下劈斩击\n
        冥界之刃命中时强制控制敌人\n
        - 强制控制时间 : 1秒\n
        攻击范围 +15%
        """
        ...

    def vp_2(self):
        """
        [幽魂降临 : 式]\n
        向前方最强的敌人施以斩断灵魂的剑击\n
         - 总攻击力相同\n
        给1个命中的敌人留下鬼王的印记\n
         - 拥有鬼王印记的敌人， 在任何位置都会受到鬼神的伤害\n
         - 印记持续时间 : 8秒
        """
        ...

# 王者号令 : 吉格降临
# swordman_male/soul_bender/9bc30e0f6e22b0333762d04acae7d252
# 41f1cdc2ff58bb5fdc287be0db2a8df3/9bc30e0f6e22b0333762d04acae7d252
class Skill49(ActiveSkill):
    """
    召唤出最强鬼泣——神官吉格， 将敌人拖入冥界。\n
    与吉格一同被召唤的魑魅魍魉会攻击周围的敌人， 并将敌人拖到中心位置的同时触发诅咒状态。\n
    吉格从亡者之手中解放时， 强制使敌人僵直， 然后开启黄泉裂缝攻击周围的敌人后， 唤出亡者之手。 被亡者之手拖入地里的吉格会触发吞食效果， 使低于一定生命值的敌人立即死亡。n\n
    [最初、 最强的灵魂大师。 吉格的主人啊！]
    """
    name = "王者号令 : 吉格降临"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "9bc30e0f6e22b0333762d04acae7d252"
    hasVP = False
    hasUP = False

    # 魑魅魍魉的攻击力 : {value0}%
    # REMOVE: data0 = [0, 1229, 1514, 1799, 2084, 2369, 2654, 2939, 3224, 3509, 3794, 4079, 4364, 4649, 4934, 5219, 5504, 5789, 6074, 6359, 6644, 6929, 7214, 7499, 7784, 8069, 8354, 8639, 8924, 9209, 9494, 9779, 10064, 10349, 10634, 10919, 11203, 11488, 11773, 12058, 12343, 12628, 12913, 13198, 13483, 13768, 14053, 14338, 14623, 14908, 15193]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 15
    # 吉格解放时的攻击力 : {value1}%
    # REMOVE: data1 = [0, 24580, 30280, 35979, 41679, 47379, 53079, 58778, 64478, 70178, 75877, 81577, 87277, 92977, 98676, 104376, 110076, 115775, 121475, 127175, 132874, 138574, 144274, 149974, 155673, 161373, 167073, 172772, 178472, 184172, 189872, 195571, 201271, 206971, 212670, 218370, 224070, 229770, 235469, 241169, 246869, 252568, 258268, 263968, 269668, 275367, 281067, 286767, 292466, 298166, 303866]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 开启冥界裂缝时的攻击力 : {value2}%
    # REMOVE: data2 = [0, 30725, 37850, 44974, 52099, 59224, 66348, 73473, 80597, 87722, 94847, 101971, 109096, 116221, 123345, 130470, 137595, 144719, 151844, 158968, 166093, 173218, 180342, 187467, 194592, 201716, 208841, 215966, 223090, 230215, 237339, 244464, 251589, 258713, 265838, 272963, 280087, 287212, 294337, 301461, 308586, 315711, 322835, 329960, 337084, 344209, 351334, 358458, 365583, 372708, 379832]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 终结攻击力 : {value3}%
    # REMOVE: data3 = [0, 49160, 60559, 71959, 83358, 94758, 106157, 117557, 128956, 140355, 151755, 163154, 174554, 185953, 197352, 208752, 220151, 231551, 242950, 254350, 265749, 277148, 288548, 299947, 311347, 322746, 334146, 345545, 356944, 368344, 379743, 391143, 402542, 413941, 425341, 436740, 448140, 459539, 470939, 482338, 493737, 505137, 516536, 527936, 539335, 550734, 562134, 573533, 584933, 596332, 607732]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1
    # 诅咒几率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 诅咒时间 : {value5}秒
    # REMOVE: data5 = [0, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 23, 24, 24, 25, 25, 26, 26, 27, 27, 28]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 可使吉格触发吞食效果的怪物生命值
    # 普通 : {value6}%
    # REMOVE: data6 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    # 稀有 : {value7}%
    # REMOVE: data7 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 深渊 : {value8}%
    # REMOVE: data8 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # APC : {value9}%
    # REMOVE: data9 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 无法使领主立即死亡

# 鬼神冠冕
# swordman_male/soul_bender/696721534394b40e78ac96e880f19e5a
# 41f1cdc2ff58bb5fdc287be0db2a8df3/696721534394b40e78ac96e880f19e5a
class Skill50(PassiveSkill):
    """
    掌握鬼神“黄泉之门的主人卡隆”的力量， 成为真正的鬼神之王。 利用鬼神之王的力量增加转职技能攻击力， 部分技能附加特殊效果。\n
    [噬灵鬼斩]\n
    蓄气功能消失， 攻击时在原地发动斩击。 利用冥界之力， 生成幽魂之布雷德的气息。\n
    [满月斩]\n
    制造月亮并用斩击将鬼气注入到月亮之中， 然后破坏黑月攻击敌人。 删除追加按键功能。
    """
    name = "鬼神冠冕"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 3
    uuid = "696721534394b40e78ac96e880f19e5a"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    associate = [{"data":data0}]

# 鬼神剑·黄泉摆渡
# swordman_male/soul_bender/0dbdeaf846356f8b9380f8fbb8e97377
# 41f1cdc2ff58bb5fdc287be0db2a8df3/0dbdeaf846356f8b9380f8fbb8e97377
class Skill51(ActiveSkill):
    """
    使用黄泉之门的主人的卡隆之剑， 向前方挥动。 猛烈挥动产生的剑使现实的空间产生裂缝， 出现黄泉裂缝， 在亡灵从黄泉裂缝涌出之前， 使用卡隆之剑毁灭黄泉裂缝。
    """
    name = "鬼神剑·黄泉摆渡"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1064, 7980]
    uuid = "0dbdeaf846356f8b9380f8fbb8e97377"
    hasVP = False
    hasUP = False

    # 内部空间斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 27914, 30746, 33578, 36410, 39241, 42073, 44905, 47737, 50569, 53401, 56233, 59064, 61896, 64728, 67560, 70392, 73224, 76056, 78887, 81719, 84551, 87383, 90215, 93047, 95879, 98710, 101542, 104374, 107206, 110038, 112870, 115702, 118533, 121365, 124197, 127029, 129861, 132693, 135524, 138356, 141188, 144020, 146852, 149684, 152516, 155347, 158179, 161011, 163843, 166675]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 外部空间斩击攻击力 : {value1}%
    # REMOVE: data1 = [0, 27914, 30746, 33578, 36410, 39241, 42073, 44905, 47737, 50569, 53401, 56233, 59064, 61896, 64728, 67560, 70392, 73224, 76056, 78887, 81719, 84551, 87383, 90215, 93047, 95879, 98710, 101542, 104374, 107206, 110038, 112870, 115702, 118533, 121365, 124197, 127029, 129861, 132693, 135524, 138356, 141188, 144020, 146852, 149684, 152516, 155347, 158179, 161011, 163843, 166675]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 卡隆之剑投掷攻击力 : {value2}%
    # REMOVE: data2 = [0, 13957, 15373, 16789, 18205, 19621, 21037, 22453, 23868, 25284, 26700, 28116, 29532, 30948, 32364, 33780, 35196, 36612, 38028, 39444, 40860, 42276, 43691, 45107, 46523, 47939, 49355, 50771, 52187, 53603, 55019, 56435, 57851, 59267, 60683, 62099, 63514, 64930, 66346, 67762, 69178, 70594, 72010, 73426, 74842, 76258, 77674, 79090, 80506, 81922, 83337]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 亡灵吸收多段攻击力 : {value3}% x {value4}
    # REMOVE: data3 = [0, 4187, 4612, 5037, 5461, 5886, 6311, 6736, 7161, 7585, 8010, 8435, 8860, 9284, 9709, 10134, 10559, 10984, 11408, 11833, 12258, 12683, 13107, 13532, 13957, 14382, 14807, 15231, 15656, 16081, 16506, 16930, 17355, 17780, 18205, 18630, 19054, 19479, 19904, 20329, 20753, 21178, 21603, 22028, 22453, 22877, 23302, 23727, 24152, 24576, 25001]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 5
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 黄泉裂缝毁灭攻击力 : {value5}%
    # REMOVE: data5 = [0, 48850, 53805, 58761, 63717, 68672, 73628, 78584, 83540, 88495, 93451, 98407, 103363, 108318, 113274, 118230, 123186, 128141, 133097, 138053, 143009, 147964, 152920, 157876, 162832, 167787, 172743, 177699, 182655, 187610, 192566, 197522, 202478, 207433, 212389, 217345, 222301, 227256, 232212, 237168, 242124, 247079, 252035, 256991, 261947, 266902, 271858, 276814, 281770, 286725, 291681]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 1

# 黄泉之门 : 万鬼度灵
# swordman_male/soul_bender/56fca6cff74d828e92301a40cd2148b9
# 41f1cdc2ff58bb5fdc287be0db2a8df3/56fca6cff74d828e92301a40cd2148b9
class Skill52(ActiveSkill):
    """
    身为九大鬼神之王， 穿戴蕴含鬼神之力的铠甲， 使用卡隆之剑召唤黄泉之门。 用卡隆之剑斩断黄泉之门的结界， 将冥界亡灵释放到现界， 攻击所有敌人。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    关联的技能在冷却中时， 无法使用三次觉醒技能。
    """
    name = "黄泉之门 : 万鬼度灵"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "56fca6cff74d828e92301a40cd2148b9"
    hasVP = False
    hasUP = False

    # 黄泉之门召唤攻击力 : {value0}%
    # REMOVE: data0 = [0, 23461, 28902, 34342, 39782, 45223, 50663, 56103, 61544, 66984, 72424, 77864, 83305, 88745, 94185, 99626, 105066, 110506, 115947, 121387, 126827, 132268, 137708, 143148, 148589, 154029, 159469, 164909, 170350, 175790, 181230, 186671, 192111, 197551, 202992, 208432, 213872, 219313, 224753, 230193, 235634, 241074, 246514, 251954, 257395, 262835, 268275, 273716, 279156, 284596, 290037]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 黄泉之门上升多段攻击力 : {value1}% x {value2}
    # REMOVE: data1 = [0, 8798, 10838, 12878, 14918, 16958, 18999, 21039, 23079, 25119, 27159, 29199, 31239, 33279, 35320, 37360, 39400, 41440, 43480, 45520, 47560, 49600, 51640, 53681, 55721, 57761, 59801, 61841, 63881, 65921, 67961, 70002, 72042, 74082, 76122, 78162, 80202, 82242, 84282, 86322, 88363, 90403, 92443, 94483, 96523, 98563, 100603, 102643, 104684, 106724, 108764]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 8
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 黄泉之门封印解除攻击力 : {value3}%
    # REMOVE: data3 = [0, 140768, 173410, 206052, 238694, 271336, 303977, 336619, 369261, 401903, 434545, 467187, 499829, 532471, 565113, 597754, 630396, 663038, 695680, 728322, 760964, 793606, 826248, 858889, 891531, 924173, 956815, 989457, 1022099, 1054741, 1087383, 1120024, 1152666, 1185308, 1217950, 1250592, 1283234, 1315876, 1348518, 1381159, 1413801, 1446443, 1479085, 1511727, 1544369, 1577011, 1609653, 1642295, 1674936, 1707578, 1740220]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1
    # 亡灵斩击攻击力 : {value4}%
    # REMOVE: data4 = [0, 140768, 173410, 206052, 238694, 271336, 303977, 336619, 369261, 401903, 434545, 467187, 499829, 532471, 565113, 597754, 630396, 663038, 695680, 728322, 760964, 793606, 826248, 858889, 891531, 924173, 956815, 989457, 1022099, 1054741, 1087383, 1120024, 1152666, 1185308, 1217950, 1250592, 1283234, 1315876, 1348518, 1381159, 1413801, 1446443, 1479085, 1511727, 1544369, 1577011, 1609653, 1642295, 1674936, 1707578, 1740220]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 1
    # 亡灵吸收多段攻击力 : {value5}% x {value6}
    # REMOVE: data5 = [0, 6256, 7707, 9158, 10609, 12059, 13510, 14961, 16412, 17862, 19313, 20764, 22215, 23665, 25116, 26567, 28018, 29468, 30919, 32370, 33821, 35271, 36722, 38173, 39624, 41074, 42525, 43976, 45427, 46877, 48328, 49779, 51230, 52680, 54131, 55582, 57033, 58483, 59934, 61385, 62836, 64286, 65737, 67188, 68639, 70089, 71540, 72991, 74442, 75892, 77343]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 15
    # REMOVE: data6 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'soul_bender'
        self.nameCN = '极诣·鬼泣'
        self.role = 'swordman_male'
        self.角色 = '鬼剑士(男)'
        self.职业 = '鬼泣'
        self.jobId = '41f1cdc2ff58bb5fdc287be0db2a8df3'
        self.jobGrowId = '618326026de1a1f1cfba5dbd0b8396e7'

        self.武器选项 = ['太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['魔法百分比']
        self.输出类型 = '魔法百分比'
        self.防具精通属性 = ['智力']
        self.防具类型 = '布甲'
        self.buff = 1.76

        super().__init__(equVersion, __name__)
