#41f1cdc2ff58bb5fdc287be0db2a8df3
from core.basic.skill import PassiveSkill, ActiveSkill, characterLv
from core.basic.character import Character


class ActiveSkill(ActiveSkill):
    totalhit = 0
    """总hit"""
    thrustcount = 0
    """刺伤层数"""
    swordnum = 0
    """穿云刺落剑数"""

    def skillInfo(self, mode = None):
        return super().skillInfo(mode) + (self.swordnum,self.totalhit,self.thrustcount,)

# 疾影手 신속한 무기 교체
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/dcd536f1674630f01fc9667bb202b851?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill0(PassiveSkill):
    name = "疾影手"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 9 #TODO
    rangeLv = 1
    uuid = "dcd536f1674630f01fc9667bb202b851"

    data0 = [0, 50]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 7.5]# noqa: E501
    hit1 = 1 #TODO

    data2 = [0, 10]# noqa: E501
    hit2 = 1 #TODO


# 基础精通 기본기 숙련
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/5a56514f35cf0270ae8d6c65f8fefd78?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill1(ActiveSkill):
    name = '基础精通'
    icon = '$common/$name'
    learnLv = 1
    masterLv = characterLv
    maxLv = 200
    position = 1
    rangeLv = 1
    damage = False
    type = 'passive'
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501

    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["里 · 鬼剑术","空中连斩"]}]

# 空中连斩 공중 연속 베기
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/78bd107acd474518b606be1e4fd38239?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill2(ActiveSkill):
    name = "空中连斩"
    learnLv = 5
    masterLv = 1
    maxLv = 11
    position = 10 #todo
    rangeLv = 1
    mp = [5, 7]
    uuid = "78bd107acd474518b606be1e4fd38239"

    # 两刀，实际第二刀才出伤害 为了统计hit
    data0 = [0, 195, 209, 221, 234, 247, 260, 275, 286, 299, 312, 326]# noqa: E501
    hit0 = 2
    power0 = 0.5

    # 太刀
    data1 = [i - 100 if i > 100 else i for i in data0]
    hit1 = 2
    power1 = 1

    def skillInfo(self, mode = None):
        if self.char.GetWeaponType() == '太刀':
            self.hit0 = 0
        else:
            self.hit1 = 0
        return super().skillInfo(mode)

# 光剑精通 광검 마스터리
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/717f1e2104fe4b796f800352fa143ecc?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill3(PassiveSkill):
    name = "光剑精通"
    learnLv = 15
    masterLv = 1
    maxLv = 40
    position = 2
    rangeLv = 3
    uuid = "717f1e2104fe4b796f800352fa143ecc"

    data0 = [0, 9.5, 11, 12.5, 14, 15.5, 17, 18.5, 20, 21.5, 23, 24.5, 26, 27.5, 29, 30.5, 32, 33.5, 35, 36.5, 38, 39.5, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77]# noqa: E501

    data16 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501

    def effect(self, old, new):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "光剑":
            return
        data = self.data0
        if weapon[1] == "传世武器":
            data = self.data16
        self.associate = [{"type":"$*PAtkP","data":data}]
        return super().effect(old, new)

# 三段斩 단공참
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/f2fb27162beb0b87a7cb9af7900e95f2?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill4(ActiveSkill):
    name = "三段斩"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 6
    mp = [12, 120]
    damage = False
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"

    data0 = [0, 889, 980, 1070, 1160, 1250, 1341, 1431, 1521, 1611, 1702, 1792, 1882, 1972, 2062, 2153, 2243, 2333, 2423, 2514, 2604, 2694, 2784, 2875, 2965, 3055, 3145, 3235, 3326, 3416, 3506, 3596, 3687, 3777, 3867, 3957, 4048, 4138, 4228, 4318, 4408, 4499, 4589, 4679, 4769, 4860, 4950, 5040, 5130, 5221, 5311, 5401, 5491, 5581, 5672, 5762, 5852, 5942, 6033, 6123, 6213, 6303, 6394, 6484, 6574, 6664, 6754, 6845, 6935, 7025, 7115]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 1669, 1838, 2007, 2176, 2346, 2515, 2684, 2853, 3023, 3192, 3361, 3530, 3700, 3869, 4038, 4208, 4377, 4546, 4715, 4885, 5054, 5223, 5392, 5562, 5731, 5900, 6070, 6239, 6408, 6577, 6747, 6916, 7085, 7254, 7424, 7593, 7762, 7931, 8101, 8270, 8439, 8609, 8778, 8947, 9116, 9286, 9455, 9624, 9793, 9963, 10132, 10301, 10471, 10640, 10809, 10978, 11148, 11317, 11486, 11655, 11825, 11994, 12163, 12333, 12502, 12671, 12840, 13010, 13179, 13348]# noqa: E501
    hit1 = 1 #TODO

    data2 = [0, 889, 980, 1070, 1160, 1250, 1341, 1431, 1521, 1611, 1702, 1792, 1882, 1972, 2062, 2153, 2243, 2333, 2423, 2514, 2604, 2694, 2784, 2875, 2965, 3055, 3145, 3235, 3326, 3416, 3506, 3596, 3687, 3777, 3867, 3957, 4048, 4138, 4228, 4318, 4408, 4499, 4589, 4679, 4769, 4860, 4950, 5040, 5130, 5221, 5311, 5401, 5491, 5581, 5672, 5762, 5852, 5942, 6033, 6123, 6213, 6303, 6394, 6484, 6574, 6664, 6754, 6845, 6935, 7025, 7115]# noqa: E501
    hit2 = 1 #TODO

    data3 = [0, 1669, 1838, 2007, 2176, 2346, 2515, 2684, 2853, 3023, 3192, 3361, 3530, 3700, 3869, 4038, 4208, 4377, 4546, 4715, 4885, 5054, 5223, 5392, 5562, 5731, 5900, 6070, 6239, 6408, 6577, 6747, 6916, 7085, 7254, 7424, 7593, 7762, 7931, 8101, 8270, 8439, 8609, 8778, 8947, 9116, 9286, 9455, 9624, 9793, 9963, 10132, 10301, 10471, 10640, 10809, 10978, 11148, 11317, 11486, 11655, 11825, 11994, 12163, 12333, 12502, 12671, 12840, 13010, 13179, 13348]# noqa: E501
    hit3 = 1 #TODO

    data4 = [0, 1753, 1931, 2108, 2286, 2464, 2642, 2820, 2998, 3175, 3353, 3531, 3709, 3887, 4065, 4242, 4420, 4598, 4776, 4954, 5131, 5309, 5487, 5665, 5843, 6021, 6198, 6376, 6554, 6732, 6910, 7088, 7265, 7443, 7621, 7799, 7977, 8154, 8332, 8510, 8688, 8866, 9044, 9221, 9399, 9577, 9755, 9933, 10111, 10288, 10466, 10644, 10822, 11000, 11177, 11355, 11533, 11711, 11889, 12067, 12244, 12422, 12600, 12778, 12956, 13134, 13311, 13489, 13667, 13845, 14023]# noqa: E501
    hit4 = 1 #TODO


# 短剑精通 소검 마스터리
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/01c3a2fb793d293a25ed8dc7a0d70c1a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill5(PassiveSkill):
    name = "短剑精通"
    learnLv = 15
    masterLv = 1
    maxLv = 40
    line = 10
    position = 0 #TODO
    rangeLv = 3
    uuid = "01c3a2fb793d293a25ed8dc7a0d70c1a"
    hasUP = False

    data0 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501

    # [里 · 鬼剑术]剑气攻击力
    data3 = [0, 165, 192, 218, 244, 271, 297, 323, 350, 376, 402, 429, 455, 482, 508, 534, 561, 587, 613, 640, 666, 692, 719, 745, 771, 798, 824, 850, 877, 903, 930, 956, 982, 1009, 1035, 1061, 1088, 1114, 1140, 1167, 1193]# noqa: E501

    # 破军升龙击
    data11 = [0, 0, 0, 0, 0, 0, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45, 45]# noqa: E501

    # 猛龙断空斩
    data12 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501


    data13 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501


    def effect(self, old, new):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "短剑":
            return
        data = self.data0
        if weapon[1] == "传世武器":
            data = self.data13
        self.associate = [
            {"type":"$*PAtkP","data":data},
            {"type":"+dataplus0","data":self.data3,"skills":["里 · 鬼剑术"],"ratio":1},
            {"type":"*skillRation","data":self.data11,"skills":["破军升龙击"]},
            {"type":"*skillRation","data":self.data12,"skills":["猛龙断空斩"]},
        ]
        return super().effect(old, new)


# 太刀精通 도 마스터리
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/8f73f243041c2d27739fe7696f02bf9b?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill6(ActiveSkill):
    name = "太刀精通"
    learnLv = 15
    masterLv = 1
    maxLv = 40
    line = 10
    position = 1 #TODO
    rangeLv = 3
    type = "passive"
    uuid = "8f73f243041c2d27739fe7696f02bf9b"
    hasUP = False

    # 物理攻击力增加
    data0 = [0, 9.2, 10.7, 12.2, 13.7, 15.2, 16.7, 18.2, 19.7, 21.2, 22.7, 24.2, 25.7, 27.2, 28.7, 30.2, 31.7, 33.2, 34.7, 36.2, 37.7, 39.2, 40.7, 42.7, 44.7, 46.7, 48.7, 50.7, 52.7, 54.7, 56.7, 58.7, 60.7, 62.7, 64.7, 66.7, 68.7, 70.7, 72.7, 74.7, 76.7]# noqa: E501
    hit0 = 0

    # 刺伤几率
    data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 38, 38, 39, 39, 40, 40, 41, 41, 42, 42, 43, 43, 44, 44, 45, 45, 46, 46, 47, 47, 48, 48, 49, 49, 50, 50, 51, 51, 52, 52]

    # 刺伤爆炸伤害(下限)
    data5 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2638, 2803, 2968, 3134, 3295, 3460, 3621, 3789, 3953, 4117, 4279, 4448, 4609, 4778, 4936, 5104, 5264, 5430, 5597, 5759, 5925, 6087, 6250, 6419, 6580, 6749, 6909, 7078, 7243, 7407, 7574]# noqa: E501

    # 刺伤爆炸伤害(上限)
    data6 = [0, 7363, 8537, 9711, 10884, 12058, 13232, 14406, 15580, 16753, 17927, 19101, 20275, 21449, 22623, 23796, 24970, 26144, 27318, 28492, 29665, 30839, 32013, 33187, 34361, 35534, 36708, 37882, 39056, 40230, 41404, 42577, 43751, 44925, 46099, 47273, 48446, 49620, 50794, 51968, 53142]# noqa: E501

    # [空中连斩]附加攻击力
    data8 = [0, 63, 68, 72, 76, 79, 84, 87, 93, 96, 99, 104, 107, 111, 115, 120, 123, 127, 131, 134, 138, 143, 147, 150, 155, 159, 161, 166, 171, 174, 177, 183, 186, 190, 196, 198, 202, 204, 209, 214, 219]# noqa: E501

    # [空中连斩]对刺伤状态增加攻击力
    data9 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501

    # 传世武器物攻增加
    data10 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501

    def effect(self, old, new):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "太刀":
            return
        data = self.data0
        if weapon[1] == "传世武器":
            data = self.data10
        self.associate = [
            {"type":"$*PAtkP","data":data},
            {"type":"*power1","data":[i-100 if i>100 else 0 for i in self.data9],"skills":["空中连斩"]},
        ]
        return super().effect(old, new)

    def getSkillData(self, lv = 0):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "太刀":
            return 0
        # 刺伤期望伤害 (17层引爆上限) / 17 (17层结算1次爆炸) * 刺伤触发几率
        return self.data6[lv] * 1 / 17 * self.data4[lv] / 100

    def getSkillCD(self,mode=None):
        return 1.0
# 巨剑精通 대검 마스터리
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/8c2379737c5acc935c1731f67f607655?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill7(PassiveSkill):
    name = "巨剑精通"
    learnLv = 15
    masterLv = 1
    maxLv = 40
    line = 10
    position = 0 #TODO
    rangeLv = 3
    uuid = "8c2379737c5acc935c1731f67f607655"

    data0 = [0, 14.4, 15.9, 17.4, 18.9, 20.4, 21.9, 23.4, 24.9, 26.4, 27.9, 29.4, 30.9, 32.4, 33.9, 35.4, 36.9, 38.4, 39.9, 41.4, 42.9, 44.4, 45.9, 47.9, 49.9, 51.9, 53.9, 55.9, 57.9, 59.9, 61.9, 63.9, 65.9, 67.9, 69.9, 71.9, 73.9, 75.9, 77.9, 79.9, 81.9]# noqa: E501

    # [里 · 鬼剑术]额外附加
    data3 = [0, 324, 375, 427, 479, 530, 582, 633, 685, 737, 788, 840, 891, 943, 995, 1046, 1098, 1149, 1201, 1253, 1304, 1356, 1407, 1459, 1511, 1562, 1614, 1665, 1717, 1769, 1820, 1872, 1923, 1975, 2027, 2078, 2130, 2181, 2233, 2285, 2336]# noqa: E501

    data8 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]

    data9 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501

    def effect(self, old, new):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "巨剑":
            return
        data = self.data0
        if weapon[1] == "传世武器":
            data = self.data9
        self.associate = [
            {"type":"$*PAtkP","data":data},
            {"type":"+dataplus0","data":self.data3,"skills":["里 · 鬼剑术"],"ratio":1},
            {"type":"+power1","data":[i - 100 if i > 100 else i for i in self.data8],"skills":["拔刀斩"]},
        ]
        return super().effect(old, new)

# 钝器精通 둔기 마스터리
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/9cb6f9ed646fa87f9b7680a42ce83d1a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill8(PassiveSkill):
    name = "钝器精通"
    learnLv = 15
    masterLv = 1
    maxLv = 40
    line = 10
    position = 1 #TODO
    rangeLv = 3
    uuid = "9cb6f9ed646fa87f9b7680a42ce83d1a"

    data0 = [0, 11.3, 12.8, 14.3, 15.8, 17.3, 18.8, 20.3, 21.8, 23.3, 24.8, 26.3, 27.8, 29.3, 30.8, 32.3, 33.8, 35.3, 36.8, 38.3, 39.8, 41.3, 42.8, 44.8, 46.8, 48.8, 50.8, 52.8, 54.8, 56.8, 58.8, 60.8, 62.8, 64.8, 66.8, 68.8, 70.8, 72.8, 74.8, 76.8, 78.8]# noqa: E501
    hit0 = 1 #TODO

    data9 = [0, 16.8, 18.3, 19.8, 21.3, 22.8, 24.3, 25.8, 27.3, 28.8, 30.3, 31.8, 33.3, 34.8, 36.3, 37.8, 39.3, 40.8, 42.3, 43.8, 45.3, 46.8, 48.3, 50.3, 52.3, 54.3, 56.3, 58.3, 60.3, 62.3, 64.3, 66.3, 68.3, 70.3, 72.3, 74.3, 76.3, 78.3, 80.3, 82.3, 84.3]# noqa: E501

    def effect(self, old, new):
        weapon = self.char.GetWeaponType()
        if weapon[0] != "钝器":
            return
        data = self.data0
        if weapon[1] == "传世武器":
            data = self.data9
        self.associate = [{"type":"$*PAtkP","data":data},]
        return super().effect(old, new)

# 武器奥义 무기의 극의
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/8ee0099656df08a0b39225f8a21d514b?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill9(PassiveSkill):
    name = "武器奥义"
    learnLv = 15
    masterLv = 20
    maxLv = 30
    position = 1
    rangeLv = 3
    uuid = "8ee0099656df08a0b39225f8a21d514b"

    associate = [{"type":"+lv","data":[i + 1 if i > 0 else i for i in range(0, maxLv + 2)],"ratio":1,"skills":["光剑精通","钝器精通","太刀精通","巨剑精通","短剑精通"]}] #TODO

# 光剑掌握 광검 사용 가능
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/bb34e8854a93fd250347a1c64119f7ab?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill10(PassiveSkill):
    name = "光剑掌握"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 9 #TODO
    rangeLv = 3
    uuid = "bb34e8854a93fd250347a1c64119f7ab"

    data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501

    data1 = [0, 1.5, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30]# noqa: E501

    associate = [
        {"type":"*cdReduce","data":data0,"exceptSkills":['极 · 鬼剑术 (暴风式)', '万剑归宗', '万剑极诣·开天斩'],"weapon":["光剑"]},
    ]

# 里 · 鬼剑术 리 귀검술
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/51a08fd0c90f0a5276cd552047fac93d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill11(ActiveSkill):
    name = "里 · 鬼剑术"
    learnLv = 15
    masterLv = 1
    maxLv = 11
    position = 4 #TODO
    rangeLv = 15
    mp = [6, 140]
    uuid = "51a08fd0c90f0a5276cd552047fac93d"
    thrusthit = 8

    @property
    def swordnum(self):
        list = {'短剑': 3, '光剑': 3, '巨剑': 2, '钝器': 4, '太刀': 4}
        return list.get(self.char.GetWeaponType(), 3)

    data0 = [0] + [0] * 11
    ratio = [0, 0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 30]# noqa: E501
    dataplus0 = 0

    basic = {
        '短剑': (1 + 1 + 1) * 100,
        '光剑': (1.433 + 1.707 + 2.235)* 100,
        # 巨剑第二下蓄力5.2
        '巨剑': (3.027 + 2.301 * 5.2) * 100,
        '太刀': (1.415 + 1.688 + 1.942 + 2.225) * 2,
        # 钝器第三下眩晕率极高,眩晕了就是3倍里鬼
        '钝器': (2.301 + 2.923 + 1.801 * 3 + 4.366) * 100,
    }

    def getSkillData(self, lv = 0):
        if lv == 0:
            return 0
        weapon = self.char.GetWeaponType()
        basic = self.basic.get(weapon, 3)
        ratio = self.ratio[self.lv] / 100 + 1
        data = basic * ratio + self.dataplus0
        return data

# 流心 류심
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/c5a2956d8ed3af1746ed2f76ca971a09?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill12(ActiveSkill):
    name = "流心"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 2
    cd = 1
    mp = [20, 20]
    uuid = "c5a2956d8ed3af1746ed2f76ca971a09"

    damage = False

# 流心 : 刺 류심 충
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/2a0a39184de92acf1c1375e00b77404c?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill13(ActiveSkill):
    name = "流心 : 刺"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    line = 25
    position = 4 #TODO
    rangeLv = 2
    cd = 8
    mp = [30, 280]
    uuid = "2a0a39184de92acf1c1375e00b77404c"
    thrusthit = 4

    data0 = [0, 4325, 4762, 5204, 5642, 6081, 6523, 6956, 7395, 7837, 8282, 8719, 9158, 9600, 10039, 10477, 10914, 11349, 11791, 12230, 12667, 13109, 13544, 13986, 14425, 14867, 15307, 15747, 16181, 16616, 17054, 17498, 17938, 18377, 18817, 19254, 19686, 20125, 20567, 21005, 21447, 21891, 22328, 22763, 23203, 23639, 24079, 24519, 24958, 25396, 25835, 26274, 26714, 27152, 27591, 28028, 28465, 28905, 29345, 29784, 30224, 30665, 31103, 31538, 31979, 32419, 32858, 33296, 33733, 34170, 34610]# noqa: E501
    hit0 = 2

    # 地面与空中伤害已一致
    def setMode(self,mode):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑" or weapon[0] == "太刀":
            self.hit0 = 4
            self.power0 *= 0.63
        elif weapon[0] == "巨剑" or weapon[0] == "短剑":
            self.hit0 = 3
        elif weapon[0] == "钝器":
            self.power0 *= 1.25

    def getWeaponCDRatio(self):
        return 1.0

    # 额外刺伤概率
    data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87]# noqa: E501
    # 额外刺伤层数
    data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501


# 无我剑气 검기상인
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/c47b66efd27845ef14954928ea2f95c8?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill14(PassiveSkill):
    name = "无我剑气"
    learnLv = 20
    masterLv = 5
    maxLv = 15
    position = 9 #TODO
    rangeLv = 3
    uuid = "c47b66efd27845ef14954928ea2f95c8"

    data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    associate = [{"type":"*skillRation","data":data0}]

# 破极兵刃 오버드라이브
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/762c4e6d030eaf0abbfe1fec2b298574?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill15(ActiveSkill):
    name = "破极兵刃"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 3
    cd = 5
    mp = [271, 2570]
    uuid = "762c4e6d030eaf0abbfe1fec2b298574"

    damage = False

# 流心 : 跃 류심 쾌
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/9dc8438e4572d39243c97da31c113acc?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill16(ActiveSkill):
    name = "流心 : 跃"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 8
    mp = [30, 350]
    uuid = "9dc8438e4572d39243c97da31c113acc"

    data0 = [0, 12011, 13230, 14448, 15667, 16885, 18104, 19322, 20541, 21759, 22978, 24196, 25415, 26633, 27852, 29070, 30289, 31507, 32726, 33944, 35163, 36381, 37600, 38818, 40037, 41255, 42474, 43692, 44911, 46129, 47348, 48566, 49785, 51003, 52222, 53440, 54659, 55877, 57096, 58314, 59533, 60751, 61970, 63188, 64407, 65625, 66844, 68062, 69281, 70499, 71718, 72936, 74155, 75373, 76592, 77810, 79029, 80247, 81466, 82684, 83903, 85121, 86340, 87558, 88777, 89995, 91214, 92432, 93651, 94869, 96088]# noqa: E501
    hit0 = 1 #TODO

    mode = ["地面","空中"]

    def setMode(self,mode):
        weapon = self.char.GetWeaponType()
        if weapon[0] == '钝器' and mode == "空中":
            self.skillRation *= 1.2
        else:
            pass

    def getWeaponCDRatio(self):
        return 1.0


    data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 100, 100, 100, 100]# noqa: E501

    data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501


# 逆转反击 이면 뒤집기
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/c9664191611af31142e052dfaef84530?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill17(ActiveSkill):
    name = "逆转反击"
    learnLv = 30
    masterLv = 20
    maxLv = 30
    position = 2 #TODO
    rangeLv = 3
    cd = [0,15, 14.7, 14.4, 14.2, 13.9, 13.6, 13.3, 13.1, 12.8, 12.5, 12.2, 12, 11.7, 11.4, 11.1, 10.9, 10.6, 10.3, 10, 9.8, 9.5, 9.2, 8.9, 8.7, 8.4, 8.1, 7.8, 7.6, 7.3, 7]
    uuid = "c9664191611af31142e052dfaef84530"

    damage = False


# 破军升龙击 차지 크래시
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/28b583c75a49103a1d8aabf799c000a4?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill18(ActiveSkill):
    name = "破军升龙击"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 10
    mp = [70, 700]
    uuid = "28b583c75a49103a1d8aabf799c000a4"

    # 肩撞
    data0 = [0, 3155, 3477, 3794, 4116, 4432, 4757, 5078, 5392, 5715, 6033, 6356, 6674, 6992, 7315, 7635, 7954, 8276, 8594, 8918, 9238, 9557, 9879, 10195, 10518, 10836, 11157, 11478, 11800, 12119, 12437, 12757, 13080, 13405, 13716, 14040, 14362, 14680, 15004, 15322, 15643, 15961, 16284, 16607, 16924, 17247, 17566, 17884, 18204, 18522, 18845, 19166, 19480, 19807, 20125, 20441, 20759, 21082, 21401, 21726, 22049, 22367, 22688, 23003, 23324, 23650, 23962, 24285, 24604, 24925, 25245]# noqa: E501
    hit0 = 2

    # 上斩
    data1 = [0, 4872, 5362, 5855, 6350, 6844, 7339, 7830, 8325, 8820, 9313, 9812, 10304, 10793, 11293, 11784, 12279, 12774, 13269, 13758, 14253, 14749, 15244, 15737, 16225, 16728, 17219, 17714, 18210, 18703, 19190, 19689, 20184, 20677, 21172, 21661, 22156, 22654, 23149, 23644, 24138, 24633, 25123, 25614, 26110, 26605, 27098, 27589, 28086, 28577, 29079, 29573, 30061, 30554, 31051, 31547, 32042, 32530, 33024, 33521, 34015, 34510, 35003, 35494, 35989, 36485, 36980, 37475, 37968, 38463, 38956]# noqa: E501
    hit1 = 1 #TODO

    # 巨剑 钝器追加部分
    data2 = data1
    hit2 = 0

    # 75被动追加部分
    data3 = data1
    hit3 = 1
    power3 = 0

    def setMode(self,mode):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑":
            self.hit0 += 2
            # 光剑肩撞伤害减少
            self.power0 -= 0.114
        elif weapon[0] == "太刀":
            self.hit1 += 1
        elif weapon[0] == "钝器" or weapon[0] == "巨剑":
            self.hit2 = 1

    data5 = [0, 0, 0, 0, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97]# noqa: E501

    data6 = [0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501


# 流心 : 升 류심 승
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/3fb8395ae3b81bd608e0c4223a8eb534?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill19(ActiveSkill):
    name = "流心 : 升"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 8
    mp = [50, 490]
    uuid = "3fb8395ae3b81bd608e0c4223a8eb534"

    def getWeaponCDRatio(self):
        return 1.0

    data0 = [0, 7137, 7861, 8592, 9313, 10039, 10764, 11485, 12211, 12934, 13656, 14387, 15113, 15832, 16556, 17279, 18010, 18731, 19455, 20184, 20907, 21627, 22358, 23078, 23803, 24528, 25254, 25979, 26702, 27421, 28150, 28876, 29597, 30325, 31049, 31773, 32496, 33218, 33949, 34672, 35392, 36117, 36842, 37572, 38296, 39017, 39741, 40467, 41188, 41912, 42643, 43367, 44090, 44812, 45540, 46262, 46981, 47719, 48440, 49161, 49885, 50611, 51333, 52059, 52782, 53509, 54233, 54954, 55680, 56404, 57130]# noqa: E501
    hit0 = 1 #TODO

    def setMode(self,mode):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑" or weapon[0] == "太刀":
            self.hit0 = 3
            self.skillRation *= 0.8
        elif weapon[0] == "钝器" or weapon[0] == "巨剑" or weapon[0] == "短剑":
            self.skillRation *= 1 + 1.1

    data2 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501

    data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9, 2.9]# noqa: E501




# 流心 : 狂 류심 강
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/5806440d21e7546d50007a5ba11f8024?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill20(ActiveSkill):
    name = "流心 : 狂"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [20, 168]
    uuid = "5806440d21e7546d50007a5ba11f8024"
    damage = False

    data2 = [0, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60]# noqa: E501
    associate = [
        {"type":"*skillRation","data":data2,"skills":['流心 : 升','流心 : 刺','流心 : 跃']}
    ]


    def getWeaponCDRatio(self):
        return 1.0

# 拔刀斩 발도
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/cfacda0647b9a0f595df2c2aad30c18d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill21(ActiveSkill):
    name = "拔刀斩"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [110, 924]

    data0 = [0, 13787, 15192, 16592, 17988, 19385, 20783, 22188, 23585, 24983, 26382, 27779, 29181, 30579, 31977, 33375, 34775, 36171, 37574, 38973, 40370, 41771, 43172, 44568, 45971, 47370, 48770, 50168, 51564, 52962, 54363, 55758, 57161, 58563, 59960, 61358, 62757, 64157, 65556, 66953, 68351, 69752, 71154, 72552, 73952, 75351, 76748, 78149, 79545, 80946, 82343, 83742, 85142, 86541, 87944, 89340, 90740, 92138, 93540, 94934, 96335, 97737, 99134, 100533, 101931, 103331, 104735, 106130, 107526, 108929, 110324]# noqa: E501
    hit0 = 1 #TODO

    data1 = data0
    hit1 = 1
    power1 = 0
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    vps = [
          {
            "name": "拔刀奥义",
            "desc": "施放时间减少<br/>范围增加<br/>发动[神影手]",
            "explain": "[拔刀斩]<br/>准备动作时间 -30%<br/><br/>攻击范围 45%<br/><br/>[神影手]<br/>[拔刀斩]攻击成功时， 获得以下效果<br/>- 发动[神影手]效果<br/>- 一次[拔刀斩]最多发动1次"
          },
          {
            "name": "速战速决",
            "desc": "取消僵直<br/>施放时间减少",
            "explain": "[拔刀斩]<br/>可以强制中断转职技能的施放后僵直并施放 (觉醒技能除外)<br/><br/>根据穿戴的武器， 发动时触发以下效果<br/>- 短剑、 钝器 : 攻击后僵直 -40%<br/>- 太刀、 光剑 : 同时发动拔刀追加攻击<br/>- 巨剑 : 立即以最大蓄气状态施放"
          }
        ]
    def setMode(self,mode=None):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑" or weapon[0] == "钝器":
            self.power1 += 0.3
        elif weapon[0] == "太刀":
            self.power1 += 0.25
        elif weapon[0] == "短剑":
            self.power1 += 0.4

    data3 = [0, 0, 0, 0, 0, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data6 = [0, 0, 0, 0, 0, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data7 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7]# noqa: E501


# 猛龙断空斩 맹룡단공참
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/669f1428193f61f9d92c743b72438c4d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill22(ActiveSkill):
    name = "猛龙断空斩"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [25, 420]
    uuid = "669f1428193f61f9d92c743b72438c4d"
    vps = [
          {
            "name": "猛龙过江",
            "desc": "追踪<br/>范围增加",
            "explain": "[猛龙断空斩]<br/>突进上斩动作结束时生成旋风<br/><br/>[极·神剑术]<br/>巴恩的飓风强化<br/>- 移动时追击周围敌人<br/>- 大小 + 70%<br/>- 持续时间 + 1秒<br/>- 多段攻击次数上限 + 7次<br/>- 总攻击力相同"
          },
          {
            "name": "破竹之势",
            "desc": "取消僵直<br/>所受伤害减少<br/>施放时间减少",
            "explain": "[猛龙断空斩]<br/>突进过程中可以通过[流心]强制中断技能<br/><br/>突进过程中被击时， 招架敌人的攻击， 所受伤害 -90%<br/><br/>攻击次数上限变更为1次<br/>- 固定施放突进上斩动作<br/>- 总攻击力相同"
          }
        ]
    data1 = [0, 4250, 4686, 5117, 5546, 5981, 6411, 6840, 7272, 7704, 8133, 8565, 8997, 9432, 9866, 10296, 10722, 11159, 11591, 12018, 12452, 12884, 13316, 13745, 14180, 14612, 15042, 15471, 15906, 16337, 16766, 17199, 17631, 18059, 18492, 18926, 19356, 19787, 20219, 20652, 21083, 21515, 21945, 22379, 22808, 23238, 23669, 24104, 24534, 24965, 25401, 25832, 26261, 26693, 27126, 27554, 27987, 28413, 28850, 29283, 29715, 30149, 30578, 31008, 31442, 31872, 32301, 32736, 33164, 33599, 34031]# noqa: E501
    hit1 = 2

    data2 = [0, 6246, 6884, 7517, 8151, 8781, 9419, 10052, 10689, 11318, 11954, 12588, 13218, 13860, 14490, 15122, 15759, 16391, 17024, 17658, 18294, 18929, 19559, 20193, 20832, 21464, 22100, 22734, 23366, 24000, 24635, 25269, 25904, 26535, 27168, 27806, 28440, 29073, 29703, 30342, 30972, 31607, 32241, 32876, 33509, 34143, 34779, 35414, 36042, 36680, 37313, 37947, 38582, 39213, 39849, 40484, 41114, 41750, 42384, 43020, 43650, 44285, 44922, 45557, 46185, 46826, 47456, 48087, 48726, 49361, 49995]# noqa: E501
    hit2 = 2

    data3 = data1
    # 护石佩戴后变成11 * 3
    hit3 = 8
    # 护石佩戴后 * 0.43
    power3 = 0


# 破军斩龙击 차지 버스트
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/2c9d9a36c8401bddff6cdb80fab8dc24?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill23(ActiveSkill):
    name = "破军斩龙击"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [30, 450]
    uuid = "2c9d9a36c8401bddff6cdb80fab8dc24"
    vps = [
          {
            "name": "心机一转",
            "desc": "变更为单次攻击<br/>攻击力和冷却时间增加<br/>范围增加",
            "explain": "[破军斩龙击]<br/>变更为集中意念后上斩的技能<br/>- 删除肩撞攻击和刺击攻击<br/>- 总攻击力 +60%<br/>- 基本冷却时间变更为40秒<br/>- 上斩范围 +35%<br/>- 浮空力 + 30%<br/>- 删除附加眩晕效果"
          },
          {
            "name": "无足行步",
            "desc": "聚集敌人<br/>取消僵直",
            "explain": "[破军斩龙击]<br/>可吸附处于霸体状态及无法抓取状态的敌人<br/><br/>可强制中断[破军升龙击]技能的施放后僵直并发动<br/><br/>[破军升龙击]<br/>肩撞攻击会将敌人击退<br/><br/>可强制中断[破军斩龙击]技能的施放后僵直并发动<br/><br/>[三段刃]<br/>可以强制中断技能并施放[破军升龙击]和[破军斩龙击]"
          }
        ]
    data0 = [0, 7179, 7908, 8639, 9369, 10094, 10821, 11553, 12279, 13005, 13745, 14466, 15197, 15929, 16655, 17381, 18114, 18842, 19571, 20295, 21027, 21758, 22482, 23216, 23943, 24672, 25400, 26132, 26856, 27585, 28316, 29043, 29769, 30503, 31232, 31961, 32684, 33417, 34145, 34872, 35604, 36332, 37059, 37788, 38517, 39242, 39977, 40704, 41436, 42159, 42888, 43622, 44348, 45071, 45807, 46532, 47267, 47996, 48723, 49452, 50178, 50909, 51638, 52367, 53094, 53823, 54551, 55281, 56009, 56739, 57467]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 8618, 9492, 10365, 11240, 12119, 12995, 13860, 14742, 15614, 16491, 17363, 18239, 19115, 19986, 20859, 21731, 22610, 23487, 24359, 25236, 26108, 26982, 27855, 28730, 29609, 30483, 31356, 32231, 33104, 33978, 34856, 35730, 36599, 37479, 38352, 39224, 40106, 40976, 41852, 42726, 43593, 44475, 45344, 46220, 47100, 47969, 48849, 49718, 50589, 51464, 52349, 53217, 54090, 54965, 55841, 56717, 57591, 58463, 59345, 60212, 61089, 61965, 62838, 63713, 64584, 65460, 66333, 67212, 68087, 68957]# noqa: E501
    hit1 = 1 #TODO

    data2 = [0, 12929, 14244, 15551, 16862, 18173, 19487, 20798, 22113, 23426, 24738, 26045, 27356, 28670, 29982, 31296, 32606, 33915, 35228, 36539, 37851, 39162, 40476, 41792, 43098, 44408, 45725, 47037, 48348, 49655, 50970, 52284, 53592, 54902, 56217, 57525, 58835, 60152, 61461, 62778, 64091, 65400, 66707, 68022, 69332, 70647, 71958, 73274, 74577, 75891, 77204, 78516, 79830, 81140, 82452, 83762, 85071, 86387, 87698, 89012, 90327, 91632, 92945, 94260, 95570, 96881, 98193, 99503, 100815, 102125, 103442]# noqa: E501
    hit2 = 1 #TODO

    data6 = [0, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501

    data7 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8]# noqa: E501

    def vp_1(self):
        self.cd = 40
        self.skillRation *= 1.6

# 幻影剑舞 환영검무
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/8510294202d0e042dd29a2422fc6770d?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill24(ActiveSkill):
    name = "幻影剑舞"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [360, 3024]
    uuid = "8510294202d0e042dd29a2422fc6770d"
    vps = [
          {
            "name": "无形剑舞",
            "desc": "范围增加<br/>所受伤害减少<br/>每个武器赋予异常状态",
            "explain": "[幻影剑舞]<br/>攻击范围 +55%<br/><br/>施放过程中所受伤害 -90%<br/><br/>[极·神剑术]<br/>幻影斩击多段攻击次数 +13次<br/>- 总攻击力相同<br/><br/>根据所佩戴的武器， 幻影斩击赋予以下异常状态<br/>- 短剑 : 束缚<br/>- 太刀 : 刺伤<br/>- 钝器 : 眩晕<br/>- 巨剑 : 减速<br/>- 光剑 : 感电"
          },
          {
            "name": "残影剑舞",
            "desc": "变更为召唤无形剑的技能<br/>施放时间减少<br/>可以在其他动作中施放<br/>适用最高连击效果",
            "explain": "[幻影剑舞]<br/>召唤无形剑施放[幻影剑舞]<br/>- 可以在其他动作中施放<br/>- 斩击速度 +20%<br/>- 固定以连击次数上限为基准进行攻击"
          }
        ]
    # 短剑 增加剑气攻击力 剑气多端次数
    # 太刀 额外刺伤
    # 太刀 光剑 增加斩击次数 减少斩击攻击力
    # 巨剑 增加斩击攻击力
    # 钝器 删除剑气 发射冲击波 冲击波是剑气的

    # 斩击攻击力
    data0 = [0, 1577, 1737, 1897, 2057, 2217, 2377, 2537, 2697, 2856, 3016, 3176, 3336, 3496, 3656, 3816, 3976, 4136, 4296, 4456, 4616, 4776, 4936, 5096, 5256, 5416, 5576, 5736, 5896, 6056, 6216, 6376, 6536, 6696, 6856, 7015, 7175, 7335, 7495, 7655, 7815, 7975, 8135, 8295, 8455, 8615, 8775, 8935, 9095, 9255, 9415, 9575, 9735, 9895, 10055, 10215, 10375, 10535, 10695, 10855, 11015, 11175, 11334, 11494, 11654, 11814, 11974, 12134, 12294, 12454, 12614]# noqa: E501
    hit0 = 12 #TODO
    # 剑气攻击力
    data1 = [0, 6330, 6972, 7614, 8256, 8898, 9541, 10183, 10825, 11467, 12109, 12751, 13394, 14036, 14678, 15320, 15962, 16604, 17247, 17889, 18531, 19173, 19815, 20457, 21099, 21742, 22384, 23026, 23668, 24310, 24952, 25595, 26237, 26879, 27521, 28163, 28805, 29448, 30090, 30732, 31374, 32016, 32658, 33301, 33943, 34585, 35227, 35869, 36511, 37153, 37796, 38438, 39080, 39722, 40364, 41006, 41649, 42291, 42933, 43575, 44217, 44859, 45502, 46144, 46786, 47428, 48070, 48712, 49354, 49997, 50639]# noqa: E501
    hit1 = 3

    # 钝器 冲击波攻击力
    data2 = [0, 26579, 29275, 31971, 34668, 37364, 40060, 42757, 45453, 48150, 50846, 53542, 56239, 58935, 61631, 64328, 67024, 69721, 72417, 75113, 77810, 80506, 83202, 85899, 88595, 91292, 93988, 96684, 99381, 102077, 104773, 107470, 110166, 112862, 115559, 118255, 120952, 123648, 126344, 129041, 131737, 134433, 137130, 139826, 142523, 145219, 147915, 150612, 153308, 156004, 158701, 161397, 164094, 166790, 169486, 172183, 174879, 177575, 180272, 182968, 185665, 188361, 191057, 193754, 196450, 199146, 201843, 204539, 207236, 209932, 212628]# noqa: E501
    hit2 = 0

    # 75被动影子斩击部分
    data3 = data0
    power3 = 0
    hit3 = 4

    # 75被动影子剑气部分
    data4 = data1
    power4 = 0
    hit4 = 3

    # 75被动钝器冲击波部分
    data5 = data2
    power5 = 0
    hit5 = 1

    def setMode(self, mode=None):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑" or weapon[0] == "太刀":
            # 减少斩击攻击力 增加斩击次数
            self.hit0 = 24
            self.power0 *= 1 - 0.25
        elif weapon[0] == "短剑":
            # 减少斩击攻击力
            self.power0 *= 1 - 0.1
            # 增加剑气攻击力和次数
            self.power1 *= 1.2
            self.hit1 = self.hit4 = 4
        elif weapon[0] == "巨剑":
            # 增加斩击攻击力
            self.power0 *= 1 + 0.5
        elif weapon[0] == "钝器":
            # 不会产生剑气 变成冲击波
            self.hit2 = self.hit5 = 1
            self.hit1 = self.hit4 = 0
        pass

    # 太刀刺伤效果 几率
    data15 = [0, 1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15, 15, 16, 16, 17, 17, 18, 18, 19, 19, 20, 20, 21, 21, 22, 22, 23, 23, 24, 24, 25, 25, 26, 26, 27, 27, 28, 28, 29, 29, 30, 30, 31, 31, 32, 32, 33, 33, 34, 34, 35, 35]# noqa: E501
    # 太刀刺伤效果数
    data16 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501


# 极 · 鬼剑术 (斩铁式) 극 귀검술 : 참철식
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/5152480fdde81362575a488d4cec4af9?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill25(PassiveSkill):
    name = "极 · 鬼剑术 (斩铁式)"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 3
    uuid = "5152480fdde81362575a488d4cec4af9"

    data0 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501

    associate = [{"type":"*skillRation","data":data0}]


# 极 · 鬼剑术 (暴风式) 극 귀검술 : 폭풍식
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/4f2e001e9a19eb7bae50ad1840dfb329?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill26(ActiveSkill):
    name = "极 · 鬼剑术 (暴风式)"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [980, 8232]
    uuid = "4f2e001e9a19eb7bae50ad1840dfb329"

    data0 = [0, 6010, 7401, 8795, 10189, 11584, 12977, 14372, 15766, 17160, 18552, 19949, 21341, 22735, 24130, 25526, 26920, 28310, 29704, 31099, 32491, 33884, 35278, 36674, 38070, 39461, 40855, 42252, 43643, 45037, 46433, 47826, 49222, 50612, 52004, 53398, 54795, 56187, 57578, 58975, 60366, 61763, 63157, 64552, 65946, 67338, 68732, 70127, 71521, 72913, 74306]# noqa: E501
    data0 = [int(i * 1.1 )if index > 9 else i for index, i in enumerate(data0)]
    hit0 = 1 #TODO

    data1 = [0, 2860, 3526, 4186, 4853, 5512, 6182, 6842, 7505, 8172, 8834, 9497, 10163, 10825, 11491, 12156, 12817, 13479, 14145, 14809, 15472, 16135, 16802, 17461, 18128, 18788, 19456, 20115, 20781, 21445, 22111, 22774, 23436, 24101, 24764, 25425, 26093, 26754, 27419, 28081, 28746, 29409, 30074, 30739, 31401, 32065, 32727, 33392, 34056, 34720, 35382]# noqa: E501
    data0 = [int(i * 1.1 )if index > 9 else i for index, i in enumerate(data1)]
    hit1 = 24

    data2 = [0, 11159, 13750, 16340, 18929, 21512, 24104, 26694, 29281, 31867, 34457, 37048, 39636, 42222, 44811, 47403, 49989, 52579, 55167, 57756, 60344, 62930, 65522, 68111, 70698, 73284, 75874, 78466, 81052, 83642, 86228, 88819, 91406, 93997, 96585, 99174, 101761, 104347, 106939, 109523, 112115, 114702, 117290, 119878, 122469, 125055, 127646, 130234, 132823, 135414, 137998]# noqa: E501
    data0 = [int(i * 1.1 )if index > 9 else i for index, i in enumerate(data2)]
    hit2 = 1 #TODO


# 极 · 神剑术 (流星落) 극 귀검술 : 유성락
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/0c262dac3ec41ff79e359ada9c7a7faf?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill27(ActiveSkill):
    name = "极 · 神剑术 (流星落)"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 35
    mp = [420, 1200]
    uuid = "0c262dac3ec41ff79e359ada9c7a7faf"
    vps = [
          {
            "name": "流星审判",
            "desc": "无敌强化<br/>强制控制功能强化<br/>范围增加",
            "explain": "[极·神剑术 (流星落)]<br/>无敌效果强化<br/>- 跳跃动作变更为无敌状态<br/>- 落地后无敌时间 + 1秒<br/><br/>跳跃冲击波攻击可以强制控制敌人1.5秒<br/><br/>流星剑功能强化<br/>- 投掷流星剑前置准备时间 -50%<br/>- 攻击范围 55%<br/><br/>[极·神剑术]<br/>流星之天剑功能强化<br/>- 强制控制持续时间 + 60%<br/>- 攻击范围 55%"
          },
          {
            "name": "天道瞬斩",
            "desc": "变更为投掷剑的技能<br/>追踪",
            "explain": "[极·神剑术 (流星落)]<br/>施放时向空中投掷流星剑和流星之天剑<br/>- 流星剑和流星之天剑会追踪最强的敌人<br/>- 删除跳跃冲击波及地面冲撞攻击<br/>- 总攻击力相同"
          }
        ]
    data0 = [0, 6540, 7209, 7869, 8537, 9197, 9866, 10524, 11190, 11855, 12516, 13182, 13848, 14508, 15174, 15840, 16500, 17165, 17834, 18492, 19157, 19821, 20487, 21149, 21815, 22473, 23141, 23805, 24468, 25128, 25794, 26462, 27122, 27789, 28452, 29109, 29778, 30441, 31110, 31770, 32436, 33095, 33764, 34430, 35088, 35756, 36417, 37077, 37743, 38414, 39074]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 1200, 1325, 1449, 1571, 1691, 1817, 1938, 2060, 2184, 2304, 2432, 2547, 2676, 2798, 2918, 3041, 3162, 3282, 3401, 3530, 3650, 3767, 3899, 4020, 4139, 4263, 4383, 4506, 4628, 4752, 4872, 4998, 5118, 5240, 5361, 5483, 5604, 5729, 5855, 5975, 6099, 6219, 6339, 6464, 6584, 6702, 6831, 6950, 7074, 7199]# noqa: E501
    hit1 = 38

    data2 = [0, 13086, 14417, 15741, 17067, 18401, 19725, 21053, 22385, 23709, 25034, 26370, 27690, 29016, 30351, 31679, 33003, 34335, 35661, 36986, 38321, 39641, 40968, 42299, 43626, 44952, 46286, 47610, 48932, 50262, 51593, 52916, 54251, 55577, 56900, 58232, 59561, 60882, 62219, 63543, 64874, 66198, 67524, 68853, 70181, 71513, 72837, 74168, 75494, 76821, 78149]# noqa: E501
    hit2 = 1 #TODO

    # 75被动追加天剑部分
    dataplus0 = 0
    hitplus0 = 3
    powerplus0 = 1
    # 75被动追加冲击波部分
    dataplus1 = 0
    hitplus1 = 3
    powerplus1 = 1

    data5 = [0, 29, 32, 35, 38, 41, 44, 47, 50, 53, 56, 59, 62, 65, 68, 71, 74, 77, 80, 83, 86, 89, 92, 95, 98, 101, 104, 107, 110, 113, 116, 119, 122, 125, 128, 131, 134, 137, 140, 143, 146, 149, 152, 155, 158, 161, 164, 167, 170, 173, 176]# noqa: E501

    data6 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501


# 破空拔刀斩 극초발도
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/2ba299855fc22192cba4f73db75e9d0e?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill28(ActiveSkill):
    name = "破空拔刀斩"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [800, 1680]
    uuid = "2ba299855fc22192cba4f73db75e9d0e"
    vps = [
          {
            "name": "破空一刀",
            "desc": "剑气攻击力补正<br/>施放时间减少",
            "explain": "[破空拔刀斩]<br/>剑气攻击力变更为与斩击攻击力相同<br/><br/>增加斩击速度<br/>- 准备动作时间 -40%<br/>- 剑气生成后僵直 -20%"
          },
          {
            "name": "流动之刃",
            "desc": "范围增加<br/>可多次发动",
            "explain": "[破空拔刀斩]<br/>剑气移动距离 + 500%<br/><br/>变更为可填充2次的技能<br/>- 每次填充冷却时间 : 25秒<br/>- 单次攻击力 -50%"
          }
        ]
    data0 = [0, 72104, 79419, 86734, 94049, 101364, 108678, 115993, 123308, 130623, 137938, 145253, 152568, 159883, 167198, 174513, 181827, 189142, 196457, 203772, 211087, 218402, 225717, 233032, 240347, 247662, 254976, 262291, 269606, 276921, 284236, 291551, 298866, 306181, 313496, 320811, 328125, 335440, 342755, 350070, 357385, 364700, 372015, 379330, 386645, 393960, 401274, 408589, 415904, 423219, 430534]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 64894, 71477, 78060, 84644, 91227, 97811, 104394, 110977, 117561, 124144, 130728, 137311, 143895, 150478, 157061, 163645, 170228, 176812, 183395, 189978, 196562, 203145, 209729, 216312, 222895, 229479, 236062, 242646, 249229, 255812, 262396, 268979, 275563, 282146, 288729, 295313, 301896, 308480, 315063, 321647, 328230, 334813, 341397, 347980, 354564, 361147, 367730, 374314, 380897, 387481]# noqa: E501
    hit1 = 0

    mode = ["斩击","剑气"]

    def setMode(self,mode=None):
        if mode == "剑气":
            self.hit0 = 0
            self.hit1 = 1

    def vp_1(self):
        self.setMode("斩击")

    def vp_2(self):
        self.cd = 25
        self.skillRation *= 0.5

    data2 = [0, 31, 35, 39, 43, 47, 51, 55, 59, 63, 67, 71, 75, 79, 83, 87, 91, 95, 99, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501

    data3 = [0, 3, 3, 3, 5, 5, 5, 7, 7, 7, 9, 9, 9, 11, 11, 11, 13, 13, 13, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501

# 神影手 신기의 손놀림
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/0fc47245af1f21c3e9217d03aa9fff0a?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill29(PassiveSkill):
    name = "神影手"
    learnLv = 70
    masterLv = 1
    maxLv = 1
    position = 9
    rangeLv = 1
    uuid = "0fc47245af1f21c3e9217d03aa9fff0a"

    data1 = [0, 4080]# noqa: E501
    hit1 = 1 #TODO



# 极 · 神剑术 (破空斩) 극 귀검술 : 심검
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/b501ae53638d33a32351904f31cb6aa3?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill30(ActiveSkill):
    name = "极 · 神剑术 (破空斩)"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3
    rangeLv = 2
    cube = 3
    cd = 35
    mp = [580, 4500]
    uuid = "b501ae53638d33a32351904f31cb6aa3"
    vps = [
          {
            "name": "一合残像",
            "desc": "范围增加<br/>无敌强化",
            "explain": "[极 · 神剑术 (破空斩)]<br/>斩击范围增加<br/>斩击时， 生成2个使用[极·神剑术 (破空斩)]的残影<br/>- X轴攻击范围 + 50%<br/><br/>施放时， 立即无敌"
          },
          {
            "name": "破灭神剑",
            "desc": "施放时间减少<br/>攻击失败补正<br/>斩击攻击并入爆炸<br/>部分技能攻击中自动生效",
            "explain": "[极 · 神剑术 (破空斩)]<br/>施放前僵直 -40%<br/><br/>没有斩击目标时， 冷却时间减少至4秒<br/><br/>对被斩击的敌人附加在一定时间后爆炸的剑痕<br/>- 删除多段攻击<br/>- 总攻击力相同<br/><br/>[神影手]<br/>冲击波攻击强化<br/>- 范围 + 35%<br/>- 冲击波发动时， 同时适用[极·神剑术（破空斩）]攻击 ([极·神剑术（破空斩）]可施放时适用)"
          }
        ]
    data0 = [0, 7692, 8472, 9253, 10033, 10813, 11594, 12374, 13154, 13935, 14715, 15495, 16276, 17056, 17837, 18617, 19397, 20178, 20958, 21738, 22519, 23299, 24079, 24860, 25640, 26420, 27201, 27981, 28761, 29542, 30322, 31102, 31883, 32663, 33443, 34224, 35004, 35785, 36565, 37345, 38126, 38906, 39686, 40467, 41247, 42027, 42808, 43588, 44368, 45149, 45929]# noqa: E501
    hit0 = 5

    data1 = [0, 25640, 28241, 30842, 33443, 36045, 38646, 41247, 43848, 46449, 49050, 51652, 54253, 56854, 59455, 62056, 64657, 67259, 69860, 72461, 75062, 77663, 80264, 82866, 85467, 88068, 90669, 93270, 95871, 98472, 101074, 103675, 106276, 108877, 111478, 114079, 116681, 119282, 121883, 124484, 127085, 129686, 132288, 134889, 137490, 140091, 142692, 145293, 147894, 150496, 153097]# noqa: E501
    hit1 = 1

    def setMode(self,mode=None):
        weapon = self.char.GetWeaponType()
        if weapon[0] == "光剑" or weapon[0] == "太刀":
            # 减少斩击攻击力 增加斩击次数
            self.hit0 = 6
        elif weapon[0] == "巨剑":
            # 增加斩击攻击力
            self.power0 *= 1 + 0.08
            self.power1 *= 1 + 0.08

    data4 = [0, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139, 141, 143, 145, 147, 149, 151]# noqa: E501

    data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501



# 极 · 神剑术 극한의 경지
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/3af805da8505fe6234a95b535610f064?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill31(PassiveSkill):
    name = "极 · 神剑术"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 3
    uuid = "3af805da8505fe6234a95b535610f064"

    data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    # 后跳斩
    data1 = [0, 737, 854, 972, 1089, 1206, 1324, 1441, 1559, 1676, 1794, 1911, 2028, 2146, 2263, 2381, 2498, 2616, 2733, 2851, 2968, 3085, 3203, 3320, 3438, 3555, 3673, 3790, 3907, 4025, 4142, 4260, 4377, 4495, 4612, 4729, 4847, 4964, 5082, 5199, 5317, 5434, 5552, 5669, 5786, 5904, 6021, 6139, 6256, 6374, 6491]# noqa: E501
    # 破军升龙击 暴风式冲击波 
    data2 = [0, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 148, 152, 156, 160, 164, 168, 172, 176, 180, 184, 188, 192, 196, 200, 204, 208, 212, 216, 220, 224, 228, 232, 236]# noqa: E501
    #猛龙断空斩 飓风
    data3 = [0, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119]# noqa: E501
    # 幻影剑舞 幻影斩击
    data4 = [0, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120, 125, 130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 185, 190, 195, 200, 205, 210, 215, 220, 225, 230, 235, 240, 245, 250, 255, 260, 265, 270, 275, 280, 285, 290, 295, 300]# noqa: E501
    # 幻影剑舞 幻影剑气
    data5 = [0, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 105, 110, 115, 120, 125, 130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 185, 190, 195, 200, 205, 210, 215, 220, 225, 230, 235, 240, 245, 250, 255, 260, 265, 270, 275, 280, 285, 290, 295, 300]# noqa: E501
    # 幻影剑舞 幻影钝器冲击波
    data6 = [0, 41, 46, 51, 56, 61, 66, 71, 76, 81, 86, 91, 96, 101, 106, 111, 116, 121, 126, 131, 136, 141, 146, 151, 156, 161, 166, 171, 176, 181, 186, 191, 196, 201, 206, 211, 216, 221, 226, 231, 236, 241, 246, 251, 256, 261, 266, 271, 276, 281, 286]# noqa: E501
    # 流星落 流星之天剑
    data7 = [0, 4698, 5447, 6196, 6945, 7694, 8443, 9192, 9941, 10690, 11439, 12188, 12937, 13685, 14434, 15183, 15932, 16681, 17430, 18179, 18928, 19677, 20426, 21175, 21924, 22673, 23422, 24171, 24920, 25669, 26418, 27167, 27916, 28665, 29414, 30163, 30911, 31660, 32409, 33158, 33907, 34656, 35405, 36154, 36903, 37652, 38401, 39150, 39899, 40648, 41397]# noqa: E501
    # 流星落 太刀刺伤
    data12 = [0, 64, 67, 70, 73, 76, 79, 82, 85, 88, 91, 94, 97, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    # 流星落 可附加的刺伤数量
    data13 = [0, 4, 4, 4, 5, 5, 5, 6, 6, 6, 7, 7, 7, 8, 8, 8, 9, 9, 9, 10, 10, 10, 11, 11, 11, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    # 流星落 光剑 地面冲击波 
    data15 = [0, 1885, 2185, 2486, 2786, 3087, 3387, 3688, 3988, 4289, 4589, 4890, 5190, 5491, 5791, 6092, 6392, 6693, 6993, 7294, 7594, 7894, 8195, 8495, 8796, 9096, 9397, 9697, 9998, 10298, 10599, 10899, 11200, 11500, 11801, 12101, 12402, 12702, 13003, 13303, 13604, 13904, 14205, 14505, 14806, 15106, 15406, 15707, 16007, 16308, 16608]# noqa: E501
    # 巨剑 攻击力增加
    data19 = [0, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60]# noqa: E501
    # 钝器 地面冲击波
    data20 = [0, 1944, 2253, 2563, 2873, 3183, 3493, 3803, 4112, 4422, 4732, 5042, 5352, 5662, 5972, 6281, 6591, 6901, 7211, 7521, 7831, 8140, 8450, 8760, 9070, 9380, 9690, 9999, 10309, 10619, 10929, 11239, 11549, 11859, 12168, 12478, 12788, 13098, 13408, 13718, 14027, 14337, 14647, 14957, 15267, 15577, 15887, 16196, 16506, 16816, 17126]# noqa: E501
    # 破空斩 爆炸攻击力
    data23 = [0, 60, 66, 72, 78, 84, 90, 96, 102, 108, 114, 120, 126, 132, 138, 144, 150, 156, 162, 168, 174, 180, 186, 192, 198, 204, 210, 216, 222, 228, 234, 240, 246, 252, 258, 264, 270, 276, 282, 288, 294, 300, 306, 312, 318, 324, 330, 336, 342, 348, 354]# noqa: E501
    associate = [
        {"type":"*skillRation","data":data0,"skills":['拔刀斩', '破军斩龙击', '极 · 鬼剑术 (暴风式)', '破空拔刀斩','极 · 神剑术 (瞬斩)', '万剑归宗', '极 · 神剑术 (无形斩)', '万剑极诣·开天斩']},
        {"type":"+power3","data":data2,"skills":['破军升龙击']},
        {"type":"+power3","data":data3,"skills":['猛龙断空斩']},
        {"type":"+power3","data":data4,"skills":['幻影剑舞']},
        {"type":"+power4","data":data5,"skills":['幻影剑舞']},
        {"type":"+power5","data":data6,"skills":['幻影剑舞'],"weapon":['钝器']},
        {"type":"+dataplus0","data":data7,"skills":['极 · 神剑术 (流星落)'],"ratio":1},
        {"type":"+dataplus1","data":data15,"skills":['极 · 神剑术 (流星落)'],'weapon':["光剑"],"ratio":1},
        {"type":"*powerplus0","data":data19,"skills":['极 · 神剑术 (流星落)'],'weapon':["巨剑"]},
        {"type":"+dataplus1","data":data20,"skills":['极 · 神剑术 (流星落)'],'weapon':["钝器"],"ratio":1},
        {"type":"*power1","data":data23,"skills":["极 · 神剑术 (破空斩)"]}
        ]



# 极 · 神剑术 (瞬斩) 극 발검술 : 섬단
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/d8ff976e2aaa4720272a5175d1eb9126?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill32(ActiveSkill):
    name = "极 · 神剑术 (瞬斩)"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 5
    cd = 50
    mp = [800, 6000]
    uuid = "d8ff976e2aaa4720272a5175d1eb9126"
    vps = [
          {
            "name": "最后一斩",
            "desc": "施放时间减少<br/>取消僵直",
            "explain": "[极 · 神剑术 (瞬斩)]<br/>拔剑斩击准备时间 -40%<br/><br/>拔剑斩击命中时， 可强制中断施放后僵直并使用转职技能<br/>中断施放后僵直时， 角色会转换方向并使用技能"
          },
          {
            "name": "一刃闪",
            "desc": "可以在空中施放<br/>范围增加<br/>攻击时间减少<br/>变更为单次攻击",
            "explain": "[极 · 神剑术 (瞬斩)]<br/>可以在175px以下的空中施放<br/><br/>拔剑斩击范围增加<br/>- 前进距离 +60%<br/>- Y轴攻击范围 +60%<br/><br/>删除拔剑斩击攻击及剑气多段攻击<br/>- 总攻击力相同"
          }
        ]
    data0 = [0, 20101, 22139, 24178, 26217, 28256, 30295, 32338, 34374, 36416, 38454, 40492, 42531, 44571, 46610, 48648, 50687, 52726, 54765, 56806, 58846, 60883, 62923, 64962, 67002, 69041, 71083, 73117, 75162, 77195, 79238, 81277, 83316, 85355, 87395, 89432, 91471, 93514, 95549, 97592, 99630, 101671, 103705, 105748, 107786, 109823, 111864, 113903, 115940, 117980, 120023]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 3289, 3623, 3951, 4288, 4622, 4957, 5289, 5624, 5957, 6289, 6625, 6959, 7293, 7625, 7961, 8294, 8626, 8961, 9295, 9628, 9962, 10297, 10628, 10964, 11299, 11629, 11964, 12299, 12633, 12966, 13300, 13631, 13965, 14298, 14633, 14968, 15300, 15637, 15968, 16302, 16636, 16968, 17305, 17639, 17969, 18305, 18640, 18968, 19304, 19641]# noqa: E501
    hit1 = 5

    data3 = [0, 54818, 60381, 65941, 71503, 77065, 82628, 88188, 93750, 99310, 104872, 110435, 115995, 121555, 127117, 132680, 138241, 143802, 149362, 154925, 160491, 166050, 171612, 177173, 182734, 188297, 193853, 199418, 204979, 210542, 216103, 221666, 227227, 232788, 238350, 243912, 249471, 255033, 260592, 266156, 271719, 277280, 282839, 288404, 293961, 299524, 305087, 310648, 316207, 321772, 327331]# noqa: E501
    hit3 = 1 #TODO



# 万剑归宗 이기어검술
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/0f638da961acf7958ac6070b7aaed013?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill33(ActiveSkill):
    name = "万剑归宗"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "0f638da961acf7958ac6070b7aaed013"

    data1 = [0, 1568, 1931, 2296, 2661, 3022, 3382, 3752, 4111, 4476, 4842, 5202, 5565, 5929, 6293, 6657, 7020, 7383, 7746, 8110, 8474, 8837, 9201, 9566, 9928, 10294, 10655, 11016, 11381, 11744, 12110, 12474, 12836, 13202, 13565, 13926, 14291, 14657, 15018, 15379, 15743, 16111, 16471, 16833, 17201, 17561, 17925, 18292, 18653, 19016, 19380]# noqa: E501
    hit1 = 1 #TODO

    data2 = [0, 7264, 8956, 10643, 12324, 14013, 15701, 17381, 19073, 20753, 22435, 24131, 25812, 27494, 29176, 30870, 32555, 34235, 35920, 37616, 39296, 40977, 42665, 44348, 46038, 47726, 49410, 51091, 52786, 54469, 56148, 57831, 59528, 61207, 62891, 64578, 66261, 67953, 69634, 71327, 73006, 74693, 76382, 78066, 79745, 81430, 83122, 84806, 86487, 88172, 89868]# noqa: E501
    hit2 = 14

    data3 = [0, 29033, 35769, 42507, 49243, 55964, 62701, 69436, 76177, 82902, 89642, 96376, 103113, 109837, 116571, 123309, 130044, 136776, 143511, 150246, 156971, 163706, 170443, 177179, 183914, 190642, 197378, 204110, 210838, 217578, 224311, 231045, 237780, 244512, 251245, 257980, 264709, 271444, 278183, 284917, 291651, 298377, 305114, 311849, 318580, 325315, 332048, 338785, 345511, 352248, 358982]# noqa: E501
    hit3 = 2

    mode = ["终结",'穿云剑']

    def setMode(self,mode=None):
        if mode == '终结':
            self.hit1 = 0
        if mode == '穿云剑':
            self.hit2 = self.hit3 = 0


# 无形剑意 무형지경
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/7ec521d063d2190e1fcc5bd229af9bcf?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill34(PassiveSkill):
    name = "无形剑意"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "7ec521d063d2190e1fcc5bd229af9bcf"

    data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501

    # 对流系技能存在技能形态变动，但是实际加成和其他技能一致，这里简单化处理
    associate = [{"type":"*skillRation","data":data0}]

# 极 · 神剑术 (无形斩) 극 발검술 : 무형참
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/0113c8b1306ca76d208f83f2d093dd62?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill35(ActiveSkill):
    name = "极 · 神剑术 (无形斩)"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [960, 7200]
    uuid = "0113c8b1306ca76d208f83f2d093dd62"

    data0 = [0, 30185, 33250, 36312, 39374, 42438, 45500, 48561, 51625, 54687, 57750, 60812, 63875, 66936, 70000, 73063, 76124, 79187, 82251, 85311, 88374, 91437, 94500, 97561, 100626, 103688, 106749, 109812, 112876, 115937, 119001, 122062, 125124, 128188, 131251, 134311, 137375, 140438, 143500, 146563, 149626, 152687, 155750, 158813, 161876, 164937, 168001, 171062, 174126, 177188, 180250]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 4312, 4749, 5186, 5623, 6061, 6500, 6937, 7374, 7811, 8250, 8687, 9126, 9561, 10000, 10437, 10874, 11310, 11748, 12186, 12624, 13061, 13499, 13937, 14374, 14812, 15249, 15688, 16124, 16562, 16999, 17437, 17875, 18313, 18749, 19187, 19625, 20064, 20498, 20936, 21374, 21813, 22250, 22687, 23125, 23562, 23999, 24437, 24875, 25312, 25749]# noqa: E501
    hit1 = 13

    data3 = [0, 57500, 63332, 69166, 74999, 80833, 86665, 92498, 98332, 104165, 109999, 115833, 121667, 127499, 133334, 139168, 145000, 150833, 156666, 162500, 168332, 174166, 180000, 185834, 191665, 197499, 203333, 209165, 214999, 220832, 226668, 232503, 238334, 244168, 250001, 255834, 261667, 267502, 273336, 279168, 285001, 290835, 296668, 302501, 308335, 314169, 320001, 325835, 331668, 337501, 343334]# noqa: E501
    hit3 = 1 #TODO


# 万剑极诣·开天斩 천제극섬
# https://api.neople.co.kr/df/skills/41f1cdc2ff58bb5fdc287be0db2a8df3/8b08f9504167a9c0f3a1d29d71b7943e?apikey=fdvit1Kj64EAJm0qfB3JEAD8FLExLDD0
class Skill36(ActiveSkill):
    name = "万剑极诣·开天斩"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "8b08f9504167a9c0f3a1d29d71b7943e"

    data0 = [0, 68275, 84108, 99940, 115772, 131603, 147435, 163267, 179099, 194930, 210763, 226594, 242427, 258257, 274089, 289923, 305755, 321587, 337420, 353251, 369081, 384914, 400746, 416579, 432409, 448243, 464075, 479905, 495737, 511570, 527401, 543233, 559066, 574899, 590726, 606560, 622390, 638223, 654056, 669888, 685719, 701552, 717384, 733215, 749049, 764879, 780711, 796542, 812376, 828208, 844038]# noqa: E501
    hit0 = 1 #TODO

    data1 = [0, 89283, 109985, 130689, 151394, 172097, 192799, 213502, 234207, 254909, 275612, 296315, 317019, 337723, 358427, 379129, 399832, 420538, 441242, 461945, 482645, 503350, 524055, 544757, 565461, 586164, 606865, 627569, 648274, 668975, 689680, 710382, 731087, 751789, 772490, 793197, 813899, 834602, 855308, 876009, 896709, 917416, 938120, 958821, 979526, 1000230, 1020932, 1041636, 1062340, 1083042, 1103746]# noqa: E501
    hit1 = 1 #TODO

    data2 = [0, 12253, 15095, 17937, 20777, 23621, 26461, 29304, 32145, 34989, 37830, 40669, 43512, 46354, 49196, 52037, 54879, 57720, 60562, 63404, 66243, 69085, 71929, 74772, 77610, 80454, 83295, 86136, 88976, 91821, 94659, 97501, 100342, 103183, 106026, 108869, 111712, 114553, 117395, 120235, 123075, 125918, 128760, 131602, 134444, 137285, 140127, 142969, 145809, 148651, 151493]# noqa: E501
    hit2 = 6

    data4 = [0, 16805, 20704, 24598, 28497, 32394, 36291, 40189, 44085, 47983, 51880, 55775, 59674, 63570, 67466, 71365, 75262, 79160, 83057, 86954, 90850, 94746, 98644, 102540, 106439, 110336, 114234, 118131, 122030, 125923, 129822, 133719, 137613, 141514, 145409, 149303, 153204, 157100, 160996, 164896, 168792, 172689, 176586, 180484, 184379, 188278, 192174, 196071, 199968, 203866, 207763]# noqa: E501
    hit4 = 5

    data6 = [0, 210078, 258790, 307505, 356218, 404933, 453646, 502360, 551075, 599788, 648503, 697216, 745931, 794644, 843358, 892070, 940786, 989499, 1038213, 1086924, 1135639, 1184353, 1233067, 1281781, 1330496, 1379208, 1427923, 1476636, 1525351, 1574064, 1622778, 1671490, 1720205, 1768920, 1817632, 1866348, 1915061, 1963772, 2012490, 2061203, 2109915, 2158630, 2207344, 2256058, 2304772, 2353484, 2402197, 2450911, 2499625, 2548339, 2597053]# noqa: E501
    hit6 = 1 #TODO

class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'weapon_master'
        self.nameCN = '极诣·剑魂'
        self.role = 'swordman_male'

        self.武器选项 = ['光剑','太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['物理百分比']
        self.输出类型 = '物理百分比'
        self.防具精通属性 = ['力量']
        self.防具类型 = '轻甲'
        self.buff = 1.86

        self.角色 = '鬼剑士(男)'

        self.职业 = '剑魂'

        super().__init__(equVersion, __name__)

    def AddSkillLv(self, min: int, max: int, lv: int, type=-1, exceptSkills:list[str]=[]) -> None:
        """
        增加技能等级
        type: -1 全部, 0 被动, 1 主动
        """
        for skill in self.skills:
            # 四个武器精通不享受技能范围等级加成
            if min <= skill.learnLv <= max and skill.name not in  ['太刀精通', '巨剑精通', '短剑精通', '钝器精通', '光剑精通'] + exceptSkills:
                skillType = 'all' if type == -1 else ('active' if type == 1 else 'passive')
                if (skillType == 'all' or skill.type == skillType) and skill.lv > 0:
                    skill.lv += lv