#afdf3b989339de478e85b614d274d1ef
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "gunner_male/assault/cn/skillDetail"

# 膝撞
# gunner_male/assault/717f1e2104fe4b796f800352fa143ecc
# afdf3b989339de478e85b614d274d1ef/717f1e2104fe4b796f800352fa143ecc
class Skill0(ActiveSkill):
    """
        向敌人发出强威力的膝撞并使其浮空， 发动的瞬间存在霸体判定。
    """
    name = "膝撞"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 4 #TODO
    rangeLv = 3
    cd = 2
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 发动速度增加率 : {value0}%
    # REMOVE: data0 = [0, 0, 2, 4, 7, 9, 11, 13, 16, 18, 20, 22, 24, 27, 29, 31, 33, 36, 38, 40, 42]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 131.4, 132.8, 134, 135.4, 136.5, 138, 139.1, 140.5, 141.7, 143.1, 147.7, 152.2, 157.1, 162, 166.5, 171.4, 176.2, 180.8, 185.7, 190.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击力 : {value2}%
    # REMOVE: data2 = [0, 135, 157, 178, 200, 221, 243, 264, 286, 307, 329, 350, 372, 393, 415, 436, 458, 479, 501, 522, 544]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1

# 浮空弹
# gunner_male/assault/128b9ddef2262f40723deae4407bdb42
# afdf3b989339de478e85b614d274d1ef/128b9ddef2262f40723deae4407bdb42
class Skill1(ActiveSkill):
    """
        向敌人发射1发子弹并使其浮空。
    """
    name = "浮空弹"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 4
    mp = [6, 140]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 子弹攻击力 : {value0}%
    # REMOVE: data0 = [0, 4108, 4525, 4942, 5358, 5775, 6192, 6609, 7025, 7442, 7859, 8276, 8692, 9109, 9526, 9943, 10359, 10776, 11193, 11610, 12026, 12443, 12860, 13277, 13693, 14110, 14527, 14944, 15360, 15777, 16194, 16611, 17027, 17444, 17861, 18278, 18694, 19111, 19528, 19945, 20361, 20778, 21195, 21612, 22028, 22445, 22862, 23279, 23695, 24112, 24529, 24946, 25362, 25779, 26196, 26613, 27029, 27446, 27863, 28280, 28696, 29113, 29530, 29947, 30363, 30780, 31197, 31614, 32030, 32447, 32864]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 114.2, 115.1, 116, 116.8, 117.7, 118.5, 119.4, 120.2, 121.1, 122, 122.8, 123.7, 124.5, 125.4, 126.2, 127.1, 128, 128.8, 129.7, 130.5, 131.4, 132.2, 133.1, 134, 134.8, 135.7, 136.5, 137.4, 138.2, 139.1, 140, 140.8, 141.7, 142.5, 143.4, 144.2, 145.1, 146, 146.8, 147.7, 148.5, 149.4, 150.2, 151.1, 152, 152.8, 153.7, 154.5, 155.4, 156.2, 157.1, 158, 158.8, 159.7, 160.5, 161.4, 162.2, 163.1, 164, 164.8, 165.7, 166.5, 167.4, 168.2, 169.1, 170, 170.8, 171.7, 172.5, 173.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 后跳
# gunner_male/assault/7822d6d52e10964a6755f142c666b494
# afdf3b989339de478e85b614d274d1ef/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
        使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501


# 基础精通
# gunner_male/assault/5a56514f35cf0270ae8d6c65f8fefd78
# afdf3b989339de478e85b614d274d1ef/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
        增加基本攻击、 前冲攻击、 跳跃攻击、 [膝撞]的攻击力。\n
        在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    associate = [{"type":"*skillDamage","data":[i-100 if i>0 else 0 for i in data0],"skills":["瞄准射击"]}]

# 受身蹲伏
# gunner_male/assault/ce26c6b69d02a440a81b552bec94f03b
# afdf3b989339de478e85b614d274d1ef/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
        使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 合金改装
# gunner_male/assault/cc9b13baa94dd463477d07ded90e6833
# afdf3b989339de478e85b614d274d1ef/cc9b13baa94dd463477d07ded90e6833
class Skill5(PassiveSkill):
    """
        合金战士利用经过改造的身体和武器， 深入最危险的地区执行作战。\n
        部分身体改造为机械躯体， 不会流血； 死亡时， 启动自动引爆程序。\n
        可利用改造的身体发动超频系列技能， 增加攻击速度和移动速度， 并附加以下效果。\n
    [附加效果信息]\n
        使用改造型自动手枪， 基本攻击的最后1击变更为连射， 滑行攻击中途可使用超频系列技能。\n
        装备自动手枪时， 武器的物理攻击力、 力量 (包括因强化、 增幅而增加的数值) 补正为与魔法攻击力、 智力相同的数值。\n
    [超频系列技能效果信息]\n
        施放除觉醒技能外的超频技能时， 可以强制取消施放后僵直并转职技能。\n
        可以强制中断转职技能施放后僵直并使用。 (包括觉醒技能的部分技能除外)\n
    [无法中断施放后僵直的技能]\n
        [磁力手雷]、 [堡垒轰击]、 [AT-SO步行者]、 [步行者中止指令]、 [超频 : 全领域攻击]、 [超频 : 伊奎利斯-MR]、 [超频 : 末世终结之战]\n
        决斗场中， 适用[心脏驱动]增益后， 才能使用超频系列技能和强制中断施放后僵直。
    """
    name = "合金改装"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 3
    uuid = "cc9b13baa94dd463477d07ded90e6833"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击速度增加 : {value0}%
    # REMOVE: data0 = [0, 15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 移动速度增加 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 防具精通
# gunner_male/assault/892ef624d8bf3d7fc045f84825fd6104
# afdf3b989339de478e85b614d274d1ef/892ef624d8bf3d7fc045f84825fd6104
class Skill6(PassiveSkill):
    """
        穿戴防具时， 可以增加各种属性。\n
        穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501


# M-137格林机枪
# gunner_male/assault/01c3a2fb793d293a25ed8dc7a0d70c1a
# afdf3b989339de478e85b614d274d1ef/01c3a2fb793d293a25ed8dc7a0d70c1a
class Skill7(ActiveSkill):
    """
        使用M-137格林机枪攻击敌人。 若连按攻击键可以延长发射时间， 但按跳跃键或达到发射时间上限， 则会停止发射。\n
        若发射中按住向上方向键， 则可以向上发射。\n
    学习[连锁卫星]后\n
        向人工卫星发出攻击命令。\n
        卫星射击对击范围内的所有敌人造成伤害， 相比[M-137格林机枪]攻击次数减少， 但破坏力更强。
    """
    name = "M-137格林机枪"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 10 #TODO
    rangeLv = 2
    cd = 5
    mp = [10, 252]
    uuid = "01c3a2fb793d293a25ed8dc7a0d70c1a"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 181, 199, 217, 236, 254, 272, 291, 309, 327, 346, 364, 382, 401, 419, 438, 456, 474, 493, 511, 529, 548, 566, 584, 603, 621, 639, 658, 676, 694, 713, 731, 749, 768, 786, 804, 823, 841, 859, 878, 896, 914, 933, 951, 969, 988, 1006, 1024, 1043, 1061, 1079, 1098, 1116, 1134, 1153, 1171, 1189, 1208, 1226, 1244, 1263, 1281, 1299, 1318, 1336, 1354, 1373, 1391, 1409, 1428, 1446]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 16
    # 发射时间上限 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 取出机枪所用时间 : {value2}秒
    # REMOVE: data2 = [0, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2, 0.2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 每秒发射数 : {value3}发
    # REMOVE: data3 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 穿刺几率 : {value4}%
    # REMOVE: data4 = [0, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47, 47]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 学习[连锁卫星]后
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

# RX-78追击者
# gunner_male/assault/8ee0099656df08a0b39225f8a21d514b
# afdf3b989339de478e85b614d274d1ef/8ee0099656df08a0b39225f8a21d514b
class Skill8(ActiveSkill):
    """
        设置诱导型爆炸机器人RX-78追击者， 使其跟踪敌人后爆炸并对周围敌人造成火属性魔法伤害。\n
        对建筑型护甲的敌人可以造成125%的伤害。
    """
    name = "RX-78追击者"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 9 #TODO
    rangeLv = 2
    cd = 2.5
    mp = [10, 82]
    uuid = "8ee0099656df08a0b39225f8a21d514b"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1598, 1760, 1922, 2084, 2246, 2409, 2571, 2733, 2895, 3057, 3219, 3381, 3543, 3706, 3868, 4030, 4192, 4354, 4516, 4678, 4840, 5002, 5165, 5327, 5489, 5651, 5813, 5975, 6137, 6299, 6461, 6624, 6786, 6948, 7110, 7272, 7434, 7596, 7758, 7921, 8083, 8245, 8407, 8569, 8731, 8893, 9055, 9217, 9380, 9542, 9704, 9866, 10028, 10190, 10352, 10514, 10676, 10839, 11001, 11163, 11325, 11487, 11649, 11811, 11973, 12136, 12298, 12460, 12622, 12784]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 持续时间 : {value1}秒
    # REMOVE: data1 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 范围比率 : {value2}%
    # REMOVE: data2 = [0, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169, 169]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 超频 : 压制
# gunner_male/assault/e1003c1bd2566829cfed17bb4ce8d460
# afdf3b989339de478e85b614d274d1ef/e1003c1bd2566829cfed17bb4ce8d460
class Skill9(ActiveSkill):
    """
        解除改造机械腿的限制， 瞬间移动一定距离， 攻击路径上的敌人。\n
        移动中途按相反方向键并发动基本攻击或转职技能时， 转向后方发动攻击。
    """
    name = "超频 : 压制"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 6
    mp = [17, 178]
    uuid = "e1003c1bd2566829cfed17bb4ce8d460"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 移动电流攻击力 : {value0}%
    # REMOVE: data0 = [0, 3951, 4352, 4753, 5153, 5554, 5955, 6356, 6757, 7158, 7558, 7959, 8360, 8761, 9162, 9563, 9963, 10364, 10765, 11166, 11567, 11968, 12368, 12769, 13170, 13571, 13972, 14372, 14773, 15174, 15575, 15976, 16377, 16777, 17178, 17579, 17980, 18381, 18782, 19182, 19583, 19984, 20385, 20786, 21187, 21587, 21988, 22389, 22790, 23191, 23591, 23992, 24393, 24794, 25195, 25596, 25996, 26397, 26798, 27199, 27600, 28001, 28401, 28802, 29203, 29604, 30005, 30406, 30806, 31207, 31608]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 5

# 回旋踢
# gunner_male/assault/0969cd4054d93da07708108c0cc1c4b5
# afdf3b989339de478e85b614d274d1ef/0969cd4054d93da07708108c0cc1c4b5
class Skill10(ActiveSkill):
    """
        向周围敌人发出华丽的回旋踢攻击。\n
        前冲攻击或者倒地时按攻击键， 可以发动回旋踢的同时站立。
    """
    name = "回旋踢"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 4
    mp = [18, 196]
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 发动速度增加率 : {value0}%
    # REMOVE: data0 = [0, 0, 1, 3, 4, 5, 7, 8, 9, 11, 12, 15, 16, 18, 19, 20, 22, 23, 24, 26, 27, 28, 30, 31, 32, 34, 35, 36, 38, 39, 42, 43, 45, 46, 47, 49, 50, 51, 53, 54, 55, 57, 58, 59, 61, 62, 63, 65, 66, 69, 70, 72, 73, 74, 76, 77, 78, 80, 81, 82, 84, 85, 86, 88, 89, 90, 92, 95, 96, 97, 99]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 踢击攻击力 : {value1}%
    # REMOVE: data1 = [0, 2791, 3074, 3357, 3640, 3923, 4206, 4489, 4772, 5055, 5338, 5621, 5905, 6188, 6471, 6754, 7037, 7320, 7603, 7886, 8169, 8452, 8735, 9019, 9302, 9585, 9868, 10151, 10434, 10717, 11000, 11283, 11566, 11850, 12133, 12416, 12699, 12982, 13265, 13548, 13831, 14114, 14397, 14680, 14964, 15247, 15530, 15813, 16096, 16379, 16662, 16945, 17228, 17511, 17794, 18078, 18361, 18644, 18927, 19210, 19493, 19776, 20059, 20342, 20625, 20909, 21192, 21475, 21758, 22041, 22324]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 2
    # 攻击次数 : {value2}次
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 踏射
# gunner_male/assault/4655101518604f874721b3cc249aae10
# afdf3b989339de478e85b614d274d1ef/4655101518604f874721b3cc249aae10
class Skill11(ActiveSkill):
    """
        踩住前方1名敌人并射击， 踩住敌人的同时可以对周围敌人造成伤害。\n
        可以抓取霸体和防御状态的敌人， 但对无法抓取的敌人不适用抓取和控制效果。\n
        学习[花式枪术]时， 抓取失败时会进入无敌状态， 聚集力量震击敌人并使其浮空。\n
        在决斗场中， [花式枪术]附加效果不生效。
    """
    name = "踏射"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 5
    mp = [18, 224]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 5326, 5866, 6406, 6946, 7487, 8027, 8567, 9108, 9648, 10188, 10728, 11269, 11809, 12349, 12890, 13430, 13970, 14510, 15051, 15591, 16131, 16671, 17212, 17752, 18292, 18833, 19373, 19913, 20453, 20994, 21534, 22074, 22615, 23155, 23695, 24235, 24776, 25316, 25856, 26397, 26937, 27477, 28017, 28558, 29098, 29638, 30178, 30719, 31259, 31799, 32340, 32880, 33420, 33960, 34501, 35041, 35581, 36122, 36662, 37202, 37742, 38283, 38823, 39363, 39904, 40444, 40984, 41524, 42065, 42605]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 射击攻击力 : {value1}%
    # REMOVE: data1 = [0, 1334, 1469, 1604, 1739, 1875, 2010, 2145, 2281, 2416, 2551, 2686, 2822, 2957, 3092, 3228, 3363, 3498, 3633, 3769, 3904, 4039, 4175, 4310, 4445, 4581, 4716, 4851, 4986, 5122, 5257, 5392, 5528, 5663, 5798, 5933, 6069, 6204, 6339, 6475, 6610, 6745, 6880, 7016, 7151, 7286, 7422, 7557, 7692, 7827, 7963, 8098, 8233, 8369, 8504, 8639, 8775, 8910, 9045, 9180, 9316, 9451, 9586, 9722, 9857, 9992, 10127, 10263, 10398, 10533, 10669]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 射击次数 : {value2}次
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 炙烤
# gunner_male/assault/8c2379737c5acc935c1731f67f607655
# afdf3b989339de478e85b614d274d1ef/8c2379737c5acc935c1731f67f607655
class Skill12(ActiveSkill):
    """
        先向前方1名敌人发出强威力的膝撞使其浮空， 然后再用格林机枪进行猛烈追射， 膝撞攻击的攻击力与当前已学的[膝撞]攻击力相同。\n
        攻击型抓取判断 : 对霸体状态、 防御状态、 无法抓取的敌人不适用控制效果， 只能造成膝撞攻击伤害。
    """
    name = "炙烤"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 8
    mp = [30, 322]
    uuid = "8c2379737c5acc935c1731f67f607655"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1206, 1329, 1451, 1573, 1696, 1818, 1940, 2063, 2185, 2307, 2430, 2552, 2675, 2797, 2919, 3042, 3164, 3286, 3409, 3531, 3653, 3776, 3898, 4021, 4143, 4265, 4388, 4510, 4632, 4755, 4877, 4999, 5122, 5244, 5367, 5489, 5611, 5734, 5856, 5978, 6101, 6223, 6345, 6468, 6590, 6713, 6835, 6957, 7080, 7202, 7324, 7447, 7569, 7691, 7814, 7936, 8059, 8181, 8303, 8426, 8548, 8670, 8793, 8915, 9038, 9160, 9282, 9405, 9527, 9649]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 发射次数 : {value1}次
    # REMOVE: data1 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 0

    mode = ["不可抓取","可抓取"]

    def setMode(self, mode):
        if mode == "不可抓取":
            self.hit0 = 1
            self.hit1 = 0
        elif mode == "可抓取":
            self.hit0 = 1
            self.hit1 = 12

# 浮空铲
# gunner_male/assault/dcd536f1674630f01fc9667bb202b851
# afdf3b989339de478e85b614d274d1ef/dcd536f1674630f01fc9667bb202b851
class Skill13(ActiveSkill):
    """
        使滑铲(前冲攻击)命中的敌人浮空。
    """
    name = "浮空铲"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 9 #TODO
    rangeLv = 3
    cd = 8
    mp = [22, 22]
    uuid = "dcd536f1674630f01fc9667bb202b851"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 浮空力比率 : {value0}%
    # REMOVE: data0 = [0, 129.25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 强化 - 后跳
# gunner_male/assault/2b340542e776818b78f3212af184bd6b
# afdf3b989339de478e85b614d274d1ef/2b340542e776818b78f3212af184bd6b
class Skill14(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 跃翔
# gunner_male/assault/1fea5a626f15230237946a11a9d11582
# afdf3b989339de478e85b614d274d1ef/1fea5a626f15230237946a11a9d11582
class Skill15(ActiveSkill):
    """
        增加自身20%的跳跃力， 效果持续一定时间。\n
        效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 烟尘弹
# gunner_male/assault/0dbdeaf846356f8b9380f8fbb8e97377
# afdf3b989339de478e85b614d274d1ef/0dbdeaf846356f8b9380f8fbb8e97377
class Skill16(ActiveSkill):
    """
        向敌人脚下的地面快速连续射击， 溅起尘土， 对敌人造成伤害。\n
        转职为合金战士后适用物理类型， 使用经过改造的自动手枪， 增加攻击范围。\n
        拔枪动作命中敌人时， 可将敌人击退。
    """
    name = "烟尘弹"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 6
    mp = [300, 322]
    uuid = "0dbdeaf846356f8b9380f8fbb8e97377"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 连续射击攻击力 : {value0}% x {value1}
    # REMOVE: data0 = [0, 1281, 1410, 1540, 1670, 1800, 1930, 2060, 2190, 2320, 2450, 2580, 2709, 2839, 2969, 3099, 3229, 3359, 3489, 3619, 3749, 3879, 4009, 4138, 4268, 4398, 4528, 4658, 4788, 4918, 5048, 5178, 5308, 5437, 5567, 5697, 5827, 5957, 6087, 6217, 6347, 6477, 6607, 6737, 6866, 6996, 7126, 7256, 7386, 7516, 7646, 7776, 7906, 8036, 8166, 8295, 8425, 8555, 8685, 8815, 8945, 9075, 9205, 9335, 9465, 9594, 9724, 9854, 9984, 10114, 10244]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [转职为合金战士时]
    # 连续射击攻击力 : {value2}% x {value3}
    # REMOVE: data2 = [0, 1059, 1167, 1274, 1382, 1489, 1597, 1704, 1812, 1919, 2027, 2134, 2242, 2349, 2456, 2564, 2671, 2779, 2886, 2994, 3101, 3209, 3316, 3424, 3531, 3639, 3746, 3854, 3961, 4069, 4176, 4283, 4391, 4498, 4606, 4713, 4821, 4928, 5036, 5143, 5251, 5358, 5466, 5573, 5681, 5788, 5896, 6003, 6110, 6218, 6325, 6433, 6540, 6648, 6755, 6863, 6970, 7078, 7185, 7293, 7400, 7508, 7615, 7723, 7830, 7938, 8045, 8152, 8260, 8367, 8475]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 6
    # REMOVE: data3 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # (转职为合金战士时不适用)

# 瞬踢
# gunner_male/assault/c9664191611af31142e052dfaef84530
# afdf3b989339de478e85b614d274d1ef/c9664191611af31142e052dfaef84530
class Skill17(ActiveSkill):
    """
        向前方敌人发出肉眼无法看清的快踢攻击， 可以击退敌人并有一定几率使其进入眩晕状态。
    """
    name = "瞬踢"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 4
    mp = [20, 238]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 踢击攻击力 : {value0}%
    # REMOVE: data0 = [0, 6774, 7461, 8148, 8836, 9523, 10210, 10897, 11585, 12272, 12959, 13646, 14333, 15021, 15708, 16395, 17082, 17769, 18457, 19144, 19831, 20518, 21206, 21893, 22580, 23267, 23954, 24642, 25329, 26016, 26703, 27391, 28078, 28765, 29452, 30139, 30827, 31514, 32201, 32888, 33575, 34263, 34950, 35637, 36324, 37012, 37699, 38386, 39073, 39760, 40448, 41135, 41822, 42509, 43197, 43884, 44571, 45258, 45945, 46633, 47320, 48007, 48694, 49381, 50069, 50756, 51443, 52130, 52818, 53505, 54192]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 发动速度增加率 : {value1}%
    # REMOVE: data1 = [0, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 72]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 击退时间比率 : {value2}%
    # REMOVE: data2 = [0, 156, 158, 160, 161, 163, 164, 167, 168, 170, 171, 173, 176, 177, 179, 180, 183, 186, 187, 189, 191, 192, 194, 196, 198, 199, 201, 203, 204, 207, 208, 210, 211, 213, 214, 217, 219, 220, 222, 223, 226, 227, 229, 230, 232, 236, 238, 239, 241, 242, 244, 247, 248, 250, 251, 253, 254, 257, 258, 260, 262, 263, 266, 267, 269, 270, 272, 273, 276, 278, 281]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 眩晕几率 : {value3}%
    # REMOVE: data3 = [0, 10, 10.7, 11.4, 12.1, 12.8, 13.4, 14.1, 14.8, 15.5, 16.2, 16.9, 17.6, 18.3, 19, 19.7, 20.3, 21, 21.7, 22.4, 23.1, 23.8, 24.5, 25.2, 25.9, 26.6, 27.2, 27.9, 28.6, 29.3, 30, 30.7, 31.4, 32.1, 32.8, 33.4, 34.1, 34.8, 35.5, 36.2, 36.9, 37.6, 38.3, 39, 39.7, 40.3, 41, 41.7, 42.4, 43.1, 43.8, 44.5, 45.2, 45.9, 46.6, 47.2, 47.9, 48.6, 49.3, 50, 50.7, 51.4, 52.1, 52.8, 53.4, 54.1, 54.8, 55.5, 56.2, 56.9, 57.6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 眩晕持续时间 : {value4}秒
    # REMOVE: data4 = [0, 1, 1.05, 1.1, 1.15, 1.2, 1.25, 1.31, 1.36, 1.41, 1.46, 1.51, 1.56, 1.62, 1.67, 1.72, 1.77, 1.82, 1.87, 1.93, 1.98, 2.03, 2.08, 2.13, 2.19, 2.24, 2.29, 2.34, 2.39, 2.44, 2.5, 2.55, 2.6, 2.65, 2.7, 2.75, 2.81, 2.86, 2.91, 2.96, 3.01, 3.06, 3.12, 3.17, 3.22, 3.27, 3.32, 3.37, 3.43, 3.48, 3.53, 3.58, 3.63, 3.69, 3.74, 3.79, 3.84, 3.89, 3.94, 4, 4.05, 4.1, 4.15, 4.2, 4.25, 4.31, 4.36, 4.41, 4.46, 4.51, 4.56]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

# 空中射击
# gunner_male/assault/bb34e8854a93fd250347a1c64119f7ab
# afdf3b989339de478e85b614d274d1ef/bb34e8854a93fd250347a1c64119f7ab
class Skill18(ActiveSkill):
    """
        增加跳跃攻击的空中停留时间以及跳跃射击的攻击力和射击次数上限， 效果持续一定时间。
    """
    name = "空中射击"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 10 #TODO
    rangeLv = 3
    cd = 40
    mp = [22, 119]
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 空中射击攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 增加发射子弹数上限 : 左轮枪{value2}发、 自动手枪{value3}发、 步枪{value4}发、 手炮{value5}发、 手弩{value6}发
    # REMOVE: data2 = [0, 4, 4, 5, 5, 6, 6, 7, 7, 7, 8, 8, 9, 9, 9, 10, 10, 11, 11, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # REMOVE: data3 = [0, 6, 7, 7, 8, 9, 9, 10, 10, 11, 12, 12, 13, 14, 14, 15, 15, 16, 17, 17, 18]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # REMOVE: data4 = [0, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11, 12, 12]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # REMOVE: data5 = [0, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # REMOVE: data6 = [0, 5, 6, 6, 6, 7, 8, 8, 8, 9, 10, 10, 11, 11, 12, 12, 13, 13, 14, 14, 15]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

# 合金战士自动手枪精通
# gunner_male/assault/af9e4260178303f3f2f267dded09856b
# afdf3b989339de478e85b614d274d1ef/af9e4260178303f3f2f267dded09856b
class Skill19(PassiveSkill):
    """
        增加物理攻击力。 装备自动手枪时， 增加命中率。
    """
    name = "合金战士自动手枪精通"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    uuid = "af9e4260178303f3f2f267dded09856b"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [자동권총 장착 시]
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"type":"$*PAtkP","data":data0}]

# 瞄准射击
# gunner_male/assault/b3ba5c678595305d31dcb11a8350971b
# afdf3b989339de478e85b614d274d1ef/b3ba5c678595305d31dcb11a8350971b
class Skill20(ActiveSkill):
    """
        在改造型自动手枪上附加步枪组件， 将其扛在肩上向前方射击。\n
        拔枪动作命中敌人时， 可将敌人击退。\n
        步枪射击攻击力受[基础精通]影响。
    """
    name = "瞄准射击"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 2
    cd = 3
    mp = [199, 199]
    uuid = "b3ba5c678595305d31dcb11a8350971b"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 步枪射击攻击力 : {value0}%
    # REMOVE: data0 = [0, 181]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 7
    # 步枪射击多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)


# 暴击
# gunner_male/assault/fc1262c19f3d0477ee8eda47b8db8696
# afdf3b989339de478e85b614d274d1ef/fc1262c19f3d0477ee8eda47b8db8696
class Skill21(PassiveSkill):
    """
        集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 弱点扫描
# gunner_male/assault/0495ac9e1153f8a21866c9ba2262cce6
# afdf3b989339de478e85b614d274d1ef/0495ac9e1153f8a21866c9ba2262cce6
class Skill22(PassiveSkill):
    """
        进入地下城后， 利用得到改造机械眼扫描该地区， 掌握敌人的弱点。\n
        增加基本攻击力、 转职技能攻击力和物理暴击率。
    """
    name = "弱点扫描"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "0495ac9e1153f8a21866c9ba2262cce6"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 物理暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 改装榴弹
# gunner_male/assault/67f4b84ed61ee86f505a852b202762a0
# afdf3b989339de478e85b614d274d1ef/67f4b84ed61ee86f505a852b202762a0
class Skill23(ActiveSkill):
    """
        在改造型自动手枪上附加榴弹组件， 然后将其扛在肩上发射榴弹。\n
        榴弹飞行一定距离后爆炸； 若飞行途中碰到敌人， 则立即爆炸。\n
        拔枪动作命中敌人时， 可将敌人击退。
    """
    name = "改装榴弹"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 6
    mp = [30, 315]
    uuid = "67f4b84ed61ee86f505a852b202762a0"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 榴弹爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 6484, 7142, 7800, 8457, 9115, 9773, 10431, 11089, 11746, 12404, 13062, 13720, 14378, 15035, 15693, 16351, 17009, 17667, 18324, 18982, 19640, 20298, 20956, 21613, 22271, 22929, 23587, 24245, 24902, 25560, 26218, 26876, 27534, 28191, 28849, 29507, 30165, 30822, 31480, 32138, 32796, 33454, 34111, 34769, 35427, 36085, 36743, 37400, 38058, 38716, 39374, 40032, 40689, 41347, 42005, 42663, 43321, 43978, 44636, 45294, 45952, 46610, 47267, 47925, 48583, 49241, 49899, 50556, 51214, 51872]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # [范围信息]
    # 爆炸大小比率 : {value1}%
    # REMOVE: data1 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 枪托强击
# gunner_male/assault/6a949de7a2aaf742b1abfb7872fc85e2
# afdf3b989339de478e85b614d274d1ef/6a949de7a2aaf742b1abfb7872fc85e2
class Skill24(ActiveSkill):
    """
        挥动改造型自动手枪的枪托攻击敌人， 命中时将敌人击退并强制控制一定时间。
    """
    name = "枪托强击"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 8
    mp = [30, 315]
    uuid = "6a949de7a2aaf742b1abfb7872fc85e2"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 枪托攻击力 : {value0}%
    # REMOVE: data0 = [0, 10746, 11836, 12926, 14017, 15107, 16197, 17287, 18377, 19467, 20558, 21648, 22738, 23828, 24918, 26008, 27099, 28189, 29279, 30369, 31459, 32549, 33640, 34730, 35820, 36910, 38000, 39091, 40181, 41271, 42361, 43451, 44541, 45632, 46722, 47812, 48902, 49992, 51082, 52173, 53263, 54353, 55443, 56533, 57623, 58714, 59804, 60894, 61984, 63074, 64165, 65255, 66345, 67435, 68525, 69615, 70706, 71796, 72886, 73976, 75066, 76156, 77247, 78337, 79427, 80517, 81607, 82697, 83788, 84878, 85968]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 强制控制持续时间 : {value1}秒
    # REMOVE: data1 = [0, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 快速拔枪
# gunner_male/assault/45442bbbe33540b4deeec29437dae70c
# afdf3b989339de478e85b614d274d1ef/45442bbbe33540b4deeec29437dae70c
class Skill25(PassiveSkill):
    """
        快速拔枪攻击敌人， 发动后可以增加攻击速度和普通射击的攻击力。 转职为漫游枪手后增加精通等级。
    """
    name = "快速拔枪"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 10 #TODO
    rangeLv = 3
    uuid = "45442bbbe33540b4deeec29437dae70c"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 拔枪速度增加 : {value0}%
    # REMOVE: data0 = [0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 普通射击的攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击速度增加 : {value2}%
    # REMOVE: data2 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 超频 : 重盾保卫
# gunner_male/assault/e52d867ddb2f7acf616611f32cea2b6f
# afdf3b989339de478e85b614d274d1ef/e52d867ddb2f7acf616611f32cea2b6f
class Skill26(ActiveSkill):
    """
        解除改造机械肩的限制， 瞬间砸落重型压制盾牌。\n
        盾牌持续时间内， 在保护区域内时进入霸体状态， 并减少所受伤害。\n
        合金战士发动多个所受伤害减少效果时， 仅适用效果最高的1种。
    """
    name = "超频 : 重盾保卫"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 12
    mp = [43, 451]
    uuid = "e52d867ddb2f7acf616611f32cea2b6f"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 盾牌持续时间 : {value0}秒
    # REMOVE: data0 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 盾牌保护区域所受伤害减少率 : {value1}%
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 盾牌攻击力 : {value2}%
    # REMOVE: data2 = [0, 14691, 16181, 17672, 19162, 20653, 22143, 23633, 25124, 26614, 28105, 29595, 31085, 32576, 34066, 35556, 37047, 38537, 40028, 41518, 43008, 44499, 45989, 47480, 48970, 50460, 51951, 53441, 54932, 56422, 57912, 59403, 60893, 62384, 63874, 65364, 66855, 68345, 69835, 71326, 72816, 74307, 75797, 77287, 78778, 80268, 81759, 83249, 84739, 86230, 87720, 89211, 90701, 92191, 93682, 95172, 96663, 98153, 99643, 101134, 102624, 104114, 105605, 107095, 108586, 110076, 111566, 113057, 114547, 116038, 117528]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # [范围信息]
    # 盾牌大小比率 : {value3}%
    # REMOVE: data3 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 心脏驱动
# gunner_male/assault/c9603b05632f362bb23cae18374e37cf
# afdf3b989339de478e85b614d274d1ef/c9603b05632f362bb23cae18374e37cf
class Skill27(ActiveSkill):
    """
        激活人工心脏， 强化改造躯体。\n
        增加基本攻击力和转职技能的攻击力、 攻击速度和移动速度。
    """
    name = "心脏驱动"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    cd = 5
    uuid = "c9603b05632f362bb23cae18374e37cf"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 基本攻击力和转职技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 攻击速度增加 : {value2}%
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 移动速度增加 : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 改造烟尘弹
# gunner_male/assault/f3d425f6b8186f9b170fd1aab778fa0d
# afdf3b989339de478e85b614d274d1ef/f3d425f6b8186f9b170fd1aab778fa0d
class Skill28(PassiveSkill):
    """
        改造[烟尘弹]射击时使用的子弹， 附加爆炸功能。\n
        增加[烟尘弹]的攻击力和攻击范围。
    """
    name = "改造烟尘弹"
    learnLv = 25
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 3
    uuid = "f3d425f6b8186f9b170fd1aab778fa0d"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # [烟尘弹]攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 26]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 攻击范围比率 : {value1}%
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage","Skills":["烟尘弹"]} ] 

# 三连霰弹
# gunner_male/assault/e7e39aa9fcf182c8db543235c8af7dac
# afdf3b989339de478e85b614d274d1ef/e7e39aa9fcf182c8db543235c8af7dac
class Skill29(ActiveSkill):
    """
        在改造型自动手枪上附加霰弹枪组件， 将其扛在肩上向前方连续射击3次。\n
        拔枪动作命中敌人时， 可将敌人击退。
    """
    name = "三连霰弹"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 8
    mp = [57, 598]
    uuid = "e7e39aa9fcf182c8db543235c8af7dac"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 霰弹枪第1次射击攻击力 : {value0}%
    # REMOVE: data0 = [0, 2097, 2310, 2523, 2735, 2948, 3161, 3374, 3587, 3799, 4012, 4225, 4438, 4650, 4863, 5076, 5289, 5501, 5714, 5927, 6140, 6352, 6565, 6778, 6991, 7203, 7416, 7629, 7842, 8054, 8267, 8480, 8693, 8906, 9118, 9331, 9544, 9757, 9969, 10182, 10395, 10608, 10820, 11033, 11246, 11459, 11671, 11884, 12097, 12310, 12522, 12735, 12948, 13161, 13373, 13586, 13799, 14012, 14224, 14437, 14650, 14863, 15076, 15288, 15501, 15714, 15927, 16139, 16352, 16565, 16778]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 霰弹枪第2次射击攻击力 : {value1}%
    # REMOVE: data1 = [0, 3146, 3465, 3784, 4103, 4422, 4741, 5061, 5380, 5699, 6018, 6337, 6656, 6975, 7295, 7614, 7933, 8252, 8571, 8890, 9209, 9529, 9848, 10167, 10486, 10805, 11124, 11443, 11763, 12082, 12401, 12720, 13039, 13358, 13677, 13997, 14316, 14635, 14954, 15273, 15592, 15911, 16231, 16550, 16869, 17188, 17507, 17826, 18145, 18464, 18784, 19103, 19422, 19741, 20060, 20379, 20698, 21018, 21337, 21656, 21975, 22294, 22613, 22932, 23252, 23571, 23890, 24209, 24528, 24847, 25166]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 霰弹枪第3次射击攻击力 : {value2}%
    # REMOVE: data2 = [0, 5243, 5775, 6307, 6839, 7371, 7902, 8434, 8966, 9498, 10030, 10562, 11094, 11626, 12158, 12690, 13221, 13753, 14285, 14817, 15349, 15881, 16413, 16945, 17477, 18009, 18540, 19072, 19604, 20136, 20668, 21200, 21732, 22264, 22796, 23328, 23859, 24391, 24923, 25455, 25987, 26519, 27051, 27583, 28115, 28647, 29178, 29710, 30242, 30774, 31306, 31838, 32370, 32902, 33434, 33966, 34497, 35029, 35561, 36093, 36625, 37157, 37689, 38221, 38753, 39285, 39816, 40348, 40880, 41412, 41944]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1

# 磁力手雷
# gunner_male/assault/14c573777542b4ee3cdca35501b06c97
# afdf3b989339de478e85b614d274d1ef/14c573777542b4ee3cdca35501b06c97
class Skill30(ActiveSkill):
    """
        投掷利用强力磁性物质“钕”制造的手雷。\n
        车轮形态的手雷向前滚动的同时在地面铺设组件， 形成强大的磁场吸附敌人。\n
        手雷滚动到尽头时组件全部展开后引发爆炸。
    """
    name = "磁力手雷"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 12
    mp = [122, 1024]
    uuid = "14c573777542b4ee3cdca35501b06c97"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 钕爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 4397, 4843, 5290, 5736, 6182, 6628, 7074, 7520, 7966, 8412, 8858, 9305, 9751, 10197, 10643, 11089, 11535, 11981, 12427, 12873, 13319, 13766, 14212, 14658, 15104, 15550, 15996, 16442, 16888, 17334, 17781, 18227, 18673, 19119, 19565, 20011, 20457, 20903, 21349, 21795, 22242, 22688, 23134, 23580, 24026, 24472, 24918, 25364, 25810, 26257, 26703, 27149, 27595, 28041, 28487, 28933, 29379, 29825, 30271, 30718, 31164, 31610, 32056, 32502, 32948, 33394, 33840, 34286, 34733, 35179]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 3
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 钕爆炸大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 超频 : 机械冲撞
# gunner_male/assault/8d8981a94b8bdd4e3ffad5bc05042080
# afdf3b989339de478e85b614d274d1ef/8d8981a94b8bdd4e3ffad5bc05042080
class Skill31(ActiveSkill):
    """
        该技能可以在攻击敌人后一定时间内发动。\n
        在一定范围内击中过的敌人中， 追踪并用肩部撞击其中最强大的敌人。 然后， 利用后坐力向后退， 并发射机械臂上装备的炮筒。
    """
    name = "超频 : 机械冲撞"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 13
    mp = [122, 1024]
    uuid = "8d8981a94b8bdd4e3ffad5bc05042080"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 技能激活时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 撞击攻击力 : {value1}%
    # REMOVE: data1 = [0, 9928, 10935, 11942, 12949, 13956, 14963, 15970, 16978, 17985, 18992, 19999, 21006, 22013, 23021, 24028, 25035, 26042, 27049, 28056, 29063, 30071, 31078, 32085, 33092, 34099, 35106, 36113, 37121, 38128, 39135, 40142, 41149, 42156, 43163, 44171, 45178, 46185, 47192, 48199, 49206, 50214, 51221, 52228, 53235, 54242, 55249, 56256, 57264, 58271, 59278, 60285, 61292, 62299, 63306, 64314, 65321, 66328, 67335, 68342, 69349, 70356, 71364, 72371, 73378, 74385, 75392, 76399, 77407, 78414, 79421]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 1
    # 机械炮攻击力 : {value2}%
    # REMOVE: data2 = [0, 6618, 7290, 7961, 8633, 9304, 9976, 10647, 11318, 11990, 12661, 13333, 14004, 14676, 15347, 16018, 16690, 17361, 18033, 18704, 19376, 20047, 20718, 21390, 22061, 22733, 23404, 24076, 24747, 25418, 26090, 26761, 27433, 28104, 28776, 29447, 30119, 30790, 31461, 32133, 32804, 33476, 34147, 34819, 35490, 36161, 36833, 37504, 38176, 38847, 39519, 40190, 40861, 41533, 42204, 42876, 43547, 44219, 44890, 45561, 46233, 46904, 47576, 48247, 48919, 49590, 50261, 50933, 51604, 52276, 52947]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # [范围信息]
    # 锁定范围 : {value3}px
    # REMOVE: data3 = [0, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750, 750]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [超频 : 机械冲撞]\n
        删除机械炮攻击\n
        - 总攻击力相同\n
        不攻击时也可使用\n
        锁定范围 +20%
        """
        ...

    def vp_2(self):
        """
        [超频 : 机械冲撞]\n
        基本冷却时间变更为9.1秒\n
        - 总攻击力 -30%\n
        命中时， 获得速度增加增益\n
        - 增益持续时间 : 10秒\n
        - 攻击速度 +10%
        """
        self.cd = 9.1
        self.skillRation *= 0.7

# 爆裂飞踢
# gunner_male/assault/6bbf76bcd2ed3ca25f21b760db4342ad
# afdf3b989339de478e85b614d274d1ef/6bbf76bcd2ed3ca25f21b760db4342ad
class Skill32(ActiveSkill):
    """
        踢飞爆裂飞弹。\n
        炸弹飞出后嵌入地面， 引发冲击波； 然后炸弹内的弹药四溅， 引发连锁爆炸。
    """
    name = "爆裂飞踢"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [122, 1024]
    uuid = "6bbf76bcd2ed3ca25f21b760db4342ad"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 5862, 6456, 7051, 7646, 8240, 8835, 9430, 10024, 10619, 11213, 11808, 12403, 12997, 13592, 14187, 14781, 15376, 15971, 16565, 17160, 17755, 18349, 18944, 19539, 20133, 20728, 21323, 21917, 22512, 23107, 23701, 24296, 24891, 25485, 26080, 26675, 27269, 27864, 28458, 29053, 29648, 30242, 30837, 31432, 32026, 32621, 33216, 33810, 34405, 35000, 35594, 36189, 36784, 37378, 37973, 38568, 39162, 39757, 40352, 40946, 41541, 42136, 42730, 43325, 43920, 44514, 45109, 45703, 46298, 46893]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 2198, 2421, 2644, 2867, 3090, 3313, 3536, 3759, 3982, 4205, 4428, 4651, 4874, 5097, 5320, 5543, 5766, 5989, 6212, 6435, 6658, 6881, 7104, 7327, 7550, 7773, 7996, 8219, 8442, 8665, 8888, 9111, 9334, 9557, 9780, 10003, 10226, 10449, 10672, 10895, 11118, 11341, 11564, 11787, 12010, 12233, 12456, 12679, 12902, 13125, 13348, 13571, 13794, 14017, 14240, 14463, 14686, 14909, 15132, 15355, 15578, 15801, 16024, 16247, 16470, 16693, 16916, 17139, 17362, 17585]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 4
    # 爆炸多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 冲击波大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 爆炸大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

    def vp_1(self):
        """
        [爆裂飞踢]\n
        基本冷却时间变更为30秒\n
        总攻击力 +100%\n
        冲击波及爆炸范围 +30%
        """
        self.cd = 30
        self.skillRation *= 2

    def vp_2(self):
        """
        [爆裂飞踢]\n
        解除改造机械腿的限制后， 用脚踢飞爆裂飞弹\n
        - 变更为超频系列技能\n
        - 搭乘步行者时无法使用\n
        - 电弧能量条充能量 : 30%\n
        命中时， 强制控制1.5秒
        """
        ...

# 战略轰炸
# gunner_male/assault/653b35b5b59d29daffca47df43b2b0e3
# afdf3b989339de478e85b614d274d1ef/653b35b5b59d29daffca47df43b2b0e3
class Skill33(ActiveSkill):
    """
        原地起跳， 向地面连续发射榴弹， 下落时向周围投掷手榴弹引发爆炸。\n
        按前方向键， 可向前方跳跃。
    """
    name = "战略轰炸"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [162, 1360]
    uuid = "653b35b5b59d29daffca47df43b2b0e3"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 榴弹爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 3451, 3801, 4151, 4502, 4852, 5202, 5552, 5902, 6252, 6602, 6952, 7303, 7653, 8003, 8353, 8703, 9053, 9403, 9753, 10104, 10454, 10804, 11154, 11504, 11854, 12204, 12554, 12904, 13255, 13605, 13955, 14305, 14655, 15005, 15355, 15705, 16056, 16406, 16756, 17106, 17456, 17806, 18156, 18506, 18857, 19207, 19557, 19907, 20257, 20607, 20957, 21307, 21658, 22008, 22358, 22708, 23058, 23408, 23758, 24108, 24459, 24809, 25159, 25509, 25859, 26209, 26559, 26909, 27259, 27610]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 3
    # 榴弹爆炸多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 手榴弹爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 5177, 5702, 6227, 6752, 7278, 7803, 8328, 8853, 9378, 9903, 10429, 10954, 11479, 12004, 12529, 13055, 13580, 14105, 14630, 15155, 15680, 16206, 16731, 17256, 17781, 18306, 18832, 19357, 19882, 20407, 20932, 21457, 21983, 22508, 23033, 23558, 24083, 24609, 25134, 25659, 26184, 26709, 27234, 27760, 28285, 28810, 29335, 29860, 30386, 30911, 31436, 31961, 32486, 33011, 33537, 34062, 34587, 35112, 35637, 36163, 36688, 37213, 37738, 38263, 38788, 39314, 39839, 40364, 40889, 41414]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 3
    # 手榴弹爆炸多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [战略轰炸]\n
        变更为在地面上向前方发射榴弹的技能\n
        - 施放速度 +20%\n
        - 榴弹多段攻击次数 +2次\n
        - 总攻击力相同\n
        施放过程中所受伤害 -90%\n
        可以在空中施放
        """
        ...

    def vp_2(self):
        """
        [战略轰炸]\n
        删除投掷手榴弹， 并改为搭乘步行者时可使用的技能\n
        - 总攻击力 -30%\n
        - 搭乘步行者时冷却时间 -30%
        """
        self.skillRation *= 0.7

# 雷达扫射
# gunner_male/assault/4b22172f4e00d9735ff44d333a86653d
# afdf3b989339de478e85b614d274d1ef/4b22172f4e00d9735ff44d333a86653d
class Skill34(ActiveSkill):
    """
        启动改造机械眼， 扫描前方， 然后向锁定的敌人进行精准射击。\n
        若识别敌人失败， 则剩余冷却时间减少为5秒。
    """
    name = "雷达扫射"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [285, 2394]
    uuid = "4b22172f4e00d9735ff44d333a86653d"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 识别敌人失败时冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 锁定射击攻击力 : {value1}%
    # REMOVE: data1 = [0, 2614, 2879, 3144, 3410, 3675, 3940, 4205, 4470, 4736, 5001, 5266, 5531, 5796, 6061, 6327, 6592, 6857, 7122, 7387, 7653, 7918, 8183, 8448, 8713, 8979, 9244, 9509, 9774, 10039, 10304, 10570, 10835, 11100, 11365, 11630, 11896, 12161, 12426, 12691, 12956, 13222, 13487, 13752, 14017, 14282, 14547, 14813, 15078, 15343, 15608, 15873, 16139, 16404, 16669, 16934, 17199, 17465, 17730, 17995, 18260, 18525, 18790, 19056, 19321, 19586, 19851, 20116, 20382, 20647, 20912]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 15
    # 锁定射击多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 可锁定敌人数量上限 : {value3}
    # REMOVE: data3 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 识别敌人距离 : {value4}px
    # REMOVE: data4 = [0, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 识别敌人范围 : {value5}px
    # REMOVE: data5 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 识别敌人高度 : {value6}px
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

    def vp_1(self):
        """
        [雷达扫射]\n
        施放时进入无敌状态\n
        识别范围大幅增加\n
        - 识别距离 +180% (包括后方探测)\n
        - 识别宽度 +100%\n
        - 识别高度 +200%
        """
        ...

    def vp_2(self):
        """
        [雷达扫射]\n
        锁定射击次数 -5次\n
        - 总攻击力相同\n
        每次[锁定射击]都会合算[瞄准射击]攻击力\n
        - 无法使用[瞄准射击]
        """
        ...

# 机体复原
# gunner_male/assault/808a54f780205020087d5818cb5f8559
# afdf3b989339de478e85b614d274d1ef/808a54f780205020087d5818cb5f8559
class Skill35(PassiveSkill):
    """
        钢铁之心恢复过去的记忆， 部分复原吉赛尔的技术， 可以轻而易举地执行危险而艰巨的任务。\n
        增加基本攻击力、 转职技能的攻击力和物理暴击率。
    """
    name = "机体复原"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "808a54f780205020087d5818cb5f8559"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 物理暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# 电弧能量释放
# gunner_male/assault/fa7f1a3dc90600456cbe010e5714bef3
# afdf3b989339de478e85b614d274d1ef/fa7f1a3dc90600456cbe010e5714bef3
class Skill36(ActiveSkill):
    """
        启动钢铁之心的核心功能——电弧能量释放系统。\n
        超频系列技能成功命中敌人时， 可以将电弧能量储存在身体内。\n
        释放时， 从人工心脏中发射强力电弧能量， 攻击范围内的敌人。\n
        电弧能量完全充满后可以使用释放功能， 可以在转职技能施放过程中使用。 (部分技能除外)\n
        不同技能可释放电弧能量的时间点不同。\n
    [无法释放电弧能量的技能]\n
    [心脏驱动]、 [磁力手雷]、 [堡垒轰击]、 [AT-SO步行者]、 [步行者中止指令]\n
    [电弧能量充能值]\n
    [超频 : 压制] : 20%\n
    [超频 : 重盾保卫] : 30%\n
    [超频 : 机械冲撞] : 30%\n
    [超频 : 电流闪踢] : 50%\n
    [超频 : 音速瞬杀] : 70%\n
    [超频 : 全领域攻击] : 充满\n
    [超频 : 伊奎利斯-MR] : 充满\n
    [超频 : 末世终结之战] : 充满
    """
    name = "电弧能量释放"
    learnLv = 48
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 2
    uuid = "fa7f1a3dc90600456cbe010e5714bef3"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 电弧能量释放攻击力 : {value0}%
    # REMOVE: data0 = [0, 46930]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1

# 超频 : 全领域攻击
# gunner_male/assault/a550756080900cb01f29db11ef4f05fa
# afdf3b989339de478e85b614d274d1ef/a550756080900cb01f29db11ef4f05fa
class Skill37(ActiveSkill):
    """
        使人工心脏超负荷运转， 完全释放强化型机械腿组件的力量。\n
        向前方瞬移并投掷手榴弹， 然后转身发射榴弹， 引发连锁反应， 与手榴弹一起爆炸。\n
        切换为霰弹枪武器， 升起爆炸烟雾时向四周快速移动射击， 安装电流增幅装置后， 回到最初的位置。\n
        将电流凝聚到腿部组件后， 用脚发动增幅装置， 引发电流爆炸。\n
        觉醒技能是强力超频技能， 需消耗大量能量， 因此无法中断施放后僵直。
    """
    name = "超频 : 全领域攻击"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [1065, 8946]
    uuid = "a550756080900cb01f29db11ef4f05fa"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 榴弹爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 9549, 11763, 13978, 16192, 18406, 20621, 22835, 25049, 27263, 29478, 31692, 33906, 36121, 38335, 40549, 42763, 44978, 47192, 49406, 51620, 53835, 56049, 58263, 60478, 62692, 64906, 67120, 69335, 71549, 73763, 75978, 78192, 80406, 82620, 84835, 87049, 89263, 91478, 93692, 95906, 98120, 100335, 102549, 104763, 106978, 109192, 111406, 113620, 115835, 118049]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 手榴弹爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 4775, 5882, 6989, 8096, 9203, 10310, 11417, 12525, 13632, 14739, 15846, 16953, 18060, 19167, 20275, 21382, 22489, 23596, 24703, 25810, 26917, 28025, 29132, 30239, 31346, 32453, 33560, 34667, 35775, 36882, 37989, 39096, 40203, 41310, 42417, 43525, 44632, 45739, 46846, 47953, 49060, 50167, 51275, 52382, 53489, 54596, 55703, 56810, 57917, 59025]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 4
    # 手榴弹爆炸多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 霰弹枪射击攻击力 : {value3}%
    # REMOVE: data3 = [0, 4775, 5882, 6989, 8096, 9203, 10310, 11417, 12525, 13632, 14739, 15846, 16953, 18060, 19167, 20275, 21382, 22489, 23596, 24703, 25810, 26917, 28025, 29132, 30239, 31346, 32453, 33560, 34667, 35775, 36882, 37989, 39096, 40203, 41310, 42417, 43525, 44632, 45739, 46846, 47953, 49060, 50167, 51275, 52382, 53489, 54596, 55703, 56810, 57917, 59025]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 4
    # 霰弹枪射击多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 电流爆炸攻击力 : {value5}%
    # REMOVE: data5 = [0, 47746, 58817, 69888, 80960, 92031, 103103, 114174, 125245, 136317, 147388, 158460, 169531, 180603, 191674, 202745, 213817, 224888, 235960, 247031, 258102, 269174, 280245, 291317, 302388, 313460, 324531, 335602, 346674, 357745, 368817, 379888, 390960, 402031, 413102, 424174, 435245, 446317, 457388, 468459, 479531, 490602, 501674, 512745, 523817, 534888, 545959, 557031, 568102, 579174, 590245]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 1

# 超频 : 电流闪踢
# gunner_male/assault/96b90d633d54701fd287421e580268ff
# afdf3b989339de478e85b614d274d1ef/96b90d633d54701fd287421e580268ff
class Skill38(ActiveSkill):
    """
        解除强化型改造机械腿的限制， 瞬间集中力量后用力踢击， 引发电流冲击波。
    """
    name = "超频 : 电流闪踢"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [356, 996]
    uuid = "96b90d633d54701fd287421e580268ff"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 电流冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 36747, 40475, 44203, 47931, 51659, 55387, 59115, 62843, 66571, 70299, 74027, 77755, 81482, 85210, 88938, 92666, 96394, 100122, 103850, 107578, 111306, 115034, 118762, 122490, 126218, 129946, 133674, 137402, 141130, 144858, 148586, 152314, 156042, 159770, 163498, 167225, 170953, 174681, 178409, 182137, 185865, 189593, 193321, 197049, 200777, 204505, 208233, 211961, 215689, 219417]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # [范围信息]
    # 电流冲击波大小比率 : {value1}%
    # REMOVE: data1 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    def vp_1(self):
        """
        [超频 : 电流闪踢]\n
        施放时， 移动到范围内最强敌人的位置后发动踢击\n
        命中时， 强控2秒
        """
        ...

    def vp_2(self):
        """
        [超频 : 电流闪踢]\n
        强化型改造机械腿蓄力时间增加\n
        - 命中时， 电弧能量充满后自动放电\n
        电流冲击波大小 +30%
        """
        ...

# 堡垒轰击
# gunner_male/assault/832b6196a59cbc1150d167b1b9d91c90
# afdf3b989339de478e85b614d274d1ef/832b6196a59cbc1150d167b1b9d91c90
class Skill39(ActiveSkill):
    """
        向空中发射信号弹， 召唤强化型压制盾牌。\n
        从空中飞来的盾牌迅速落在钢铁之心面前， 将周围的敌人推到前方， 然后用搭载的机关枪进行射击。\n
        射击结束后， 盾牌爆炸并消失。\n
        盾牌持续时间内， 在保护区域内时进入霸体状态， 并减少所受伤害。\n
        钢铁之心发动多个所受伤害减少效果时， 仅适用效果最高的1种。\n
        射击期间， 若盾牌被破坏， 则保护领域消失。\n
        盾牌的生命值和防御力为角色数值的一定比例。
    """
    name = "堡垒轰击"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [732, 1537]
    uuid = "832b6196a59cbc1150d167b1b9d91c90"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 盾牌保护区域所受伤害减少率 : {value0}%
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 机关枪射击攻击力 : {value1}%
    # REMOVE: data1 = [0, 3151, 3470, 3790, 4110, 4429, 4749, 5069, 5388, 5708, 6027, 6347, 6667, 6986, 7306, 7626, 7945, 8265, 8585, 8904, 9224, 9544, 9863, 10183, 10502, 10822, 11142, 11461, 11781, 12101, 12420, 12740, 13060, 13379, 13699, 14018, 14338, 14658, 14977, 15297, 15617, 15936, 16256, 16576, 16895, 17215, 17535, 17854, 18174, 18493, 18813]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 30
    # 机关枪射击多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 盾牌生命值 : 角色生命值的{value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 盾牌防御力 : 角色防御力的{value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # [范围信息]
    # 盾牌大小比率 : {value5}%
    # REMOVE: data5 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [堡垒轰击]\n
        盾牌不会被破坏\n
        - 机关枪射击结束后盾牌持续时间 +3秒\n
        - 盾牌保护区域所受伤害额外 -20%\n
        盾牌大小 +30%
        """
        ...

    def vp_2(self):
        """
        [堡垒轰击]\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 25秒\n
        - 机关枪射击多段攻击次数 -15次\n
        - 单次攻击力 -50%
        """
        self.cd = 25
        self.skillRation *= 0.5

# 躯体重塑
# gunner_male/assault/b95d9f6fc90f067c43da96dc1e861f28
# afdf3b989339de478e85b614d274d1ef/b95d9f6fc90f067c43da96dc1e861f28
class Skill40(PassiveSkill):
    """
        利用七神之鞘翅的梅尔文的技术成功消除不稳定的危险因素， 并且重塑躯体， 获得更强大的火力。\n
        增加基本攻击力和转职技能攻击力， 变更部分技能效果。\n
        [超频 : 压制]\n
        可在地面被击状态下施放。\n
        [超频 : 重盾保卫]\n
        强化耐久性， 增加盾牌大小、 持续时间和伤害减少效果。\n
        [焕然新生的感觉不错吧？  --梅尔文]
    """
    name = "躯体重塑"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "b95d9f6fc90f067c43da96dc1e861f28"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [超频 ： 重盾保卫]
    # 盾牌大小增加 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 盾牌持续时间增加 : {value2}秒
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 盾牌保护区域伤害减少效果增加率 : {value3}%
    # REMOVE: data3 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    associate = [ {"data":data0,"type":"*skillDamage"}]

# AT-SO步行者
# gunner_male/assault/50a859dea1a48a2f60916afbfc91434f
# afdf3b989339de478e85b614d274d1ef/50a859dea1a48a2f60916afbfc91434f
class Skill41(ActiveSkill):
    """
        梅尔文罕见地集中精力工作几天几夜打造出的优秀作品。\n
        弥补了旧版本步行者的缺点， 并附加全新功能， 成功制造出超能终结者专属特殊兵器“AT-SO步行者”。\n
        发射信号弹， 呼叫步行者。\n
        步行者在持续时间内跟随超能终结者， 当周围存在敌人时， 自动进行射击。\n
        持续时间结束时， 步行者被破坏并消失。\n
    [步行者搭乘信息]\n
        呼叫出步行者的状态下， 再次按技能键即可搭乘步行者。\n
        搭乘时进入无敌状态。\n
        搭乘时， 可以强制中断转职技能的施放后僵直并立即使用。 (与无法强制中断超频系列施放后僵直的技能相同)\n
    [步行者解除搭乘信息]\n
        搭乘期间， 再次按技能键或搭乘持续时间结束时， 解除搭乘状态并进入无敌状态。\n
        解除搭乘状态时， 可以强制中断动作并施放转职技能。\n
    [步行者搭乘时信息]\n
        可以直接进行操作， 可移动、 冲刺、 跳跃和2段跳。\n
        可以在地面和空中进行机关枪射击， 也可以使用部分技能。\n
        减少可使用技能的冷却时间， 使用技能时攻击力与原技能相同。\n
        移动速度增加50%， 进入霸体状态。\n
        减少所受伤害并增加异常状态抗性。\n
        超能终结者发动多个所受伤害减少效果时， 仅适用效果最高的1种。\n
        无法使用投掷类道具。\n
    [搭乘期间可使用的技能列表]\n
        [瞄准射击]、 [改装榴弹]、 [磁力手雷]、 [三连霰弹]、 [爆裂飞踢]、 [雷达扫射]\n
    [快搭乘试试， 体验感是不是好极了？  --梅尔文]
    """
    name = "AT-SO步行者"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [606, 4696]
    uuid = "50a859dea1a48a2f60916afbfc91434f"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 步行者持续时间 : {value0}秒
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 搭乘次数上限 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 搭乘步行者后无敌状态持续时间 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 解除搭乘步行者后无敌状态持续时间 : {value3}秒
    # REMOVE: data3 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [步行者攻击信息]
    # 自动射击攻击力 : {value4}%
    # REMOVE: data4 = [0, 1468, 1616, 1765, 1914, 2063, 2212, 2361, 2510, 2659, 2807, 2956, 3105, 3254, 3403, 3552, 3701, 3850, 3998, 4147, 4296, 4445, 4594, 4743, 4892, 5041, 5189, 5338, 5487, 5636, 5785, 5934, 6083, 6232, 6380, 6529, 6678, 6827, 6976, 7125, 7274, 7423, 7571, 7720, 7869, 8018, 8167, 8316, 8465, 8614, 8762]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    hit4 = 4
    # 自动射击攻击多段攻击次数 : {value5}次
    # REMOVE: data5 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # 搭乘步行者时机枪射击攻击力 : {value6}%
    # REMOVE: data6 = [0, 808, 890, 972, 1054, 1135, 1217, 1299, 1381, 1463, 1545, 1627, 1709, 1791, 1873, 1955, 2037, 2119, 2201, 2283, 2365, 2447, 2528, 2610, 2692, 2774, 2856, 2938, 3020, 3102, 3184, 3266, 3348, 3430, 3512, 3594, 3676, 3758, 3840, 3922, 4003, 4085, 4167, 4249, 4331, 4413, 4495, 4577, 4659, 4741, 4823]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    hit6 = 0
    # [步行者搭乘效果信息]
    # 可使用技能的冷却时间减少率 : {value7}%
    # REMOVE: data7 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7)
    # 所受伤害减少率 : {value8}%
    # REMOVE: data8 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8)
    # 移动速度增加 : {value9}%
    # REMOVE: data9 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9)
    # 控制型异常状态抗性增加 : {value10}%
    # REMOVE: data10 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10)
    # [范围信息]
    # 索敌距离 : {value11}px
    # REMOVE: data11 = [0, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11)
    # 寻敌范围 : {value12}px
    # REMOVE: data12 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12)
    # 索敌高度 : {value13}px
    # REMOVE: data13 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13)

    def vp_1(self):
        """
        [AT-SO步行者]\n
        步行者持续时间变更为无限制\n
        - 搭乘次数上限 +3次\n
        - 每10秒恢复1次搭乘次数\n
        搭乘中发动追加效果\n
        - 删除可使用技能的施放动作\n
        - 移动速度 +20%\n
        - 前冲并拖拽碰撞到的敌人
        """
        ...

    def vp_2(self):
        """
        [AT-SO步行者]\n
        呼叫步行者后， 向最强的敌人发动引爆程序\n
        - 步行者爆炸攻击力 : 步行者自动射击攻击力的8400%\n
        可以在转职技能施放过程中， 施放[AT-SO步行者] (觉醒技能除外)\n
        - 删除施放动作\n
        步行者引爆时获得增益效果\n
        - 搭乘中可施放技能的冷却时间减少30%\n
        - 移动速度 +25%\n
        - 所受伤害 -10%\n
        - 控制型异常状态抗性 +30%\n
        - 增益持续时间 : 30秒
        """
        ...

# 步行者中止指令
# gunner_male/assault/b4864a42c0ebce383092bf0b0a840a8b
# afdf3b989339de478e85b614d274d1ef/b4864a42c0ebce383092bf0b0a840a8b
class Skill42(ActiveSkill):
    """
        使AT-SO步行者停止自动射击。\n
        停止自动射击状态下再次按技能键， 解除自动射击中止指令。
    """
    name = "步行者中止指令"
    learnLv = 75
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 2
    cd = 2
    uuid = "b4864a42c0ebce383092bf0b0a840a8b"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501


# 炎神攻城炮
# gunner_male/assault/92502df340b3d5410aa3dc46373871a2
# afdf3b989339de478e85b614d274d1ef/92502df340b3d5410aa3dc46373871a2
class Skill43(ActiveSkill):
    """
        将原本用于冲击城门和城墙的攻城兵器改造为梅尔文式战斗装备， 是超能终结者众多战斗装备中危险性最强的装备。\n
        展开炎神攻城炮后， 扳动手柄启动装置， 发射铁桩并引爆炸药。\n
        铁桩命中的敌人不再受到爆炸伤害。\n
        按向前方向键， 则角色不会向后退。\n
        [为可折叠的便携式， 内部填入炸药附加爆炸功能， 将天界的魔刹石附着在铁桩上增强破坏力， 不仅可用于攻城， 也可以在一般战斗中使用。 --炎神攻城炮说明书]
    """
    name = "炎神攻城炮"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 0 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [877, 6577]
    uuid = "92502df340b3d5410aa3dc46373871a2"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 铁桩攻击力 : {value0}%
    # REMOVE: data0 = [0, 90579, 99768, 108957, 118147, 127336, 136525, 145714, 154903, 164092, 173282, 182471, 191660, 200849, 210038, 219227, 228417, 237606, 246795, 255984, 265173, 274362, 283552, 292741, 301930, 311119, 320308, 329498, 338687, 347876, 357065, 366254, 375443, 384633, 393822, 403011, 412200, 421389, 430578, 439768, 448957, 458146, 467335, 476524, 485713, 494903, 504092, 513281, 522470, 531659, 540849]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 铁桩与爆炸攻击力比率 : {value1}%
    # REMOVE: data1 = [0, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 爆炸大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    
    mode = ["铁桩","爆炸"]

    def setMode(self, mode):
        if mode == "铁桩":
            self.power0 = 1
        elif mode == "爆炸":
            self.power0 = 0.9

    def vp_1(self):
        """
        [炎神攻城炮]\n
        命中时， 敌人被火焰笼罩\n
        - 强制控制敌人\n
        适用铁桩与爆炸攻击力的100%比率
        """
        self.setMode("铁桩")

    def vp_2(self):
        """
        [炎神攻城炮]\n
        施放速度 +20%\n
        可以强制中断施放后僵直并施放部分技能\n
        - 可施放技能 : [烟尘弹]、 [瞄准射击]、 [改装榴弹]、 [三连霰弹]、 [战略轰炸]、 [雷达扫射]
        """
        ...

# 超频 : 伊奎利斯-MR
# gunner_male/assault/24eecdd7afbf8fc782335c59d041a4ab
# afdf3b989339de478e85b614d274d1ef/24eecdd7afbf8fc782335c59d041a4ab
class Skill44(ActiveSkill):
    """
        呼叫利用梅尔文的技术制造的附加装备“伊奎利斯-MR”。\n
        伸展双臂， 将飞来的伊奎利斯装备组装起来， 然后展开重火器向前方进行轰炸。\n
        觉醒技能是强力超频技能， 需消耗大量能量， 因此无法中断施放后僵直。\n
        [装备上刻着梅尔文名字的首字母， 可见他对这项发明引以为傲。]
    """
    name = "超频 : 伊奎利斯-MR"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2484, 4968]
    uuid = "24eecdd7afbf8fc782335c59d041a4ab"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 伊奎利斯轰炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 9935, 12239, 14543, 16847, 19151, 21455, 23759, 26063, 28366, 30670, 32974, 35278, 37582, 39886, 42190, 44494, 46797, 49101, 51405, 53709, 56013, 58317, 60621, 62925, 65228, 67532, 69836, 72140, 74444, 76748, 79052, 81355, 83659, 85963, 88267, 90571, 92875, 95179, 97483, 99786, 102090, 104394, 106698, 109002, 111306, 113610, 115914, 118217, 120521, 122825]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 20
    # 伊奎利斯轰炸多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 诺维尔计划 : 涅槃
# gunner_male/assault/ebf367b19fa6d2da41017fd54049f8fa
# afdf3b989339de478e85b614d274d1ef/ebf367b19fa6d2da41017fd54049f8fa
class Skill45(PassiveSkill):
    """
        重霄·合金战士成功改造躯体和装备， 获得等同于一艘舰艇的破坏力。\n
        增加基本攻击力和转职技能攻击力， 变更部分技能效果。\n
        [超频 ： 压制]\n
        冷却时间减少1秒， 施放前僵直时进入无敌状态。\n
        [三连霰弹]\n
        施放时进入霸体状态， 增加攻击范围， 最后射击时可以使敌人倒地。\n
        [以梅丽·法伊奥妮尔的设计为基础， 由梅尔文·里克特亲自改造躯体， 并利用奈恩·希格和琳赛·罗森开发的能源技术强化人工心脏， 即使输出超过极限也很安全。  --摘自诺维尔组件部分记录]
    """
    name = "诺维尔计划 : 涅槃"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "ebf367b19fa6d2da41017fd54049f8fa"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [超频 ： 压制]冷却时间减少 : {value1}秒
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

    associate = [
        {"type":"*skillDamage","data":data0},
        {"type":"+cd","data":[0] + [-1]*maxLv,"skills":["超频 : 压制"],"ratio":1},
    ]

# 超频 : 音速瞬杀
# gunner_male/assault/560d1d8b182f750ff020bfd9e0f1aaf4
# afdf3b989339de478e85b614d274d1ef/560d1d8b182f750ff020bfd9e0f1aaf4
class Skill46(ActiveSkill):
    """
        一定范围内存在敌人时， 可以施放该技能。\n
        利用后空翻腾空， 向最强大的敌人发射左臂搭载的诱导导弹后， 迅速脱离战场。\n
        然后， 从空中向导弹发射的目标突进。\n
        击倒敌人后， 启动打桩机形态的机械右臂， 发射铁桩并引爆炸药， 引发爆炸。\n
        [机械左臂 - 由爆炸物专家休·菲茨莱利开发， 吉娜·戴奥多勒设计。]\n
        [机械右臂 - 由梅尔文·里克特和佩拉·维恩合作制造， 结合了机器人工学技术。]
    """
    name = "超频 : 音速瞬杀"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1169, 8769]
    uuid = "560d1d8b182f750ff020bfd9e0f1aaf4"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 诱导导弹攻击力 : {value0}%
    # REMOVE: data0 = [0, 8933, 9839, 10745, 11651, 12557, 13463, 14370, 15276, 16182, 17088, 17994, 18901, 19807, 20713, 21619, 22525, 23432, 24338, 25244, 26150, 27056, 27963, 28869, 29775, 30681, 31587, 32494, 33400, 34306, 35212, 36118, 37025, 37931, 38837, 39743, 40649, 41556, 42462, 43368, 44274, 45180, 46087, 46993, 47899, 48805, 49711, 50618, 51524, 52430, 53336]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 4
    # 诱导导弹多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 突进攻击力 : {value2}%
    # REMOVE: data2 = [0, 53595, 59032, 64469, 69907, 75344, 80781, 86218, 91655, 97092, 102530, 107967, 113404, 118841, 124278, 129715, 135153, 140590, 146027, 151464, 156901, 162338, 167776, 173213, 178650, 184087, 189524, 194962, 200399, 205836, 211273, 216710, 222147, 227585, 233022, 238459, 243896, 249333, 254770, 260208, 265645, 271082, 276519, 281956, 287393, 292831, 298268, 303705, 309142, 314579, 320017]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    hit2 = 1
    # 终结爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 89325, 98387, 107449, 116511, 125573, 134635, 143697, 152759, 161821, 170883, 179945, 189007, 198068, 207130, 216192, 225254, 234316, 243378, 252440, 261502, 270564, 279626, 288688, 297750, 306812, 315874, 324936, 333998, 343060, 352122, 361184, 370246, 379308, 388370, 397432, 406493, 415555, 424617, 433679, 442741, 451803, 460865, 469927, 478989, 488051, 497113, 506175, 515237, 524299, 533361]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 1

# 超频 : 末世终结之战
# gunner_male/assault/6aa32e36149e8299938451f85f9d840a
# afdf3b989339de478e85b614d274d1ef/6aa32e36149e8299938451f85f9d840a
class Skill47(ActiveSkill):
    """
        将强化型人工心脏提高到最大输出功率， 释放电子脉冲控制周围的敌人后， 在空中机动作战。\n
        在空中利用终极武装的身体发射子弹和导弹， 然后将能量凝聚到两侧机械臂上， 进行超高热炮击。\n
        炮击结束后迅速落地， 引发冲击波击飞敌人， 然后解除武装。\n
        觉醒技能是强力超频技能， 需消耗大量能量， 因此无法中断施放后僵直。\n
        [赌上一切， 开始最后的游戏。]\n
    [三次觉醒技能]\n
        使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
        若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "超频 : 末世终结之战"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4002, 8004]
    uuid = "6aa32e36149e8299938451f85f9d840a"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

    # 战场脉冲攻击力 : {value0}%
    # REMOVE: data0 = [0, 54890, 67618, 80346, 93075, 105803, 118531, 131259, 143987, 156715, 169443, 182171, 194900, 207628, 220356, 233084, 245812, 258540, 271268, 283997, 296725, 309453, 322181, 334909, 347637, 360365, 373094, 385822, 398550, 411278, 424006, 436734, 449462, 462191, 474919, 487647, 500375, 513103, 525831, 538559, 551288, 564016, 576744, 589472, 602200, 614928, 627656, 640385, 653113, 665841, 678569]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    hit0 = 1
    # 子弹攻击力 : {value1}%
    # REMOVE: data1 = [0, 6861, 8452, 10043, 11634, 13225, 14816, 16407, 17998, 19589, 21180, 22771, 24362, 25953, 27544, 29136, 30727, 32318, 33909, 35500, 37091, 38682, 40273, 41864, 43455, 45046, 46637, 48228, 49819, 51410, 53001, 54592, 56183, 57774, 59365, 60956, 62547, 64138, 65729, 67320, 68911, 70502, 72093, 73684, 75275, 76866, 78457, 80048, 81639, 83230, 84821]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    hit1 = 12
    # 子弹多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 导弹攻击力 : {value3}%
    # REMOVE: data3 = [0, 27445, 33809, 40173, 46537, 52901, 59265, 65629, 71994, 78358, 84722, 91086, 97450, 103814, 110178, 116542, 122906, 129270, 135634, 141998, 148362, 154726, 161091, 167455, 173819, 180183, 186547, 192911, 199275, 205639, 212003, 218367, 224731, 231095, 237459, 243823, 250187, 256552, 262916, 269280, 275644, 282008, 288372, 294736, 301100, 307464, 313828, 320192, 326556, 332920, 339284]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    hit3 = 3
    # 导弹多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 超高热炮击攻击力 : {value5}%
    # REMOVE: data5 = [0, 274451, 338091, 401732, 465373, 529013, 592654, 656295, 719935, 783576, 847217, 910857, 974498, 1038139, 1101780, 1165420, 1229061, 1292702, 1356342, 1419983, 1483624, 1547264, 1610905, 1674546, 1738187, 1801827, 1865468, 1929109, 1992749, 2056390, 2120031, 2183671, 2247312, 2310953, 2374593, 2438234, 2501875, 2565516, 2629156, 2692797, 2756438, 2820078, 2883719, 2947360, 3011000, 3074641, 3138282, 3201923, 3265563, 3329204, 3392845]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    hit5 = 1
    # 落地冲击波攻击力 : {value6}%
    # REMOVE: data6 = [0, 54890, 67618, 80346, 93075, 105803, 118531, 131259, 143987, 156715, 169443, 182171, 194900, 207628, 220356, 233084, 245812, 258540, 271268, 283997, 296725, 309453, 322181, 334909, 347637, 360365, 373094, 385822, 398550, 411278, 424006, 436734, 449462, 462191, 474919, 487647, 500375, 513103, 525831, 538559, 551288, 564016, 576744, 589472, 602200, 614928, 627656, 640385, 653113, 665841, 678569]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)
    hit6 = 1

class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'assault'
        self.nameCN = '重霄·合金战士'
        self.role = 'gunner_male'
        self.角色 = '神枪手(男)'
        self.职业 = '合金战士'
        self.jobId = 'afdf3b989339de478e85b614d274d1ef'
        self.jobGrowId = '92da05ec93fb43406e193ffb9a2a629b'

        self.武器选项 = ['手弩', '步枪','左轮枪','自动手枪','手炮'] # TODO
        self.输出类型选项 = ['物理百分比'] # TODO
        self.输出类型 = '物理百分比' # TODO
        self.防具精通属性 = ['力量'] # TODO
        self.防具类型 = '轻甲'
        self.buff = 2.083 # TODO

        super().__init__(equVersion, __name__)
