
monster_data = {
    "0": {
        "id": 0,
        "name": "120沙袋(绿)",
        "防御": 443243,
        "火抗": 0,
        "冰抗": 0,
        "光抗": 0,
        "暗抗": 0
    },
    "1": {
        "id": 1,
        "name": "130沙袋",
        "防御": 506109,
        "火抗": 0,
        "冰抗": 0,
        "光抗": 0,
        "暗抗": 0
    },
    "2": {
        "id": 2,
        "name": "140巴卡尔",
        "防御": 3025925,
        "火抗": 20,
        "冰抗": 20,
        "光抗": 20,
        "暗抗": 20
    },
    "3": {
        "id": 3,
        "name": "雾神“雾”",
        "防御": 3025925,
        "火抗": 20,
        "冰抗": 20,
        "光抗": 20,
        "暗抗": 20
    }
}

scene_data = {
    "0": {
        "id": 0,
        "name": "修炼道场",
        "防御系数": 1,
        "系统奶系数": 0,
        "系统奶基数": 0
    },
    "1": {
        "id": 1,
        "name": "巴卡尔攻坚战",
        "防御系数": 40,
        "系统奶系数": 3.08,
        "系统奶基数": 3916
    },
    "2": {
        "id": 2,
        "name": "雾神攻坚战",
        "防御系数": 80,
        "系统奶系数": 3.08,
        "系统奶基数": 3916
    }
}


def get_monster_data(id):
    return monster_data.get(str(id), {
        "id": 2,
        "name": "140巴卡尔",
        "防御": 3025925,
        "火抗": 20,
        "冰抗": 20,
        "光抗": 20,
        "暗抗": 20
    })


def get_scene_data(id):
    return scene_data.get(str(id), {
        "id": 1,
        "name": "巴卡尔攻坚战",
        "防御系数": 40,
        "系统奶系数": 3.08,
        "系统奶基数": 3916
    })
