#ddc49e9ad1ff72a00b53c6cff5b1e920
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "thief/kunoichi/cn/skillDetail"

# 翔击
# thief/kunoichi/3c5604bdbb0240b8f130f59ab40509c3
# ddc49e9ad1ff72a00b53c6cff5b1e920/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
    向敌人发出向上的切割攻击， 并使敌人浮空。\n
    在空中也可以使用[翔击]， 且按住技能键的时间越长， [翔击]的跳跃高度就越高。\n
    可消耗连击点数发动[终结之击]。
    """
    name = "翔击"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 7 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 186, 216, 245, 275, 305, 334, 364, 394, 423, 453, 483, 512, 542, 571, 601, 631, 660, 690, 720, 749]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 101.9, 103, 103.9, 105, 105.8, 106.9, 107.8, 108.9, 112.6, 113, 113.4, 113.9, 114.3, 114.7, 115.2, 115.6, 116, 116.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}% X {value3}
    # REMOVE: data2 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [终结之击]浮空力比率 : {value4}%
    # REMOVE: data4 = [0, 100, 107.3, 114.6, 122, 129.3, 137.3, 144.6, 152, 159.3, 166.6, 167.3, 168, 168.6, 169.3, 170, 170.6, 171.3, 172, 172.6, 173.3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 投掷苦无
# thief/kunoichi/506e7ed77d517419a6e1c437a2cedb17
# ddc49e9ad1ff72a00b53c6cff5b1e920/506e7ed77d517419a6e1c437a2cedb17
class Skill1(ActiveSkill):
    """
    向敌人投掷苦无， 使远距离的敌人受到无属性物理伤害。\n
    苦无具有略微的诱导性和穿透力， 可以在跳跃状态中投掷。\n
    技能等级越高， 被苦无命中的敌人的僵直时间越长。
    """
    name = "投掷苦无"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 2.5
    mp = [8, 91]
    uuid = "506e7ed77d517419a6e1c437a2cedb17"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 299, 329, 360, 390, 420, 451, 481, 511, 542, 572, 602, 633, 663, 693, 724, 754, 784, 815, 845, 875, 906, 936, 966, 997, 1027, 1057, 1088, 1118, 1148, 1179, 1209, 1239, 1270, 1300, 1330, 1361, 1391, 1421, 1452, 1482, 1512, 1543, 1573, 1603, 1634, 1664, 1694, 1725, 1755, 1785, 1816, 1846, 1876, 1907, 1937, 1967, 1998, 2028, 2058, 2089, 2119, 2149, 2180, 2210, 2240, 2271, 2301, 2331, 2362, 2392]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 苦无投掷个数 : {value1}个
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 僵直时间增加率 : {value2}%
    # REMOVE: data2 = [0, 100, 105.2, 110.3, 115.5, 120.7, 125.9, 131, 136.2, 141.4, 146.6, 151.7, 156.9, 162.1, 167.2, 172.4, 177.6, 182.8, 187.9, 193.1, 198.3, 203.4, 208.6, 213.8, 219, 224.1, 229.3, 234.5, 239.7, 244.8, 250, 255.2, 260.3, 265.5, 270.7, 275.9, 281, 286.2, 291.4, 296.6, 301.7, 306.9, 312.1, 317.2, 322.4, 327.6, 332.8, 337.9, 343.1, 348.3, 353.4, 358.6, 363.8, 369, 374.1, 379.3, 384.5, 389.7, 394.8, 400, 405.2, 410.3, 415.5, 420.7, 425.9, 431, 436.2, 441.4, 446.6, 451.7, 456.9]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最大穿透次数 : {value3}次
    # REMOVE: data3 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 苦无大小 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 苦无掌握
# thief/kunoichi/852f8ad797db4dca1405cb3e77198401
# ddc49e9ad1ff72a00b53c6cff5b1e920/852f8ad797db4dca1405cb3e77198401
class Skill2(PassiveSkill):
    """
    可以使用苦无系列武器攻击敌人， 且基本攻击更变为魔法攻击。\n
    使用苦无系列武器时基本攻击、 跳跃攻击和前冲攻击会发射出苦无。\n
    若基本攻击中使用后方向键+攻击键时， 则可以往后空翻并投掷苦无。 
    """
    name = "苦无掌握"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 1
    uuid = "852f8ad797db4dca1405cb3e77198401"
    hasVP = False
    hasUP = False

    # 苦无系列武器的投掷距离比率 : {value0}% 
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 后跳
# thief/kunoichi/7822d6d52e10964a6755f142c666b494
# ddc49e9ad1ff72a00b53c6cff5b1e920/7822d6d52e10964a6755f142c666b494
class Skill3(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 基础精通
# thief/kunoichi/5a56514f35cf0270ae8d6c65f8fefd78
# ddc49e9ad1ff72a00b53c6cff5b1e920/5a56514f35cf0270ae8d6c65f8fefd78
class Skill4(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [翔击]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 受身蹲伏
# thief/kunoichi/ce26c6b69d02a440a81b552bec94f03b
# ddc49e9ad1ff72a00b53c6cff5b1e920/ce26c6b69d02a440a81b552bec94f03b
class Skill5(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# thief/kunoichi/892ef624d8bf3d7fc045f84825fd6104
# ddc49e9ad1ff72a00b53c6cff5b1e920/892ef624d8bf3d7fc045f84825fd6104
class Skill6(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 切割
# thief/kunoichi/9dda3f4a849dba1a288dd65e116860f2
# ddc49e9ad1ff72a00b53c6cff5b1e920/9dda3f4a849dba1a288dd65e116860f2
class Skill7(ActiveSkill):
    """
    前冲攻击中输入攻击键时， 施放追加斩击。\n
    攻击力、 攻击范围、 前进速度和前进距离随技能等级增加而增大。
    """
    name = "切割"
    learnLv = 5
    masterLv = 1
    maxLv = 6
    position = 2 #TODO
    rangeLv = 2
    cd = 2.5
    mp = [6, 56]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 419, 462, 504, 547, 589, 632]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲速度和距离比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 102.1, 103.1, 104.1, 105.2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 130, 131, 131, 133, 134, 134]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 焰刃
# thief/kunoichi/eb71e1d82d92c7e1d40500a0dcd77aa6
# ddc49e9ad1ff72a00b53c6cff5b1e920/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill8(ActiveSkill):
    """
    火属性近身魔法技能； 聚集火焰的力量对敌人进行强力攻击并把敌人击飞。\n
    攻击力、 击飞力、 发动速度和攻击范围随技能等级增加而增大。
    """
    name = "焰刃"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 5
    mp = [15, 168]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1721, 1896, 2070, 2245, 2419, 2594, 2769, 2943, 3118, 3292, 3467, 3642, 3816, 3991, 4165, 4340, 4515, 4689, 4864, 5038, 5213, 5387, 5562, 5737, 5911, 6086, 6260, 6435, 6610, 6784, 6959, 7133, 7308, 7483, 7657, 7832, 8006, 8181, 8356, 8530, 8705, 8879, 9054, 9229, 9403, 9578, 9752, 9927, 10102, 10276, 10451, 10625, 10800, 10974, 11149, 11324, 11498, 11673, 11847, 12022, 12197, 12371, 12546, 12720, 12895, 13070, 13244, 13419, 13593, 13768]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 击飞力比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 102.3, 103.3, 104.6, 105.6, 107, 108, 109.3, 110.3, 111.3, 112.6, 113.6, 115, 116, 117.3, 118.3, 119.6, 120.6, 122, 123, 124, 125.3, 126.3, 127.6, 128.6, 130, 131, 132.3, 133.3, 134.3, 135.6, 136.6, 138, 139, 140.3, 141.3, 142.6, 143.6, 144.6, 146, 147, 148.3, 149.3, 150.6, 151.6, 153, 154, 155.3, 156.3, 157.3, 158.6, 159.6, 161, 162, 163.3, 164.3, 165.6, 166.6, 167.6, 169, 170, 171.3, 172.3, 173.6, 174.6, 176, 177, 178, 179.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 发动速度增加率 : {value2}%
    # REMOVE: data2 = [0, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 范围 : {value3}%
    # REMOVE: data3 = [0, 156, 158, 158, 159, 161, 161, 162, 164, 165, 165, 167, 168, 168, 170, 172, 172, 173, 175, 175, 176, 178, 178, 179, 181, 183, 183, 184, 186, 186, 187, 189, 189, 190, 192, 192, 193, 195, 197, 197, 198, 200, 200, 201, 203, 203, 204, 206, 206, 207, 209, 209, 211, 212, 214, 214, 215, 217, 217, 218, 220, 220, 222, 223, 223, 225, 226, 228, 228, 229, 231]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 影袭
# thief/kunoichi/c9664191611af31142e052dfaef84530
# ddc49e9ad1ff72a00b53c6cff5b1e920/c9664191611af31142e052dfaef84530
class Skill9(ActiveSkill):
    """
    以无视敌人硬直的斩击攻击敌人， 使敌人受到无属性物理伤害的同时进入僵直状态； 之后移动到敌人身后， 伺机进行下一次攻击。\n
    转职为影舞者时， 可以强制控制敌人。\n
    在决斗场中， 无法强制控制敌人， 但是相比其他暗夜使者， 可以使敌人进入更长时间的僵直状态。
    """
    name = "影袭"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 6
    mp = [15, 168]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 3411, 3757, 4103, 4449, 4795, 5141, 5487, 5833, 6179, 6525, 6871, 7217, 7564, 7910, 8256, 8602, 8948, 9294, 9640, 9986, 10332, 10678, 11024, 11370, 11716, 12062, 12408, 12754, 13100, 13446, 13792, 14138, 14484, 14830, 15176, 15523, 15869, 16215, 16561, 16907, 17253, 17599, 17945, 18291, 18637, 18983, 19329, 19675, 20021, 20367, 20713, 21059, 21405, 21751, 22097, 22443, 22789, 23135, 23482, 23828, 24174, 24520, 24866, 25212, 25558, 25904, 26250, 26596, 26942, 27288]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 敌人僵直时间 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [转职为影舞者时] -
    # 僵直时间比率 : {value2}%
    # REMOVE: data2 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暗魂波
# thief/kunoichi/ade01c1d6afc8a05055225045e89fe49
# ddc49e9ad1ff72a00b53c6cff5b1e920/ade01c1d6afc8a05055225045e89fe49
class Skill10(ActiveSkill):
    """
    向敌人发射暗属性球体。\n
    球体会自动寻找敌人， 发现敌人后对敌人造成伤害， 最后球体爆炸。\n
    -  [转职为黑夜术士后附加效果]  -\n
    施放[降临 : 暴君巴拉克]的状态下， 可以蓄气施放[暗魂波]。\n
    蓄气施放[暗魂波]时， 球体变大且增加攻击力。\n
    在决斗场中， 地图内球体的存在时间减少。
    """
    name = "暗魂波"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 3.5
    mp = [15, 161]
    uuid = "ade01c1d6afc8a05055225045e89fe49"
    hasVP = False
    hasUP = False

    # 多段攻击次数上限 : {value0}次
    # REMOVE: data0 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 多段攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 248, 273, 298, 323, 349, 374, 399, 424, 449, 474, 500, 525, 550, 575, 600, 625, 650, 676, 701, 726, 751, 776, 801, 827, 852, 877, 902, 927, 952, 978, 1003, 1028, 1053, 1078, 1103, 1128, 1154, 1179, 1204, 1229, 1254, 1279, 1305, 1330, 1355, 1380, 1405, 1430, 1455, 1481, 1506, 1531, 1556, 1581, 1606, 1632, 1657, 1682, 1707, 1732, 1757, 1783, 1808, 1833, 1858, 1883, 1908, 1933, 1959, 1984]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 1034, 1139, 1244, 1349, 1454, 1559, 1664, 1768, 1873, 1978, 2083, 2188, 2293, 2398, 2503, 2608, 2713, 2818, 2922, 3027, 3132, 3237, 3342, 3447, 3552, 3657, 3762, 3867, 3971, 4076, 4181, 4286, 4391, 4496, 4601, 4706, 4811, 4916, 5021, 5125, 5230, 5335, 5440, 5545, 5650, 5755, 5860, 5965, 6070, 6175, 6279, 6384, 6489, 6594, 6699, 6804, 6909, 7014, 7119, 7224, 7329, 7433, 7538, 7643, 7748, 7853, 7958, 8063, 8168, 8273]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 诱导力比率 : {value3}%
    # REMOVE: data3 = [0, 100, 103, 108, 110, 115, 118, 120, 125, 128, 130, 135, 138, 143, 145, 148, 153, 155, 158, 163, 165, 170, 173, 175, 180, 183, 185, 190, 193, 198, 200, 203, 208, 210, 215, 218, 220, 225, 228, 230, 235, 238, 243, 245, 248, 253, 255, 258, 263, 265, 270, 273, 275, 280, 283, 285, 290, 293, 298, 300, 303, 308, 310, 315, 318, 320, 325, 328, 330, 335, 338]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [转职为黑夜术士后]
    # 蓄气时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 地图内球体存在时间 : {value5}秒
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [冥河之钥]
    # 多段攻击力 : {value6}%
    # REMOVE: data6 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 弧光闪
# thief/kunoichi/0969cd4054d93da07708108c0cc1c4b5
# ddc49e9ad1ff72a00b53c6cff5b1e920/0969cd4054d93da07708108c0cc1c4b5
class Skill11(ActiveSkill):
    """
    急速冲向前方的敌人并对其进行闪电般的攻击。\n
    按上下方向键可向Y轴移动； 若急速前冲过程中按跳跃键， 则可停止移动。\n
    暗星可以连续发动两次[弧光闪]； 可在空中施放[弧光闪]； 可强制中断转职技能， 并施放[弧光闪]； 可消耗连击点数发动可控制左右方向的[终结之击]； 学习[弧光连闪]后， 增加追加攻击的可发动次数。\n
    转职为影舞者后， 可以强制中断技能并施放[追影步]； 学习[潜行教义]后， 可以再次按技能键发动追加攻击。\n
    可以利用方向键调整移动方向。
    """
    name = "弧光闪"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 6
    mp = [18, 190]
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 2026, 2232, 2437, 2643, 2848, 3054, 3259, 3465, 3670, 3876, 4081, 4287, 4492, 4698, 4904, 5109, 5315, 5520, 5726, 5931, 6137, 6342, 6548, 6753, 6959, 7164, 7370, 7575, 7781, 7987, 8192, 8398, 8603, 8809, 9014, 9220, 9425, 9631, 9836, 10042, 10247, 10453, 10659, 10864, 11070, 11275, 11481, 11686, 11892, 12097, 12303, 12508, 12714, 12919, 13125, 13330, 13536, 13742, 13947, 14153, 14358, 14564, 14769, 14975, 15180, 15386, 15591, 15797, 16002, 16208]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [终结之击]攻击力 : {value1}%
    # REMOVE: data1 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 发动速度比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 僵直时间比率 : {value3}%
    # REMOVE: data3 = [0, 150, 155, 161, 165, 171, 176, 182, 186, 192, 197, 201, 207, 212, 218, 222, 228, 233, 239, 243, 249, 254, 258, 264, 269, 275, 279, 285, 290, 296, 300, 305, 311, 315, 321, 326, 332, 336, 342, 347, 351, 357, 362, 368, 372, 378, 383, 389, 393, 399, 404, 408, 414, 419, 425, 429, 435, 440, 446, 450, 455, 461, 465, 471, 476, 482, 486, 492, 497, 501, 507]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 骨盾
# thief/kunoichi/ff171dc487807bb9aa28900ca9a46b41
# ddc49e9ad1ff72a00b53c6cff5b1e920/ff171dc487807bb9aa28900ca9a46b41
class Skill12(ActiveSkill):
    """
    在自身或队员周围召唤由骨头碎片形成的骨盾， 可以增加被骨盾守护的角色的物理防御力和魔法防御力。\n
    该角色被攻击时， 骨头碎片会自动飞向敌人， 并使敌人受到无属性魔法伤害。\n
    每次被攻击时， 骨头碎片会逐块消失。 当骨头碎片全部消失时， 增加的物理防御力和魔法防御力效果就会消失。\n
    [转职为黑夜术士后功能变更]\n
    减少骨盾的持续时间。\n
    学习后减少所受伤害， 施放技能后被攻击一定次数内附加霸体护甲。\n
    可以在其他动作中施放， 不受冷却时间减少效果的影响。\n
    在决斗场中， 不适用持续时间减少和霸体护甲效果， 施放技能时减少所受伤害。
    """
    name = "骨盾"
    learnLv = 10
    masterLv = 1
    maxLv = 7
    position = 1 #TODO
    rangeLv = 3
    cd = 15
    mp = [20, 400]
    uuid = "ff171dc487807bb9aa28900ca9a46b41"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 122, 136, 150, 160, 173, 187, 201]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 骨盾持续时间 : {value1}秒
    # REMOVE: data1 = [0, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 骨头碎片数量 : {value2}
    # REMOVE: data2 = [0, 27, 27, 29, 29, 29, 31, 31]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 魔法防御力增加 : {value3}
    # REMOVE: data3 = [0, 204, 270, 341, 420, 508, 605, 709]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 204, 270, 341, 420, 508, 605, 709]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 发射骨头碎片冷却时间 : {value5}秒
    # REMOVE: data5 = [0, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [转职为黑夜术士后]
    # 持续时间减少率 : 85%
    # 所受伤害减少率 : {value6}%
    # REMOVE: data6 = [0, 4, 8, 12, 16, 20, 20, 20]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 霸体护甲生效次数 : {value7}次
    # REMOVE: data7 = [0, 4, 5, 6, 7, 8, 8, 8]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 忍法 : 影分身
# thief/kunoichi/a5fa08f5d509e6ff2ebc68856a470b5a
# ddc49e9ad1ff72a00b53c6cff5b1e920/a5fa08f5d509e6ff2ebc68856a470b5a
class Skill13(ActiveSkill):
    """
    把自己的影分身留在原地的同时， 向空中瞬移， 可用左右方向键控制瞬移地点。\n
    被攻击时， 也可以使用此技能。\n
    留在地上的影分身会挑衅一定领域内的敌人； 影分身经过一段时间或受到一定伤害后， 会爆炸并使敌人受到无属性魔法伤害。
    """
    name = "忍法 : 影分身"
    learnLv = 10
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 3
    cd = [30, 29.4, 28.8, 28.2, 27.6, 26.9, 26.3, 25.7, 25.1, 24.5, 23.9, 23.3, 22.7, 22, 21.4, 20.8, 20.2, 19.6, 19, 18.4, 17.8, 17.1, 16.5, 15.9, 15.3, 14.7, 14.1, 13.5, 12.9, 12.2, 11.6, 11, 10.4, 9.8, 9.2, 8.6, 8, 7.3, 6.7, 6.1, 5.5, 4.9, 4.3, 3.7, 3.1, 2.4, 1.8, 1.2, 0.6, 0]
    mp = [20, 230]
    uuid = "a5fa08f5d509e6ff2ebc68856a470b5a"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 918, 1064, 1211, 1357, 1503, 1650, 1796, 1942, 2089, 2235, 2381, 2528, 2674, 2821, 2967, 3113, 3260, 3406, 3552, 3699, 3845, 3991, 4138, 4284, 4430, 4577, 4723, 4869, 5016, 5162, 5308, 5455, 5601, 5747, 5894, 6040, 6187, 6333, 6479, 6626, 6772, 6918, 7065, 7211, 7357, 7504, 7650, 7796, 7943, 8089]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 分身生命值 : {value1}
    # REMOVE: data1 = [0, 168, 192, 216, 276, 372, 456, 540, 624, 739, 864, 998, 1142, 1296, 1459, 1632, 1814, 2006, 2208, 2419, 2640, 2870, 3110, 3360, 3619, 3888, 4166, 4454, 4752, 5059, 5376, 5702, 6038, 6384, 6739, 7104, 7478, 7862, 8256, 8659, 9072, 9494, 9926, 10368, 10819, 11280, 11750, 12230, 12720, 13219, 13728]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 分身持续时间 : {value2}秒
    # REMOVE: data2 = [0, 7, 7.2, 7.4, 7.7, 7.9, 8.2, 8.4, 8.6, 8.9, 9.1, 9.4, 9.6, 9.8, 10.1, 10.3, 10.6, 10.8, 11.1, 11.3, 11.5, 11.8, 12, 12.3, 12.5, 12.7, 13, 13.2, 13.5, 13.7, 14, 14.2, 14.4, 14.7, 14.9, 15.2, 15.4, 15.6, 15.9, 16.1, 16.4, 16.6, 16.8, 17.1, 17.3, 17.6, 17.8, 18.1, 18.3, 18.5, 18.8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 挑衅范围 : {value3}px
    # REMOVE: data3 = [0, 200, 203, 207, 210, 214, 217, 221, 224, 228, 231, 234, 238, 241, 245, 248, 252, 255, 259, 262, 266, 269, 272, 276, 279, 283, 286, 290, 293, 297, 300, 303, 307, 310, 314, 317, 321, 324, 328, 331, 334, 338, 341, 345, 348, 352, 355, 359, 362, 366, 369]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 碎踝
# thief/kunoichi/5dc7008b12a459325b548b0715c6b73c
# ddc49e9ad1ff72a00b53c6cff5b1e920/5dc7008b12a459325b548b0715c6b73c
class Skill14(ActiveSkill):
    """
    用强力的扫腿踢攻击敌人的脚踝。
    """
    name = "碎踝"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 7
    mp = [15, 168]
    uuid = "5dc7008b12a459325b548b0715c6b73c"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 5882, 6479, 7075, 7672, 8269, 8866, 9462, 10059, 10656, 11253, 11849, 12446, 13043, 13639, 14236, 14833, 15430, 16026, 16623, 17220, 17816, 18413, 19010, 19607, 20203, 20800, 21397, 21994, 22590, 23187, 23784, 24380, 24977, 25574, 26171, 26767, 27364, 27961, 28558, 29154, 29751, 30348, 30944, 31541, 32138, 32735, 33331, 33928, 34525, 35122, 35718, 36315, 36912, 37508, 38105, 38702, 39299, 39895, 40492, 41089, 41685, 42282, 42879, 43476, 44072, 44669, 45266, 45863, 46459, 47056]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 减速几率 : {value1}%
    # REMOVE: data1 = [0, 40, 42.1, 44.1, 46.2, 48.3, 50.3, 52.4, 54.5, 56.6, 58.6, 60.7, 62.8, 64.8, 66.9, 69, 71, 73.1, 75.2, 77.2, 79.3, 81.4, 83.4, 85.5, 87.6, 89.7, 91.7, 93.8, 95.9, 97.9, 100, 102.1, 104.1, 106.2, 108.3, 110.3, 112.4, 114.5, 116.6, 118.6, 120.7, 122.8, 124.8, 126.9, 129, 131, 133.1, 135.2, 137.2, 139.3, 141.4, 143.4, 145.5, 147.6, 149.7, 151.7, 153.8, 155.9, 157.9, 160, 162.1, 164.1, 166.2, 168.3, 170.3, 172.4, 174.5, 176.6, 178.6, 180.7, 182.8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 减速持续时间 : {value2}秒
    # REMOVE: data2 = [0, 3, 3.1, 3.2, 3.31, 3.41, 3.51, 3.62, 3.72, 3.82, 3.93, 4.03, 4.13, 4.24, 4.34, 4.44, 4.55, 4.65, 4.75, 4.86, 4.96, 5.06, 5.17, 5.27, 5.37, 5.48, 5.58, 5.69, 5.79, 5.89, 6, 6.1, 6.2, 6.31, 6.41, 6.51, 6.62, 6.72, 6.82, 6.93, 7.03, 7.13, 7.24, 7.34, 7.44, 7.55, 7.65, 7.75, 7.86, 7.96, 8.06, 8.17, 8.27, 8.37, 8.48, 8.58, 8.69, 8.79, 8.89, 9, 9.1, 9.2, 9.31, 9.41, 9.51, 9.62, 9.72, 9.82, 9.93, 10.03, 10.13]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 移动速度减少率 : {value3}%
    # REMOVE: data3 = [0, 16.2, 17.3, 18.5, 19.6, 20.7, 21.7, 23, 24, 25.1, 26.2, 27.4, 28.5, 29.6, 30.8, 31.9, 32.9, 34, 35.2, 36.3, 37.4, 38.6, 39.7, 40.8, 41.9, 43.1, 44.1, 45.2, 46.3, 47.5, 48.6, 49.7, 50.9, 52, 53.1, 54.1, 55.4, 56.4, 57.5, 58.6, 59.8, 60.9, 62, 63.2, 64.3, 65.3, 66.4, 67.6, 68.7, 69.8, 71, 72.1, 73.2, 74.3, 75.5, 76.5, 77.6, 78.7, 79.9, 81, 82.1, 83.3, 84.4, 85.5, 86.5, 87.8, 88.8, 89.9, 91, 92.2, 93.3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 攻击速度减少率 : {value4}%
    # REMOVE: data4 = [0, 9.5, 10.1, 10.8, 11.3, 12, 12.7, 13.4, 14, 14.7, 15.3, 15.9, 16.6, 17.3, 18, 18.6, 19.2, 19.8, 20.5, 21.2, 21.9, 22.5, 23.1, 23.8, 24.4, 25.1, 25.8, 26.5, 27, 27.7, 28.4, 29, 29.7, 30.2, 30.9, 31.6, 32.3, 32.9, 33.6, 34.2, 34.8, 35.5, 36.2, 36.9, 37.5, 38.1, 38.7, 39.4, 40.1, 40.8, 41.4, 42, 42.7, 43.3, 44, 44.7, 45.4, 45.9, 46.6, 47.3, 47.9, 48.6, 49.1, 49.8, 50.5, 51.2, 51.8, 52.5, 53.1, 53.7, 54.4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 强化 - 后跳
# thief/kunoichi/2b340542e776818b78f3212af184bd6b
# ddc49e9ad1ff72a00b53c6cff5b1e920/2b340542e776818b78f3212af184bd6b
class Skill15(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# thief/kunoichi/1fea5a626f15230237946a11a9d11582
# ddc49e9ad1ff72a00b53c6cff5b1e920/1fea5a626f15230237946a11a9d11582
class Skill16(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 疾空踏
# thief/kunoichi/717f1e2104fe4b796f800352fa143ecc
# ddc49e9ad1ff72a00b53c6cff5b1e920/717f1e2104fe4b796f800352fa143ecc
class Skill17(ActiveSkill):
    """
    从空中快速下降并向敌人发出连续踢击。\n
    连续踢击结束前， 输入Z键可以发动最后一击。\n
    只能在空中使用， 且在下落过程中有敌人时才能施放连续踢击。\n
    终结攻击会引发冲击波， 被命中的敌人会被击飞。\n
    连续踢击过程中连续按下攻击键时， 会增加连续踢击的速度和命中次数。
    """
    name = "疾空踏"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 6.5
    mp = [22, 235]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = True

    # 连续踢击攻击力 : {value0}%
    # REMOVE: data0 = [0, 336, 370, 404, 438, 472, 506, 540, 574, 608, 642, 676, 710, 745, 779, 813, 847, 881, 915, 949, 983, 1017, 1051, 1085, 1119, 1153, 1187, 1221, 1255, 1290, 1324, 1358, 1392, 1426, 1460, 1494, 1528, 1562, 1596, 1630, 1664, 1698, 1732, 1766, 1800, 1835, 1869, 1903, 1937, 1971, 2005, 2039, 2073, 2107, 2141, 2175, 2209, 2243, 2277, 2311, 2345, 2380, 2414, 2448, 2482, 2516, 2550, 2584, 2618, 2652, 2686]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 连续踢击次数 : {value1}次~{value2}次
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后一击攻击力 : {value3}%
    # REMOVE: data3 = [0, 672, 740, 808, 876, 944, 1012, 1080, 1148, 1217, 1285, 1353, 1421, 1489, 1557, 1625, 1693, 1762, 1830, 1898, 1966, 2034, 2102, 2170, 2238, 2307, 2375, 2443, 2511, 2579, 2647, 2715, 2783, 2852, 2920, 2988, 3056, 3124, 3192, 3260, 3328, 3397, 3465, 3533, 3601, 3669, 3737, 3805, 3873, 3942, 4010, 4078, 4146, 4214, 4282, 4350, 4418, 4487, 4555, 4623, 4691, 4759, 4827, 4895, 4963, 5032, 5100, 5168, 5236, 5304, 5372]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 560, 616, 673, 730, 787, 843, 900, 957, 1014, 1071, 1127, 1184, 1241, 1298, 1354, 1411, 1468, 1525, 1581, 1638, 1695, 1752, 1809, 1865, 1922, 1979, 2036, 2092, 2149, 2206, 2263, 2320, 2376, 2433, 2490, 2547, 2603, 2660, 2717, 2774, 2830, 2887, 2944, 3001, 3058, 3114, 3171, 3228, 3285, 3341, 3398, 3455, 3512, 3568, 3625, 3682, 3739, 3796, 3852, 3909, 3966, 4023, 4079, 4136, 4193, 4250, 4306, 4363, 4420, 4477]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 最后一击浮空力比率 : {value5}%
    # REMOVE: data5 = [0, 100, 102, 104, 105, 107, 109, 110, 112, 114, 116, 117, 119, 121, 123, 124, 126, 128, 129, 131, 133, 135, 136, 138, 140, 142, 143, 145, 147, 148, 150, 152, 154, 155, 157, 159, 160, 162, 164, 166, 167, 169, 171, 173, 174, 176, 178, 179, 181, 183, 185, 186, 188, 190, 192, 193, 195, 197, 198, 200, 202, 204, 205, 207, 209, 210, 212, 214, 216, 217, 219]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 冲击波范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 忍法 : 飞鼠
# thief/kunoichi/4655101518604f874721b3cc249aae10
# ddc49e9ad1ff72a00b53c6cff5b1e920/4655101518604f874721b3cc249aae10
class Skill18(ActiveSkill):
    """
    快速跳向敌人并引爆炸弹， 给予敌人火属性魔法伤害的同时使敌人浮空。
    """
    name = "忍法 : 飞鼠"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 10
    mp = [10, 84]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = True

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 使用次数上限 : {value1}次
    # REMOVE: data1 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后一击浮空力比率 : {value2}%
    # REMOVE: data2 = [0, 400, 407, 414, 421, 428, 434, 441, 448, 455, 462, 469, 476, 483, 490, 497, 503, 510, 517, 524, 531, 538, 545, 552, 559, 566, 572, 579, 586, 593, 600, 607, 614, 621, 628, 634, 641, 648, 655, 662, 669, 676, 683, 690, 697, 703, 710, 717, 724, 731, 738, 745, 752, 759, 766, 772, 779, 786, 793, 800, 807, 814, 821, 828, 834, 841, 848, 855, 862, 869, 876]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每次追击时攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后一击时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 每次追击时爆炸范围增加率 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 最后一击爆炸范围增加率 : {value6}%
    # REMOVE: data6 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 爆炸范围比率 : {value7}%
    # REMOVE: data7 = [0, 142, 143, 143, 145, 146, 146, 148, 149, 151, 151, 152, 153, 153, 155, 156, 156, 158, 159, 159, 160, 162, 162, 163, 165, 166, 166, 168, 169, 169, 170, 172, 172, 173, 175, 175, 176, 178, 179, 179, 180, 182, 182, 183, 185, 185, 186, 187, 187, 189, 190, 190, 192, 193, 195, 195, 196, 197, 197, 199, 200, 200, 202, 203, 203, 204, 206, 207, 207, 209, 210]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 天诛
# thief/kunoichi/f2fb27162beb0b87a7cb9af7900e95f2
# ddc49e9ad1ff72a00b53c6cff5b1e920/f2fb27162beb0b87a7cb9af7900e95f2
class Skill19(ActiveSkill):
    """
    抓取一名敌人后向其头部进行刺击， 被刺击命中的敌人将受到无属性伤害。\n
    若[天诛]背击敌人时， 则会追加一次刺击， 且最后还会追加一次高伤害的切割攻击。
    """
    name = "天诛"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 7
    mp = [28, 308]
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"
    hasVP = False
    hasUP = True

    # 刺击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1499, 1651, 1803, 1955, 2107, 2260, 2412, 2564, 2716, 2868, 3020, 3172, 3324, 3476, 3628, 3780, 3932, 4085, 4237, 4389, 4541, 4693, 4845, 4997, 5149, 5301, 5453, 5605, 5757, 5909, 6062, 6214, 6366, 6518, 6670, 6822, 6974, 7126, 7278, 7430, 7582, 7734, 7887, 8039, 8191, 8343, 8495, 8647, 8799, 8951, 9103, 9255, 9407, 9559, 9712, 9864, 10016, 10168, 10320, 10472, 10624, 10776, 10928, 11080, 11232, 11384, 11537, 11689, 11841, 11993]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 刺击次数 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 切割攻击攻击力 : {value2}%
    # REMOVE: data2 = [0, 6250, 6884, 7518, 8152, 8786, 9420, 10054, 10688, 11322, 11956, 12590, 13224, 13858, 14492, 15126, 15760, 16394, 17028, 17662, 18297, 18931, 19565, 20199, 20833, 21467, 22101, 22735, 23369, 24003, 24637, 25271, 25905, 26539, 27173, 27807, 28441, 29075, 29709, 30343, 30977, 31611, 32245, 32879, 33513, 34147, 34781, 35416, 36050, 36684, 37318, 37952, 38586, 39220, 39854, 40488, 41122, 41756, 42390, 43024, 43658, 44292, 44926, 45560, 46194, 46828, 47462, 48096, 48730, 49364, 49998]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 诅咒之箭
# thief/kunoichi/547ab2b2bd860d3e37355a9cfbc1077c
# ddc49e9ad1ff72a00b53c6cff5b1e920/547ab2b2bd860d3e37355a9cfbc1077c
class Skill20(ActiveSkill):
    """
    召唤暗属性的诅咒之箭后， 向前方敌人发射； 被诅咒之箭命中的敌人会受到暗属性多段魔法伤害， 并有一定几率进入诅咒状态。
    """
    name = "诅咒之箭"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 10 #TODO
    rangeLv = 2
    cd = 10
    mp = [22, 235]
    uuid = "547ab2b2bd860d3e37355a9cfbc1077c"
    hasVP = False
    hasUP = True

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 927, 1021, 1115, 1209, 1303, 1397, 1491, 1585, 1679, 1773, 1867, 1961, 2056, 2150, 2244, 2338, 2432, 2526, 2620, 2714, 2808, 2902, 2996, 3090, 3184, 3278, 3372, 3466, 3560, 3654, 3748, 3842, 3936, 4030, 4124, 4219, 4313, 4407, 4501, 4595, 4689, 4783, 4877, 4971, 5065, 5159, 5253, 5347, 5441, 5535, 5629, 5723, 5817, 5911, 6005, 6099, 6193, 6287, 6382, 6476, 6570, 6664, 6758, 6852, 6946, 7040, 7134, 7228, 7322, 7416]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 发射数量 : {value1}发
    # REMOVE: data1 = [0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 诅咒几率 : {value2}%
    # REMOVE: data2 = [0, 20, 21.4, 22.8, 24.1, 25.5, 26.9, 28.3, 29.7, 31, 32.4, 33.8, 35.2, 36.6, 37.9, 39.3, 40.7, 42.1, 43.4, 44.8, 46.2, 47.6, 49, 50.3, 51.7, 53.1, 54.5, 55.9, 57.2, 58.6, 60, 61.4, 62.8, 64.1, 65.5, 66.9, 68.3, 69.7, 71, 72.4, 73.8, 75.2, 76.6, 77.9, 79.3, 80.7, 82.1, 83.4, 84.8, 86.2, 87.6, 89, 90.3, 91.7, 93.1, 94.5, 95.9, 97.2, 98.6, 100, 101.4, 102.8, 104.1, 105.5, 106.9, 108.3, 109.7, 111, 112.4, 113.8, 115.2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 诅咒持续时间 : {value3}秒
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 多段攻击次数上限 : {value4}
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 忍术精通
# thief/kunoichi/0b8db1e10b3abbd24d38564e708675d5
# ddc49e9ad1ff72a00b53c6cff5b1e920/0b8db1e10b3abbd24d38564e708675d5
class Skill21(PassiveSkill):
    """
    忍者的专属忍术精通。\n
    学习后， 减少忍术技能的冷却时间； 施放技能时长按技能键可以结印。\n
    根据结印的数量追加技能效果。\n
    忍术技能 : [火遁 · 豪火球之术]、 [幻影手里剑]、 [火遁 · 飓风煞]、 [火遁 · 螺旋手里剑]、 [火遁 · 炎天道]、 [火遁 · 蟾蜍油炎弹]、 [火遁 · 炎舞天璇]、 [火遁·风魔手里剑]、 [八岐大蛇]、 [天照]\n
    施放速度越快， 结印速度越快。
    """
    name = "忍术精通"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 15
    uuid = "0b8db1e10b3abbd24d38564e708675d5"
    hasVP = False
    hasUP = False

    # 临、 兵、 斗、 者、 皆、 阵每个结印蓄气时间 : {value0}秒
    # REMOVE: data0 = [0, 0.15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 忍术技能冷却时间减少率 : {value1}%
    # REMOVE: data1 = [0, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 火遁·豪火球之术
# thief/kunoichi/dcb31a63ef58954f44ff2070c42a9a98
# ddc49e9ad1ff72a00b53c6cff5b1e920/dcb31a63ef58954f44ff2070c42a9a98
class Skill22(ActiveSkill):
    """
    结印后从口中吐出大型火焰。\n
    可以在空中使用该技能， 但无法结印， 只能立即施放该技能， 且持续时间减少。\n
    - [忍术精通追加效果] -\n
    增加火焰大小。
    """
    name = "火遁·豪火球之术"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 7.5
    mp = [15, 150]
    uuid = "dcb31a63ef58954f44ff2070c42a9a98"
    hasVP = False
    hasUP = True

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 216, 238, 260, 282, 304, 326, 347, 369, 391, 413, 435, 457, 479, 501, 523, 545, 567, 588, 610, 632, 654, 676, 698, 720, 742, 764, 786, 808, 830, 851, 873, 895, 917, 939, 961, 983, 1005, 1027, 1049, 1071, 1092, 1114, 1136, 1158, 1180, 1202, 1224, 1246, 1268, 1290, 1312, 1333, 1355, 1377, 1399, 1421, 1443, 1465, 1487, 1509, 1531, 1553, 1575, 1596, 1618, 1640, 1662, 1684, 1706, 1728]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 最后一击攻击力 : {value1}%
    # REMOVE: data1 = [0, 887, 977, 1067, 1157, 1247, 1337, 1427, 1517, 1607, 1697, 1787, 1877, 1967, 2057, 2147, 2237, 2327, 2417, 2507, 2597, 2687, 2777, 2867, 2957, 3047, 3137, 3227, 3317, 3407, 3497, 3587, 3677, 3767, 3857, 3947, 4037, 4127, 4217, 4307, 4397, 4487, 4577, 4667, 4757, 4847, 4937, 5027, 5117, 5207, 5297, 5387, 5477, 5567, 5657, 5747, 5837, 5927, 6017, 6107, 6197, 6287, 6377, 6467, 6557, 6647, 6737, 6827, 6917, 7007, 7097]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 火遁·豪火球之术喷吐时间 : {value3}秒
    # REMOVE: data3 = [0, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25, 1.25]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 达成‘临’结印时大小增加比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 达成‘兵’结印时大小增加比率 : {value5}%
    # REMOVE: data5 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 达成‘斗’结印时大小增加比率 : {value6}%
    # REMOVE: data6 = [0, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 达成‘者’结印时大小增加比率 : {value7}%
    # REMOVE: data7 = [0, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 达成‘皆’结印时大小增加比率 : {value8}%
    # REMOVE: data8 = [0, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 达成‘阵’结印时大小增加比率 : {value9}%
    # REMOVE: data9 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [范围信息]
    # 火焰球大小 : {value10}%
    # REMOVE: data10 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)

# 空跃
# thief/kunoichi/d085127b0edd719782bd618d5688f4a1
# ddc49e9ad1ff72a00b53c6cff5b1e920/d085127b0edd719782bd618d5688f4a1
class Skill23(ActiveSkill):
    """
    在跳跃中进行再一次跳跃。
    """
    name = "空跃"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 1
    uuid = "d085127b0edd719782bd618d5688f4a1"
    hasVP = False
    hasUP = False


# 火遁·红莲
# thief/kunoichi/8572675ec6a1f50b6eff6a867376c2de
# ddc49e9ad1ff72a00b53c6cff5b1e920/8572675ec6a1f50b6eff6a867376c2de
class Skill24(ActiveSkill):
    """
    生成强化忍者之力的红莲之火。\n
    红莲之火在持续时间内赋予忍者武器火属性， 增加基本攻击力和技能攻击力。\n
    并在忍者周围旋转， 提高忍者的物理/魔法防御力。\n
    物理/魔法防御力增加效果即时生效。
    """
    name = "火遁·红莲"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    uuid = "8572675ec6a1f50b6eff6a867376c2de"
    hasVP = False
    hasUP = False

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 物理防御力增加 : {value2}
    # REMOVE: data2 = [0, 14082, 14823, 15564, 16305, 17046, 17787, 18529, 19270, 20011, 20752, 21493, 22234, 22975, 23716, 24458, 25199, 25940, 26681, 27422, 28163]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 魔法防御力增加 : {value3}
    # REMOVE: data3 = [0, 14082, 14823, 15564, 16305, 17046, 17787, 18529, 19270, 20011, 20752, 21493, 22234, 22975, 23716, 24458, 25199, 25940, 26681, 27422, 28163]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 忍法 : 幻影手里剑
# thief/kunoichi/4f2e001e9a19eb7bae50ad1840dfb329
# ddc49e9ad1ff72a00b53c6cff5b1e920/4f2e001e9a19eb7bae50ad1840dfb329
class Skill25(ActiveSkill):
    """
    召唤数个幻影， 向敌人连续投掷无数个手里剑。\n
    在空中施放时， 向地面投掷手里剑， 但无法结印。\n
    - [忍术精通追加效果] -\n
    召唤的幻影数量增加。
    """
    name = "忍法 : 幻影手里剑"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 12
    mp = [91, 910]
    uuid = "4f2e001e9a19eb7bae50ad1840dfb329"
    hasVP = False
    hasUP = True

    # 手里剑攻击力 : {value0}%
    # REMOVE: data0 = [0, 308, 339, 370, 402, 433, 464, 495, 527, 558, 589, 620, 652, 683, 714, 745, 777, 808, 839, 870, 902, 933, 964, 995, 1027, 1058, 1089, 1120, 1152, 1183, 1214, 1245, 1277, 1308, 1339, 1370, 1402, 1433, 1464, 1495, 1527, 1558, 1589, 1620, 1652, 1683, 1714, 1745, 1777, 1808, 1839, 1870, 1902, 1933, 1964, 1995, 2027, 2058, 2089, 2120, 2152, 2183, 2214, 2245, 2277, 2308, 2339, 2370, 2402, 2433, 2464]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 投掷数量 : {value1}
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 手里剑反弹次数 : {value2}
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 多段攻击次数上限 : {value3}次
    # REMOVE: data3 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 多段攻击次数下限 : {value4}次
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 临、 兵幻影投掷手里剑攻击力比率 : {value5}%
    # REMOVE: data5 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 斗、 者、 皆、 阵幻影投掷手里剑攻击力比率 : {value6}%
    # REMOVE: data6 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 达成‘临’结印时召唤幻影数增加量 : {value7}
    # REMOVE: data7 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 达成‘兵’结印时召唤幻影数增加量 : {value8}
    # REMOVE: data8 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 达成‘斗’结印时召唤幻影数增加量 : {value9}
    # REMOVE: data9 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 达成‘者’结印时召唤幻影数增加量 : {value10}
    # REMOVE: data10 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 达成‘皆’结印时召唤幻影数增加量 : {value11}
    # REMOVE: data11 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # 达成‘阵’结印时召唤幻影数增加量 : {value12}
    # REMOVE: data12 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)

# 暴击
# thief/kunoichi/fc1262c19f3d0477ee8eda47b8db8696
# ddc49e9ad1ff72a00b53c6cff5b1e920/fc1262c19f3d0477ee8eda47b8db8696
class Skill26(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 忍法 : 原木分身术
# thief/kunoichi/0c262dac3ec41ff79e359ada9c7a7faf
# ddc49e9ad1ff72a00b53c6cff5b1e920/0c262dac3ec41ff79e359ada9c7a7faf
class Skill27(ActiveSkill):
    """
    忍者的固有分身术。\n
    在原地留下一块原木， 然后以肉眼看不见的速度移动一小段距离。\n
    默认向前方移动。 施放技能时按后方向键， 可以向后方移动。\n
    在空中或跳跃中施放时， 直接落地。\n
    施放技能时， 可以消耗[忍法 : 残影术]的残影数量施放， 此时减少冷却时间。
    """
    name = "忍法 : 原木分身术"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 7 #TODO
    rangeLv = 2
    cd = 7
    mp = [200, 200]
    uuid = "0c262dac3ec41ff79e359ada9c7a7faf"
    hasVP = False
    hasUP = False

    # 移动距离 : {value0}px
    # REMOVE: data0 = [0, 300]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [忍法 ： 残影术]施放时冷却时间减少率 : {value1}%
    # REMOVE: data1 = [0, 25]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 火遁·飓风煞
# thief/kunoichi/b8f4966608e4ebb3cc80ba4eac3649bb
# ddc49e9ad1ff72a00b53c6cff5b1e920/b8f4966608e4ebb3cc80ba4eac3649bb
class Skill28(ActiveSkill):
    """
    向前方施放火焰飓风。 飓风会在一定时间后爆炸。\n
    飓风可以吸附周围敌人， 可以使用方向键控制施放方向和施放距离。 \n
    - [忍术精通追加效果] -\n
    增加飓风吸附力和大小。
    """
    name = "火遁·飓风煞"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 17
    mp = [61, 610]
    uuid = "b8f4966608e4ebb3cc80ba4eac3649bb"
    hasVP = False
    hasUP = True

    # 飓风攻击力 : {value0}%
    # REMOVE: data0 = [0, 218, 240, 262, 284, 306, 329, 351, 373, 395, 417, 439, 461, 483, 505, 528, 550, 572, 594, 616, 638, 660, 682, 705, 727, 749, 771, 793, 815, 837, 859, 881, 904, 926, 948, 970, 992, 1014, 1036, 1058, 1081, 1103, 1125, 1147, 1169, 1191, 1213, 1235, 1257, 1280, 1302, 1324, 1346, 1368, 1390, 1412, 1434, 1456, 1479, 1501, 1523, 1545, 1567, 1589, 1611, 1633, 1656, 1678, 1700, 1722, 1744]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 飓风持续时间 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 飓风多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 飓风最后爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 1608, 1771, 1934, 2098, 2261, 2424, 2587, 2750, 2913, 3076, 3239, 3403, 3566, 3729, 3892, 4055, 4218, 4381, 4545, 4708, 4871, 5034, 5197, 5360, 5523, 5687, 5850, 6013, 6176, 6339, 6502, 6665, 6829, 6992, 7155, 7318, 7481, 7644, 7807, 7971, 8134, 8297, 8460, 8623, 8786, 8949, 9112, 9276, 9439, 9602, 9765, 9928, 10091, 10254, 10418, 10581, 10744, 10907, 11070, 11233, 11396, 11560, 11723, 11886, 12049, 12212, 12375, 12538, 12702, 12865]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 每阶段结印飓风大小增加比率 : {value4}%
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 每阶段结印增加爆炸大小比率 : {value5}%
    # REMOVE: data5 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 每阶段结印吸附范围比率 : {value6}%
    # REMOVE: data6 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # [火遁 · 飓风煞]大小 : {value7}%
    # REMOVE: data7 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 苦无精通
# thief/kunoichi/d53301bb328baf12a3ae482cc6a565dd
# ddc49e9ad1ff72a00b53c6cff5b1e920/d53301bb328baf12a3ae482cc6a565dd
class Skill29(PassiveSkill):
    """
    增加武器的魔法攻击力。 使用苦无系列武器时， 增加命中率， 基本攻击时有一定几率向敌人投掷苦无。
    """
    name = "苦无精通"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 3 #TODO
    rangeLv = 3
    uuid = "d53301bb328baf12a3ae482cc6a565dd"
    hasVP = False
    hasUP = False

    # 攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 基本攻击投掷出苦无的几率 : {value2}%
    # REMOVE: data2 = [0, 32, 36, 38, 42, 44, 48, 50, 54, 56, 60, 62, 66, 68, 72, 74, 78, 80, 84, 86, 90]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 烈焰印记
# thief/kunoichi/374f53e8989ef04a8506c8ec99d9ecdc
# ddc49e9ad1ff72a00b53c6cff5b1e920/374f53e8989ef04a8506c8ec99d9ecdc
class Skill30(PassiveSkill):
    """
    增加忍者的基本攻击力和技能攻击力。\n
    [火遁·冥炎业火阵]与一觉前忍术技能额外造成灼伤异常状态伤害。\n
    灼伤攻击力由原技能攻击力进行折算， 且受[忍法 : 残影术]的攻击力比率影响。\n
    该伤害与实际使用的原技能伤害量无关， 成功击中时适用最高伤害量。\n
    [忍法 : 六道轮回]保存的烈焰印记的灼伤伤害不受累积影响， 仍取决于原本伤害量。\n
    烈焰印记追加灼伤的技能 - [火遁 · 豪火球之术]、 [幻影手里剑]、 [火遁 · 飓风煞]、 [火遁 · 螺旋手里剑]、 [火遁 · 炎天道]、 [火遁 · 蟾蜍油炎弹]、 [火遁 · 炎舞天璇]、 [火遁·冥炎业火阵]
    """
    name = "烈焰印记"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "374f53e8989ef04a8506c8ec99d9ecdc"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 追加灼伤攻击力比率 : {value1}%
    # REMOVE: data1 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 灼伤几率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 灼伤持续时间 : {value3}秒
    # REMOVE: data3 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 火遁·螺旋手里剑
# thief/kunoichi/7e904ea3d2a9faa054604e55120a9268
# ddc49e9ad1ff72a00b53c6cff5b1e920/7e904ea3d2a9faa054604e55120a9268
class Skill31(ActiveSkill):
    """
    向前方投掷巨大的手里剑。\n
    手里剑会不断地旋转前进攻击沿途的敌人， 同时被手里剑攻击的敌人会被吸附到手里剑中心并受到多段伤害。\n
    - [忍术精通追加效果] -\n
    增加手里剑爆炸大小。\n
    在决斗场的空中使用时， 手里剑在地面上的持续时间会减少， 但是多段击打攻击力会增加。
    """
    name = "火遁·螺旋手里剑"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 12
    mp = [91, 910]
    uuid = "7e904ea3d2a9faa054604e55120a9268"
    hasVP = False
    hasUP = True

    # 旋转时多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 202, 223, 243, 264, 284, 305, 325, 346, 366, 387, 407, 428, 448, 469, 490, 510, 531, 551, 572, 592, 613, 633, 654, 674, 695, 715, 736, 756, 777, 797, 818, 838, 859, 879, 900, 920, 941, 961, 982, 1002, 1023, 1044, 1064, 1085, 1105, 1126, 1146, 1167, 1187, 1208, 1228, 1249, 1269, 1290, 1310, 1331, 1351, 1372, 1392, 1413, 1433, 1454, 1474, 1495, 1515, 1536, 1556, 1577, 1598, 1618]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 最后爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 6608, 7278, 7948, 8619, 9289, 9959, 10630, 11300, 11971, 12641, 13311, 13982, 14652, 15322, 15993, 16663, 17333, 18004, 18674, 19344, 20015, 20685, 21355, 22026, 22696, 23367, 24037, 24707, 25378, 26048, 26718, 27389, 28059, 28729, 29400, 30070, 30740, 31411, 32081, 32751, 33422, 34092, 34762, 35433, 36103, 36774, 37444, 38114, 38785, 39455, 40125, 40796, 41466, 42136, 42807, 43477, 44147, 44818, 45488, 46158, 46829, 47499, 48169, 48840, 49510, 50181, 50851, 51521, 52192, 52862]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 每阶段结印增加最后爆炸大小比率 : {value2}%
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 在空中使用时， 手里剑持续时间变换率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 在空中使用时， 手里剑多段攻击力变换率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 最后爆炸大小: {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 忍法 : 残影术
# thief/kunoichi/dbf8b30c7057032af0d68fcfa289fdae
# ddc49e9ad1ff72a00b53c6cff5b1e920/dbf8b30c7057032af0d68fcfa289fdae
class Skill32(ActiveSkill):
    """
    施放技能时， 可以生成残影代替忍者继续施放当前技能。  \n
    进入地下城后自动发动该技能， 发动后强制取消当前技能时， 会出现残影继续代替忍者使用强制取消的技能。\n
    残影经过一段时间后会恢复， 且可以连续施放。  \n
       该技能无法享受[忍术精通]的加成。\n
    在决斗场中， 残影施放的技能会受到结印数量的影响， 并存在前置冷却时间。
    """
    name = "忍法 : 残影术"
    learnLv = 35
    masterLv = 1
    maxLv = 11
    position = 3 #TODO
    rangeLv = 5
    cd = 15
    mp = [128, 1280]
    uuid = "dbf8b30c7057032af0d68fcfa289fdae"
    hasVP = False
    hasUP = False

    # 残影使用技能时攻击力比率 : {value0}%
    # REMOVE: data0 = [0, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 残影数量上限 : {value1}
    # REMOVE: data1 = [0, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 残影恢复时间 : {value2}秒
    # REMOVE: data2 = [0, 6, 5.6, 5.2, 4.8, 4.4, 4, 3.6, 3.2, 2.8, 2.4, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 决斗场前置冷却时间 : {value3}秒
    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 火遁·炎天道
# thief/kunoichi/5152480fdde81362575a488d4cec4af9
# ddc49e9ad1ff72a00b53c6cff5b1e920/5152480fdde81362575a488d4cec4af9
class Skill33(ActiveSkill):
    """
    在地面引发强烈爆炸使敌人浮空， 然后， 跳起将火焰球扔向地面， 引发巨大爆炸。
    """
    name = "火遁·炎天道"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [128, 1280]
    uuid = "5152480fdde81362575a488d4cec4af9"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 地面爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 412, 454, 496, 538, 579, 621, 663, 705, 747, 788, 830, 872, 914, 956, 997, 1039, 1081, 1123, 1165, 1207, 1248, 1290, 1332, 1374, 1416, 1457, 1499, 1541, 1583, 1625, 1666, 1708, 1750, 1792, 1834, 1875, 1917, 1959, 2001, 2043, 2085, 2126, 2168, 2210, 2252, 2294, 2335, 2377, 2419, 2461, 2503, 2544, 2586, 2628, 2670, 2712, 2753, 2795, 2837, 2879, 2921, 2963, 3004, 3046, 3088, 3130, 3172, 3213, 3255, 3297]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 空中生成的火焰球攻击力 : {value1}%
    # REMOVE: data1 = [0, 1236, 1362, 1487, 1613, 1738, 1864, 1989, 2114, 2240, 2365, 2491, 2616, 2742, 2867, 2992, 3118, 3243, 3369, 3494, 3620, 3745, 3870, 3996, 4121, 4247, 4372, 4498, 4623, 4748, 4874, 4999, 5125, 5250, 5376, 5501, 5626, 5752, 5877, 6003, 6128, 6254, 6379, 6504, 6630, 6755, 6881, 7006, 7132, 7257, 7382, 7508, 7633, 7759, 7884, 8010, 8135, 8260, 8386, 8511, 8637, 8762, 8888, 9013, 9138, 9264, 9389, 9515, 9640, 9766, 9891]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 火焰球直接打击攻击力 : {value2}%
    # REMOVE: data2 = [0, 820, 903, 986, 1069, 1152, 1236, 1319, 1402, 1485, 1568, 1651, 1735, 1818, 1901, 1984, 2067, 2151, 2234, 2317, 2400, 2483, 2566, 2650, 2733, 2816, 2899, 2982, 3065, 3149, 3232, 3315, 3398, 3481, 3564, 3648, 3731, 3814, 3897, 3980, 4063, 4147, 4230, 4313, 4396, 4479, 4562, 4646, 4729, 4812, 4895, 4978, 5061, 5145, 5228, 5311, 5394, 5477, 5560, 5644, 5727, 5810, 5893, 5976, 6059, 6143, 6226, 6309, 6392, 6475, 6558]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 火焰球爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 7650, 8426, 9202, 9978, 10754, 11531, 12307, 13083, 13859, 14635, 15411, 16187, 16963, 17739, 18515, 19291, 20068, 20844, 21620, 22396, 23172, 23948, 24724, 25500, 26276, 27052, 27829, 28605, 29381, 30157, 30933, 31709, 32485, 33261, 34037, 34813, 35589, 36366, 37142, 37918, 38694, 39470, 40246, 41022, 41798, 42574, 43350, 44126, 44903, 45679, 46455, 47231, 48007, 48783, 49559, 50335, 51111, 51887, 52664, 53440, 54216, 54992, 55768, 56544, 57320, 58096, 58872, 59648, 60424, 61201]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 达成‘临’结印时大小增加比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 达成‘兵’结印时大小增加比率 : {value5}%
    # REMOVE: data5 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 达成‘斗’结印时大小增加比率 : {value6}%
    # REMOVE: data6 = [0, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118, 118]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 达成‘者’结印时大小增加比率 : {value7}%
    # REMOVE: data7 = [0, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124, 124]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 达成‘皆’结印时大小增加比率 : {value8}%
    # REMOVE: data8 = [0, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 达成‘阵’结印时大小增加比率 : {value9}%
    # REMOVE: data9 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [范围信息]
    # 爆炸大小 : {value10}%
    # REMOVE: data10 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)

    def vp_1(self):
        """
        [火遁·炎天道]\n
        在爆炸点生成火焰地带\n
         - 使进入火焰地带的敌人进入强制控制状态\n
        烈焰印记灼伤伤害额外 +20%\n
         - 命中时， 始终造成技能最大伤害量50%的伤害\n
         - 伤害量不受[忍法 : 六道轮回]充能率的影响\n
         - 技能攻击力 -14%\n
        将[火遁·炎天道]记录在[忍法 : 六道轮回]时， 赋予以下效果\n
         - 施放时， 攻击、 移动、 施放速度 +10%， 持续10秒\n
         - 施放强化残影攻击时， 一次性结算剩余灼伤伤害
        """
        ...

    def vp_2(self):
        """
        [火遁·炎天道]\n
        向前方最强敌人投掷火焰球\n
         - 删除地面爆炸和空中火焰攻击\n
         - 总攻击力相同\n
        火焰球命中时恢复1个[忍法 : 残影术]残影
        """
        ...

# 忍法 : 替身术
# thief/kunoichi/2391a27457b5a8c6fa4b4670a91bdd11
# ddc49e9ad1ff72a00b53c6cff5b1e920/2391a27457b5a8c6fa4b4670a91bdd11
class Skill34(ActiveSkill):
    """
    隐身后引发爆炸， 并与周围的敌人对换位置。 对换位置时， 会为敌人附着起爆符。 换位后， 忍者会扔出苦无引爆起爆符。\n
    与附近敌人无法对换位置时， 使用木头替代自身。\n
    对无法抓取的敌人不适用控制效果。\n
    可在被击和倒地状态下忽略被击和倒地动作立即使用。\n
    与[忍法 : 影分身]共享冷却时间。\n
    在决斗场中， 无法使用该技能。
    """
    name = "忍法 : 替身术"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 3
    cd = 25
    mp = [91, 910]
    uuid = "2391a27457b5a8c6fa4b4670a91bdd11"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 地面爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 4545, 5270, 5995, 6719, 7444, 8168, 8893, 9618, 10342, 11067, 11791, 12516, 13241, 13965, 14690, 15414, 16139, 16864, 17588, 18313, 19037, 19762, 20487, 21211, 21936, 22661, 23385, 24110, 24834, 25559, 26284, 27008, 27733, 28457, 29182, 29907, 30631, 31356, 32080, 32805, 33530, 34254, 34979, 35704, 36428, 37153, 37877, 38602, 39327, 40051, 40776, 41500, 42225, 42950, 43674, 44399, 45123, 45848, 46573, 47297, 48022, 48746, 49471, 50196, 50920, 51645, 52370, 53094, 53819, 54543]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 苦无攻击力 : {value1}%
    # REMOVE: data1 = [0, 2728, 3162, 3597, 4032, 4467, 4902, 5337, 5771, 6206, 6641, 7076, 7511, 7945, 8380, 8815, 9250, 9685, 10120, 10554, 10989, 11424, 11859, 12294, 12729, 13163, 13598, 14033, 14468, 14903, 15338, 15772, 16207, 16642, 17077, 17512, 17947, 18381, 18816, 19251, 19686, 20121, 20555, 20990, 21425, 21860, 22295, 22730, 23164, 23599, 24034, 24469, 24904, 25339, 25773, 26208, 26643, 27078, 27513, 27948, 28382, 28817, 29252, 29687, 30122, 30557, 30991, 31426, 31861, 32296, 32731]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起爆符爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 12003, 13917, 15830, 17744, 19657, 21571, 23484, 25398, 27312, 29225, 31139, 33052, 34966, 36879, 38793, 40706, 42620, 44533, 46447, 48361, 50274, 52188, 54101, 56015, 57928, 59842, 61755, 63669, 65583, 67496, 69410, 71323, 73237, 75150, 77064, 78977, 80891, 82804, 84718, 86632, 88545, 90459, 92372, 94286, 96199, 98113, 100026, 101940, 103853, 105767, 107681, 109594, 111508, 113421, 115335, 117248, 119162, 121075, 122989, 124903, 126816, 128730, 130643, 132557, 134470, 136384, 138297, 140211, 142124, 144038]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 爆炸大小: {value3}%
    # REMOVE: data3 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [忍法 : 替身术]\n
        攻击范围 +50%\n
        可记录在[忍法 : 六道轮回]\n
         - 技能攻击力 -33%\n
        追加烈焰印记灼伤伤害\n
         - 命中时， 始终造成技能最大伤害量30%的伤害\n
         - 伤害量不受[忍法 : 六道轮回]充能率的影响\n
         - 技能攻击力 -25%\n
        将[忍法 : 替身术]记录在[忍法 : 六道轮回]时， 赋予以下效果\n
         - 施放强化残影攻击时， 一次性结算剩余灼伤伤害
        """
        ...

    def vp_2(self):
        """
        [忍法 : 替身术]\n
        技能结束后适用附加效果， 效果持续5秒\n
         - 所受伤害 -50%\n
         - 进入霸体状态
        """
        ...

# 忍法 : 六道轮回
# thief/kunoichi/5892d1fa4462e561ac8f8d2c74892b0a
# ddc49e9ad1ff72a00b53c6cff5b1e920/5892d1fa4462e561ac8f8d2c74892b0a
class Skill35(ActiveSkill):
    """
    忍者领悟火焰忍术真谛后习得秘术， 学习后， 周围出现逐渐变强的燃烧火焰， 并累积残影攻击力。\n
    施放后， 在持续时间内每次施放忍术技能时凝聚火焰并累积该技能攻击力， 再次按技能键或持续时间结束时， 出现强化后的残影， 并用强大的炎舞将敌人燃烧殆尽。\n
    伤害取决于累积的忍术技能攻击力。\n
    强化的残影攻击力按施放技能前的累积程度成比例增加， 并受冷却时间相关的属性影响。\n
    同一个技能最多只能保存3次。\n
    [忍法 : 残影术]每次消耗残影时， 可保存的持续时间增加。\n
    残影为无敌状态， 无法被敌人攻击。\n
    可保存的技能 - 火遁·豪火球之术、 火遁·飓风煞、 忍法 : 幻影手里剑、 火遁·螺旋手里剑、 火遁 : 炎天道、 火遁 : 蟾蜍油炎弹、 火遁 : 炎舞天璇、 火遁·风魔手里剑、 八岐大蛇、 天照
    """
    name = "忍法 : 六道轮回"
    learnLv = 40
    masterLv = 1
    maxLv = 11
    position = 5 #TODO
    rangeLv = 3
    cd = 20
    mp = [164, 1640]
    uuid = "5892d1fa4462e561ac8f8d2c74892b0a"
    hasVP = False
    hasUP = False

    # 保存技能个数上限 : {value0}
    # REMOVE: data0 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 火焰残影攻击力最大比率 : {value1}%
    # REMOVE: data1 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最大累积时间 : 20秒
    # 可保存的持续时间 : {value2}秒
    # REMOVE: data2 = [0, 30, 31, 31, 32, 32, 33, 33, 34, 34, 35, 35]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每次消耗残影时可保存的持续时间增加 : {value3}秒
    # REMOVE: data3 = [0, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8, 0.8]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 范围 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 火遁·蟾蜍油炎弹
# thief/kunoichi/fc458e449ee00b01dbf88d09aae65462
# ddc49e9ad1ff72a00b53c6cff5b1e920/fc458e449ee00b01dbf88d09aae65462
class Skill36(ActiveSkill):
    """
    召唤火焰蟾蜍。\n
    蟾蜍倒吸一口气后向前发射一个大型油炎弹。 \n
    油炎弹爆炸范围随[忍术精通]技能的结印阶段增加。\n
    可在空中施放， 同时会增加火焰蟾蜍登场时的冲击波范围。\n
    - [忍术精通追加效果] -\n
    增加油炎弹的爆炸大小。
    """
    name = "火遁·蟾蜍油炎弹"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [164, 1640]
    uuid = "fc458e449ee00b01dbf88d09aae65462"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 火焰蟾蜍登场时冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 350, 385, 421, 456, 492, 527, 563, 598, 634, 669, 705, 740, 776, 811, 847, 882, 918, 953, 989, 1024, 1059, 1095, 1130, 1166, 1201, 1237, 1272, 1308, 1343, 1379, 1414, 1450, 1485, 1521, 1556, 1592, 1627, 1663, 1698, 1734, 1769, 1805, 1840, 1876, 1911, 1947, 1982, 2018, 2053, 2089, 2124, 2159, 2195, 2230, 2266, 2301, 2337, 2372, 2408, 2443, 2479, 2514, 2550, 2585, 2621, 2656, 2692, 2727, 2763, 2798]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 油炎弹攻击力 : {value1}%
    # REMOVE: data1 = [0, 1390, 1531, 1672, 1812, 1953, 2094, 2235, 2376, 2517, 2658, 2799, 2940, 3081, 3222, 3363, 3504, 3645, 3786, 3927, 4068, 4209, 4350, 4491, 4632, 4773, 4914, 5055, 5196, 5337, 5478, 5619, 5760, 5901, 6042, 6183, 6324, 6465, 6606, 6747, 6887, 7028, 7169, 7310, 7451, 7592, 7733, 7874, 8015, 8156, 8297, 8438, 8579, 8720, 8861, 9002, 9143, 9284, 9425, 9566, 9707, 9848, 9989, 10130, 10271, 10412, 10553, 10694, 10835, 10976, 11117]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 油炎弹爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 11170, 12303, 13436, 14569, 15702, 16836, 17969, 19102, 20235, 21368, 22501, 23634, 24768, 25901, 27034, 28167, 29300, 30433, 31567, 32700, 33833, 34966, 36099, 37232, 38366, 39499, 40632, 41765, 42898, 44031, 45165, 46298, 47431, 48564, 49697, 50830, 51964, 53097, 54230, 55363, 56496, 57629, 58762, 59896, 61029, 62162, 63295, 64428, 65561, 66695, 67828, 68961, 70094, 71227, 72360, 73494, 74627, 75760, 76893, 78026, 79159, 80293, 81426, 82559, 83692, 84825, 85958, 87091, 88225, 89358]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 火焰蟾蜍消失时攻击力 : {value3}%
    # REMOVE: data3 = [0, 350, 385, 421, 456, 492, 527, 563, 598, 634, 669, 705, 740, 776, 811, 847, 882, 918, 953, 989, 1024, 1059, 1095, 1130, 1166, 1201, 1237, 1272, 1308, 1343, 1379, 1414, 1450, 1485, 1521, 1556, 1592, 1627, 1663, 1698, 1734, 1769, 1805, 1840, 1876, 1911, 1947, 1982, 2018, 2053, 2089, 2124, 2159, 2195, 2230, 2266, 2301, 2337, 2372, 2408, 2443, 2479, 2514, 2550, 2585, 2621, 2656, 2692, 2727, 2763, 2798]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 在空中召唤时火焰蟾蜍登场时冲击波范围增加比率 : {value4}%
    # REMOVE: data4 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 达成‘临’结印时油炎弹爆炸大小 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 达成‘兵’结印时油炎弹爆炸大小 : {value6}%
    # REMOVE: data6 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 达成‘斗’结印时油炎弹爆炸大小 : {value7}%
    # REMOVE: data7 = [0, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 达成‘者’结印时油炎弹爆炸大小 : {value8}%
    # REMOVE: data8 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 达成‘皆’结印时油炎弹爆炸大小 : {value9}%
    # REMOVE: data9 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 达成‘阵’结印时油炎弹爆炸大小 : {value10}%
    # REMOVE: data10 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # [范围信息]
    # 爆炸大小 : {value11}%
    # REMOVE: data11 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)

    def vp_1(self):
        """
        [火遁·蟾蜍油炎弹]\n
        变更登场位置\n
        蟾蜍大小 +50%\n
        油炎弹爆炸范围 +30%\n
        蟾蜍登场及油炎弹发射速度 +50%\n
        删除登场、 消失、 油炎弹攻击的攻击力\n
         - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [火遁·蟾蜍油炎弹]\n
        冷却时间和攻击力 +70%\n
        消耗[八尺琼勾玉]的红色勾玉时， 适用附加效果， 效果持续20秒\n
         - 攻击、 移动、 施放速度 +10%\n
         - 物理和魔法防御力 +5000
        """
        ...

# 火遁·炎舞天璇
# thief/kunoichi/1812a1ece67bb37b6b44b54766450064
# ddc49e9ad1ff72a00b53c6cff5b1e920/1812a1ece67bb37b6b44b54766450064
class Skill37(ActiveSkill):
    """
    施展秘笈， 以肉眼无法辨别的速度快速舞动斩击敌人， 随后绽放出如炎玉一般的红莲之花对敌人进行多段攻击。 最后一击会出现更大的红莲之花攻击敌人。\n
    多段攻击次数越多， 则最后的火焰爆炸范围越大。\n
    按跳跃键， 可中断多段攻击， 立即施放最后一击； 快速舞动斩击时， 若按跳跃键， 则可立即施放红莲之花。\n
    [忍术精通追加效果]\n
    增加斩击速度。
    """
    name = "火遁·炎舞天璇"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [311, 3110]
    uuid = "1812a1ece67bb37b6b44b54766450064"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 806, 888, 969, 1051, 1133, 1215, 1297, 1378, 1460, 1542, 1624, 1705, 1787, 1869, 1951, 2032, 2114, 2196, 2278, 2359, 2441, 2523, 2605, 2687, 2768, 2850, 2932, 3014, 3095, 3177, 3259, 3341, 3422, 3504, 3586, 3668, 3750, 3831, 3913, 3995, 4077, 4158, 4240, 4322, 4404, 4485, 4567, 4649, 4731, 4812, 4894, 4976, 5058, 5140, 5221, 5303, 5385, 5467, 5548, 5630, 5712, 5794, 5875, 5957, 6039, 6121, 6202, 6284, 6366, 6448]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 红莲之花多段攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 244, 269, 294, 318, 343, 368, 393, 417, 442, 467, 492, 516, 541, 566, 591, 615, 640, 665, 690, 714, 739, 764, 789, 813, 838, 863, 888, 912, 937, 962, 987, 1011, 1036, 1061, 1086, 1110, 1135, 1160, 1185, 1209, 1234, 1259, 1284, 1309, 1333, 1358, 1383, 1408, 1432, 1457, 1482, 1507, 1531, 1556, 1581, 1606, 1630, 1655, 1680, 1705, 1729, 1754, 1779, 1804, 1828, 1853, 1878, 1903, 1927, 1952]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 斩击多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 红莲之花多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后一击攻击力 : {value4}%
    # REMOVE: data4 = [0, 6636, 7309, 7982, 8655, 9329, 10002, 10675, 11348, 12021, 12694, 13368, 14041, 14714, 15387, 16060, 16734, 17407, 18080, 18753, 19426, 20100, 20773, 21446, 22119, 22792, 23466, 24139, 24812, 25485, 26158, 26831, 27505, 28178, 28851, 29524, 30197, 30871, 31544, 32217, 32890, 33563, 34237, 34910, 35583, 36256, 36929, 37603, 38276, 38949, 39622, 40295, 40969, 41642, 42315, 42988, 43661, 44334, 45008, 45681, 46354, 47027, 47700, 48374, 49047, 49720, 50393, 51066, 51740, 52413, 53086]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 每阶段结印增加斩击速度 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 最后爆炸大小: {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [火遁·炎舞天璇]\n
        斩击次数 -5次\n
         - 总攻击力相同\n
        出现火焰残影， 一起释放火焰之花\n
        增加最后一击攻击范围
        """
        ...

    def vp_2(self):
        """
        [火遁·炎舞天璇]\n
        通过[忍法 : 残影术]强制中断[火遁·炎舞天璇]时， 进入无敌状态1秒\n
        [火遁·炎舞天璇]的蓄气时间 -90%
        """
        ...

# 暗炎残星
# thief/kunoichi/d89f26862e348a801b30bb9fd7125db5
# ddc49e9ad1ff72a00b53c6cff5b1e920/d89f26862e348a801b30bb9fd7125db5
class Skill38(PassiveSkill):
    """
    掌握暗炎之术， 忍者击中的敌人时， 会将敌人标记为追踪目标。\n
    被标记为追踪目标的敌人头上会生成追踪标记。 忍者能对有追踪标记的敌人造成更高的暴击伤害。\n
    追踪标记经过一定时间后消失。\n
    [当敌人察觉到自己成为被猎杀的目标时， 他的心脏早就停止了跳动。]
    """
    name = "暗炎残星"
    learnLv = 45
    masterLv = 1
    maxLv = 11
    position = 3 #TODO
    rangeLv = 5
    uuid = "d89f26862e348a801b30bb9fd7125db5"
    hasVP = False
    hasUP = False

    # 暴击伤害增加率 : {value0}%
    # REMOVE: data0 = [0, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 追踪标记持续时间 : {value1}秒
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 毕方之印
# thief/kunoichi/2c9d9a36c8401bddff6cdb80fab8dc24
# ddc49e9ad1ff72a00b53c6cff5b1e920/2c9d9a36c8401bddff6cdb80fab8dc24
class Skill39(PassiveSkill):
    """
    引燃毕方之炎周围敌人的灵魂并产生爆炸， 增加属性攻击力和魔法暴击率。\n
    离忍者较近的敌人会附加“炎”烙印， 较远的敌人附加“火”烙印。\n
    被附加火烙印和炎烙印的敌人会受到周期性的火属性伤害。\n
    火烙印和炎烙印消失时， 将给与敌人火属性爆炸伤害。\n
    [掌握毕方之印的毕方之炎忍术变得更精湛， 被她的火焰吞噬的敌人将消失无踪。]
    """
    name = "毕方之印"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 3
    uuid = "2c9d9a36c8401bddff6cdb80fab8dc24"
    hasVP = False
    hasUP = False

    # 属性攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 火烙印生成距离 : {value2}px
    # REMOVE: data2 = [0, 450, 451, 452, 453, 454, 455, 456, 457, 458, 459, 460, 461, 462, 463, 464, 465, 466, 467, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 火烙印多段攻击力 : {value3}%
    # REMOVE: data3 = [0, 169, 196, 223, 250, 277, 304, 331, 358, 384, 411, 438, 465, 492, 519, 546, 573, 600, 627, 654, 681, 708, 735, 762, 789, 815, 842, 869, 896, 923, 950, 977, 1004, 1031, 1058, 1085, 1112, 1139, 1166, 1193, 1220, 1246, 1273, 1300, 1327, 1354, 1381, 1408, 1435, 1462, 1489]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 火烙印多段攻击间隔 : {value4}秒
    # REMOVE: data4 = [0, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 火烙印持续时间 : {value5}秒
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 火烙印爆炸攻击力 : {value6}%
    # REMOVE: data6 = [0, 423, 490, 557, 625, 692, 760, 827, 894, 962, 1029, 1096, 1164, 1231, 1299, 1366, 1433, 1501, 1568, 1635, 1703, 1770, 1838, 1905, 1972, 2040, 2107, 2174, 2242, 2309, 2377, 2444, 2511, 2579, 2646, 2713, 2781, 2848, 2916, 2983, 3050, 3118, 3185, 3252, 3320, 3387, 3455, 3522, 3589, 3657, 3724]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 炎烙印生成距离: {value7}px
    # REMOVE: data7 = [0, 90, 90, 90, 91, 91, 91, 91, 91, 92, 92, 92, 92, 92, 93, 93, 93, 93, 93, 94, 94, 94, 94, 94, 95, 95, 95, 95, 95, 96, 96, 96, 96, 96, 97, 97, 97, 97, 97, 98, 98, 98, 98, 98, 99, 99, 99, 99, 99, 100, 100]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 炎烙印多段攻击力 : {value8}%
    # REMOVE: data8 = [0, 203, 235, 268, 300, 332, 365, 397, 429, 462, 494, 526, 559, 591, 623, 656, 688, 720, 753, 785, 817, 850, 882, 914, 947, 979, 1011, 1044, 1076, 1108, 1141, 1173, 1205, 1238, 1270, 1302, 1335, 1367, 1399, 1432, 1464, 1496, 1529, 1561, 1593, 1626, 1658, 1691, 1723, 1755, 1788]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 炎烙印多段攻击间隔 : {value9}秒
    # REMOVE: data9 = [0, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 炎烙印持续时间 : {value10}秒
    # REMOVE: data10 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 炎烙印爆炸攻击力 : {value11}%
    # REMOVE: data11 = [0, 203, 235, 268, 300, 332, 365, 397, 430, 462, 494, 527, 559, 591, 624, 656, 688, 721, 753, 786, 818, 850, 883, 915, 947, 980, 1012, 1044, 1077, 1109, 1142, 1174, 1206, 1239, 1271, 1303, 1336, 1368, 1400, 1433, 1465, 1498, 1530, 1562, 1595, 1627, 1659, 1692, 1724, 1756, 1789]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)

# 火遁·冥炎业火阵
# thief/kunoichi/2ba299855fc22192cba4f73db75e9d0e
# ddc49e9ad1ff72a00b53c6cff5b1e920/2ba299855fc22192cba4f73db75e9d0e
class Skill40(ActiveSkill):
    """
    召唤出消灭敌人的冥炎业火阵给予敌人火属性伤害。\n
    之后依次激活阵法结印， 6个结印全部激活后同时引爆毁灭敌人。
    """
    name = "火遁·冥炎业火阵"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [881, 7403]
    uuid = "2ba299855fc22192cba4f73db75e9d0e"
    hasVP = False
    hasUP = False

    # 业火阵出现时攻击力 : {value0}%
    # REMOVE: data0 = [0, 5368, 6613, 7858, 9103, 10348, 11593, 12838, 14082, 15327, 16572, 17817, 19062, 20307, 21552, 22797, 24041, 25286, 26531, 27776, 29021, 30266, 31511, 32755, 34000, 35245, 36490, 37735, 38980, 40225, 41469, 42714, 43959, 45204, 46449, 47694, 48939, 50183, 51428, 52673, 53918, 55163, 56408, 57653, 58897, 60142, 61387, 62632, 63877, 65122, 66367]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 业火阵爆炸时攻击力 : {value1}%
    # REMOVE: data1 = [0, 7316, 9012, 10709, 12405, 14102, 15798, 17494, 19191, 20887, 22584, 24280, 25977, 27673, 29369, 31066, 32762, 34459, 36155, 37852, 39548, 41244, 42941, 44637, 46334, 48030, 49727, 51423, 53119, 54816, 56512, 58209, 59905, 61602, 63298, 64994, 66691, 68387, 70084, 71780, 73477, 75173, 76869, 78566, 80262, 81959, 83655, 85352, 87048, 88744, 90441]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 吸附敌人时火焰攻击力 : {value2}%
    # REMOVE: data2 = [0, 1509, 1859, 2209, 2558, 2908, 3258, 3608, 3958, 4308, 4658, 5007, 5357, 5707, 6057, 6407, 6757, 7107, 7456, 7806, 8156, 8506, 8856, 9206, 9556, 9905, 10255, 10605, 10955, 11305, 11655, 12005, 12355, 12704, 13054, 13404, 13754, 14104, 14454, 14804, 15153, 15503, 15853, 16203, 16553, 16903, 17253, 17602, 17952, 18302, 18652]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 结印出现时攻击力 : {value3}%
    # REMOVE: data3 = [0, 10382, 12789, 15196, 17604, 20011, 22418, 24826, 27233, 29640, 32048, 34455, 36862, 39270, 41677, 44084, 46492, 48899, 51306, 53714, 56121, 58529, 60936, 63343, 65751, 68158, 70565, 72973, 75380, 77787, 80195, 82602, 85009, 87417, 89824, 92231, 94639, 97046, 99453, 101861, 104268, 106675, 109083, 111490, 113897, 116305, 118712, 121119, 123527, 125934, 128341]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 结印爆炸时攻击力 : {value4}%
    # REMOVE: data4 = [0, 12189, 15015, 17841, 20668, 23494, 26321, 29147, 31973, 34800, 37626, 40452, 43279, 46105, 48931, 51758, 54584, 57411, 60237, 63063, 65890, 68716, 71542, 74369, 77195, 80021, 82848, 85674, 88501, 91327, 94153, 96980, 99806, 102632, 105459, 108285, 111111, 113938, 116764, 119591, 122417, 125243, 128070, 130896, 133722, 136549, 139375, 142201, 145028, 147854, 150681]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 业火阵范围内攻击力 : {value5}%
    # REMOVE: data5 = [0, 710, 875, 1039, 1204, 1369, 1533, 1698, 1863, 2027, 2192, 2357, 2521, 2686, 2851, 3015, 3180, 3345, 3509, 3674, 3839, 4003, 4168, 4333, 4497, 4662, 4827, 4991, 5156, 5321, 5485, 5650, 5815, 5979, 6144, 6309, 6473, 6638, 6802, 6967, 7132, 7296, 7461, 7626, 7790, 7955, 8120, 8284, 8449, 8614, 8778]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 业火阵多段攻击次数 : {value6}次
    # REMOVE: data6 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 忍法 : 飞燕手里剑
# thief/kunoichi/b89c9ab317bc0a443f6497b7cca2f6a8
# ddc49e9ad1ff72a00b53c6cff5b1e920/b89c9ab317bc0a443f6497b7cca2f6a8
class Skill41(ActiveSkill):
    """
    像燕子一样飞向空中后跟火焰残影一起发射手里剑。\n
    忍者闪烁移动时， 可将附近的敌人往中间聚集， 并与火焰残影一起连续发射手里剑。\n
    可以在自身被击或倒地状态下施放该技能； 若在空中施放该技能， 最后一击则更变为发射苦无。\n
    [忍法 : 飞燕手里剑]的手里剑贯穿敌人时， 可以对敌人附着封印力量的符咒， 在最终爆炸之前强控敌人。\n
    [忍法 : 六道轮回]无法记录该技能。
    """
    name = "忍法 : 飞燕手里剑"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [400, 1120]
    uuid = "b89c9ab317bc0a443f6497b7cca2f6a8"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 手里剑地面爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 186, 205, 224, 243, 262, 281, 300, 319, 338, 357, 376, 394, 413, 432, 451, 470, 489, 508, 527, 546, 565, 584, 602, 621, 640, 659, 678, 697, 716, 735, 754, 773, 792, 810, 829, 848, 867, 886, 905, 924, 943, 962, 981, 1000, 1018, 1037, 1056, 1075, 1094, 1113]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 闪烁移动攻击力 : {value1}%
    # REMOVE: data1 = [0, 230, 253, 276, 300, 323, 346, 369, 393, 416, 439, 463, 486, 509, 533, 556, 579, 602, 626, 649, 672, 696, 719, 742, 766, 789, 812, 835, 859, 882, 905, 929, 952, 975, 999, 1022, 1045, 1068, 1092, 1115, 1138, 1162, 1185, 1208, 1232, 1255, 1278, 1301, 1325, 1348, 1371]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 闪烁移动时发射的穿刺手里剑攻击力 : {value2}%
    # REMOVE: data2 = [0, 262, 289, 316, 342, 369, 396, 422, 449, 475, 502, 529, 555, 582, 609, 635, 662, 688, 715, 742, 768, 795, 822, 848, 875, 902, 928, 955, 981, 1008, 1035, 1061, 1088, 1115, 1141, 1168, 1194, 1221, 1248, 1274, 1301, 1328, 1354, 1381, 1407, 1434, 1461, 1487, 1514, 1541, 1567]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 闪烁移动时手里剑爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 130, 143, 156, 170, 183, 196, 209, 222, 235, 249, 262, 275, 288, 301, 315, 328, 341, 354, 367, 381, 394, 407, 420, 433, 446, 460, 473, 486, 499, 512, 526, 539, 552, 565, 578, 592, 605, 618, 631, 644, 657, 671, 684, 697, 710, 723, 737, 750, 763, 776]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 闪烁移动时手里剑多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 闪烁移动时发射的穿刺多段攻击次数 : {value5}次
    # REMOVE: data5 = [0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 闪烁移动时手里剑爆炸多段攻击次数 : {value6}次
    # REMOVE: data6 = [0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 最后一闪攻击力 : {value7}%
    # REMOVE: data7 = [0, 919, 1012, 1105, 1198, 1292, 1385, 1478, 1571, 1664, 1758, 1851, 1944, 2037, 2130, 2224, 2317, 2410, 2503, 2596, 2690, 2783, 2876, 2969, 3062, 3156, 3249, 3342, 3435, 3528, 3622, 3715, 3808, 3901, 3994, 4088, 4181, 4274, 4367, 4460, 4554, 4647, 4740, 4833, 4926, 5020, 5113, 5206, 5299, 5392, 5486]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 最后一击穿刺攻击力 : {value8}%
    # REMOVE: data8 = [0, 765, 842, 920, 997, 1075, 1152, 1230, 1307, 1385, 1463, 1540, 1618, 1695, 1773, 1850, 1928, 2005, 2083, 2161, 2238, 2316, 2393, 2471, 2548, 2626, 2704, 2781, 2859, 2936, 3014, 3091, 3169, 3246, 3324, 3402, 3479, 3557, 3634, 3712, 3789, 3867, 3944, 4022, 4100, 4177, 4255, 4332, 4410, 4487, 4565]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 最后一击手里剑爆炸攻击力 : {value9}%
    # REMOVE: data9 = [0, 1068, 1176, 1285, 1393, 1502, 1610, 1718, 1827, 1935, 2043, 2152, 2260, 2368, 2477, 2585, 2693, 2802, 2910, 3019, 3127, 3235, 3344, 3452, 3560, 3669, 3777, 3885, 3994, 4102, 4210, 4319, 4427, 4536, 4644, 4752, 4861, 4969, 5077, 5186, 5294, 5402, 5511, 5619, 5727, 5836, 5944, 6053, 6161, 6269, 6378]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 最后一击手里剑爆炸多段攻击次数 : {value10}次
    # REMOVE: data10 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 被击或倒地状态下使用时攻击力增加比率 : {value11}%
    # REMOVE: data11 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # 在空中使用时， 最后一击投掷苦无数增加量 : {value12}
    # REMOVE: data12 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)
    # [范围信息]
    # 最后爆炸大小 : {value13}%
    # REMOVE: data13 = [0, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180, 180]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13, lambda x = None: x)

    def vp_1(self):
        """
        [忍法 : 飞燕手里剑]\n
        命中时， 初始化[忍法 : 原木分身术]的冷却时间\n
        强制控制时间 +1秒\n
        技能结束后， 额外进入0.5秒的无敌状态
        """
        ...

    def vp_2(self):
        """
        [忍法 : 飞燕手里剑]\n
        闪烁速度 +30%\n
        手里剑爆炸范围 +30%\n
        判定为忍术技能\n
         - 可记录在[忍法 : 六道轮回]\n
         - 技能攻击力 -33%
        """
        ...

# 火遁·风魔手里剑
# thief/kunoichi/7cf17936a039b418660424125dc968d7
# ddc49e9ad1ff72a00b53c6cff5b1e920/7cf17936a039b418660424125dc968d7
class Skill42(ActiveSkill):
    """
    召唤禁忌之兵器[风魔手里剑]毁灭敌人。\n
    施放时召唤4个风魔手里剑， 抓住手里剑向前方投掷。 投掷的风魔手里剑旋转飞出， 对范围内的敌人造成多段伤害， 然后自动飞回。\n
    此时， 忍者可以抓取风魔手里剑， 使其融合成巨型风魔手里剑并再次向前方投掷， 造成额外伤害。\n
    巨型风魔手里剑对范围内敌人造成多段伤害后爆炸。\n
    在空中施放[火遁 : 风魔手里剑]时， 立即投掷出巨型风魔手里剑。\n
    投掷后跳跃或施放其他技能过程中， 无法抓取飞回的风魔手里剑。\n
    [忍术精通]蓄气后施放时， 增加巨型风魔手里剑的爆炸范围。
    """
    name = "火遁·风魔手里剑"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [800, 1680]
    uuid = "7cf17936a039b418660424125dc968d7"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 风魔手里剑攻击力 : {value0}%
    # REMOVE: data0 = [0, 533, 587, 641, 695, 749, 803, 857, 911, 965, 1019, 1073, 1127, 1181, 1235, 1289, 1343, 1397, 1451, 1506, 1560, 1614, 1668, 1722, 1776, 1830, 1884, 1938, 1992, 2046, 2100, 2154, 2208, 2262, 2316, 2370, 2424, 2478, 2532, 2586, 2640, 2694, 2749, 2803, 2857, 2911, 2965, 3019, 3073, 3127, 3181]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 风魔手里剑多段攻击次数 : {value1}
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 巨型风魔手里剑攻击力 : {value2}%
    # REMOVE: data2 = [0, 1199, 1320, 1442, 1563, 1685, 1807, 1928, 2050, 2171, 2293, 2415, 2536, 2658, 2779, 2901, 3023, 3144, 3266, 3387, 3509, 3631, 3752, 3874, 3995, 4117, 4239, 4360, 4482, 4603, 4725, 4847, 4968, 5090, 5211, 5333, 5455, 5576, 5698, 5819, 5941, 6063, 6184, 6306, 6427, 6549, 6671, 6792, 6914, 7035, 7157]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 巨型风魔手里剑多段攻击次数 : {value3}
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 巨型风魔手里剑爆炸攻击力 : {value4}%
    # REMOVE: data4 = [0, 19977, 22004, 24030, 26057, 28084, 30110, 32137, 34164, 36190, 38217, 40244, 42270, 44297, 46323, 48350, 50377, 52403, 54430, 56457, 58483, 60510, 62537, 64563, 66590, 68617, 70643, 72670, 74697, 76723, 78750, 80777, 82803, 84830, 86857, 88883, 90910, 92936, 94963, 96990, 99016, 101043, 103070, 105096, 107123, 109150, 111176, 113203, 115230, 117256, 119283]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # - [忍术精通追加效果] -
    # 达成‘临’、 ‘兵’、 ‘斗’结印时爆炸范围 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 达成‘者’、 ‘皆’、 ‘阵’结印时爆炸范围 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 最后爆炸大小: {value7}%
    # REMOVE: data7 = [0, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110, 110]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    def vp_1(self):
        """
        [火遁·风魔手里剑]\n
        立即投掷巨型风魔手里剑\n
        巨型风魔手里剑多段攻击次数 +10次\n
         - 总攻击力相同\n
        巨型风魔手里剑大小 +30%\n
        终结爆炸范围 +20%
        """
        ...

    def vp_2(self):
        """
        [火遁·风魔手里剑]\n
        基本冷却时间从50秒变更为43秒\n
         - 技能攻击力 -14%\n
        追加烈焰印记灼伤伤害\n
         - 命中时， 始终造成技能最大伤害量30%的伤害\n
         - 施放[忍法 : 六道轮回]时无效\n
         - 技能攻击力 -14%\n
        将[火遁·风魔手里剑]记录在[忍法 : 六道轮回]时， 赋予以下效果\n
         - [忍法 : 六道轮回]技能施放速度 +30%\n
         - 施放强化残影攻击时， 一次性结算剩余灼伤伤害
        """
        ...

# 八咫镜
# thief/kunoichi/f0cc2c950f3bdf4103c75fa496bcac34
# ddc49e9ad1ff72a00b53c6cff5b1e920/f0cc2c950f3bdf4103c75fa496bcac34
class Skill43(PassiveSkill):
    """
    八咫镜会强化分身、 残影类技能的特性。\n
    - [忍法 : 残影术] -\n
    增加残影数量和蓄力速度。\n
    - [忍法 : 六道轮回] -\n
    增加[忍法 : 六道轮回]技能施放速度。
    """
    name = "八咫镜"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 3
    uuid = "f0cc2c950f3bdf4103c75fa496bcac34"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [忍法 ： 残影术]蓄力速度增加 : {value1}%
    # REMOVE: data1 = [0, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [忍法 ： 残影术]残影数量上限增加 : {value2}个
    # REMOVE: data2 = [0, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [忍法 ： 六道轮回]强化残影攻击速度增加率 : {value3}%
    # REMOVE: data3 = [0, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 八岐大蛇
# thief/kunoichi/147d005ac868e0de52b1f255eea35d62
# ddc49e9ad1ff72a00b53c6cff5b1e920/147d005ac868e0de52b1f255eea35d62
class Skill44(ActiveSkill):
    """
    召唤神兽八岐大蛇喷吐黑色火焰， 同时生成火焰毒雾。\n
    - [忍术精通追加效果] -\n
    增加毒雾持续时间。
    """
    name = "八岐大蛇"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 3
    cd = 43
    mp = [600, 4500]
    uuid = "147d005ac868e0de52b1f255eea35d62"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 火焰吐息的攻击次数 : {value0}次
    # REMOVE: data0 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 召唤时， 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 2630, 2897, 3164, 3431, 3698, 3964, 4231, 4498, 4765, 5032, 5299, 5565, 5832, 6099, 6366, 6633, 6900, 7166, 7433, 7700, 7967, 8234, 8501, 8767, 9034, 9301, 9568, 9835, 10102, 10368, 10635, 10902, 11169, 11436, 11703, 11969, 12236, 12503, 12770, 13037, 13304, 13570, 13837, 14104, 14371, 14638, 14905, 15171, 15438, 15705]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 火焰吐息攻击力 : {value2}%
    # REMOVE: data2 = [0, 3507, 3862, 4218, 4574, 4930, 5285, 5641, 5997, 6353, 6708, 7064, 7420, 7776, 8131, 8487, 8843, 9198, 9554, 9910, 10266, 10621, 10977, 11333, 11689, 12044, 12400, 12756, 13112, 13467, 13823, 14179, 14535, 14890, 15246, 15602, 15958, 16313, 16669, 17025, 17381, 17736, 18092, 18448, 18804, 19159, 19515, 19871, 20227, 20582, 20938]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 毒雾攻击力 : {value3}%
    # REMOVE: data3 = [0, 798, 879, 960, 1041, 1122, 1203, 1284, 1365, 1446, 1527, 1608, 1689, 1770, 1851, 1932, 2013, 2094, 2175, 2256, 2337, 2418, 2499, 2580, 2661, 2742, 2823, 2904, 2985, 3066, 3147, 3228, 3309, 3390, 3470, 3551, 3632, 3713, 3794, 3875, 3956, 4037, 4118, 4199, 4280, 4361, 4442, 4523, 4604, 4685, 4766]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 毒雾多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 结印时毒雾多段攻击次数 : {value5}次
    # REMOVE: data5 = [0, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23, 23]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 火焰吐息攻击范围 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [八岐大蛇]\n
        八岐大蛇的大小增加\n
        变更召唤位置\n
        删除召唤时攻击力和毒雾领域\n
         - 总攻击力相同\n
        每叠加1层八尺琼勾玉， 火焰吐息范围 +5%\n
        火焰吐息范围 +20%
        """
        ...

    def vp_2(self):
        """
        [八岐大蛇]\n
        火焰吐息持续时间 -50%\n
         - 火焰吐息多段攻击次数 -5次\n
         - 追加火焰吐息爆炸攻击\n
         - 总攻击力相同\n
        增加烈焰印记灼伤伤害\n
         - 命中时， 始终造成技能最大伤害量30%的伤害\n
         - 施放[忍法 : 六道轮回]时无效\n
         - 技能攻击力 -14%\n
        将[八岐大蛇]记录在[忍法 : 六道轮回]时， 赋予以下效果\n
         - 施放[忍法 : 六道轮回]时攻击范围 +30%\n
         - 施放强化残影攻击时， 一次性结算剩余灼伤伤害
        """
        ...

# 八尺琼勾玉
# thief/kunoichi/8510294202d0e042dd29a2422fc6770d
# ddc49e9ad1ff72a00b53c6cff5b1e920/8510294202d0e042dd29a2422fc6770d
class Skill45(PassiveSkill):
    """
    召唤勾玉， 强化召唤兽的特性和能力。\n
    勾玉会在学习[火遁·蟾蜍油炎弹]、 [八岐大蛇]、 [天照]时自动激活， 并旋转在使用者身边。\n
    施放[火遁·红莲]技能时， 勾玉被火焰缠绕， 额外增加物理/魔法防御力。
    """
    name = "八尺琼勾玉"
    learnLv = 75
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 1
    uuid = "8510294202d0e042dd29a2422fc6770d"
    hasVP = False
    hasUP = False

    # 红色勾玉增加[火遁·蟾蜍油炎弹]施放速度 : {value0}%
    # REMOVE: data0 = [0, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 黑色勾玉增加[八岐大蛇]毒雾范围 : {value1}%
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 黄色勾玉减少光焰弹攻击前僵直 : {value2}%
    # REMOVE: data2 = [0, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 施放[火遁·红莲]时物理/魔法防御力额外增加 : {value3}
    # REMOVE: data3 = [0, 3955]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 天照
# thief/kunoichi/47bd4871f29defc2a0021ee9261d7a5b
# ddc49e9ad1ff72a00b53c6cff5b1e920/47bd4871f29defc2a0021ee9261d7a5b
class Skill46(ActiveSkill):
    """
    召唤天照发射自动追踪敌人的光焰弹。\n
    - [忍术精通追加效果] -\n
    增加攻击力。
    """
    name = "天照"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 5
    cd = 51
    mp = [800, 6000]
    uuid = "47bd4871f29defc2a0021ee9261d7a5b"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 天照登场和消失时冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 4781, 5266, 5751, 6236, 6721, 7206, 7691, 8176, 8661, 9146, 9631, 10117, 10602, 11087, 11572, 12057, 12542, 13027, 13512, 13997, 14482, 14967, 15452, 15937, 16422, 16907, 17392, 17877, 18362, 18847, 19332, 19817, 20302, 20787, 21272, 21757, 22242, 22728, 23213, 23698, 24183, 24668, 25153, 25638, 26123, 26608, 27093, 27578, 28063, 28548]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 光焰弹攻击力 : {value1}%
    # REMOVE: data1 = [0, 5086, 5602, 6118, 6634, 7149, 7665, 8181, 8697, 9213, 9729, 10245, 10761, 11277, 11793, 12309, 12825, 13341, 13857, 14373, 14889, 15405, 15921, 16436, 16952, 17468, 17984, 18500, 19016, 19532, 20048, 20564, 21080, 21596, 22112, 22628, 23144, 23660, 24176, 24692, 25208, 25723, 26239, 26755, 27271, 27787, 28303, 28819, 29335, 29851, 30367]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 光焰弹基本发射数量 : {value2}个
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [临兵斗]结印时攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [者皆阵]结印时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 锁定敌人范围 : {value5}px
    # REMOVE: data5 = [0, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [天照]\n
        天照登场时间减少\n
        持续时间内， 向进入范围内的敌人发射光焰弹\n
        删除登场和消失攻击力\n
         - 总攻击力相同\n
        天照结印蓄气时间 -50%
        """
        ...

    def vp_2(self):
        """
        [天照]\n
        天照登场后落下火雨\n
         - 黄色勾玉效果变更为攻击范围 +10%\n
        施放[天照]过程中， 通过其他技能强制中断残影时， 立即恢复残影\n
        追加烈焰印记灼伤伤害\n
         - 命中时， 始终造成技能最大伤害量30%的伤害\n
         - 施放[忍法 : 六道轮回]时无效\n
         - 技能攻击力 -14%\n
        将[天照]记录在[忍法 : 六道轮回]时， 赋予以下效果\n
         - 施放时， 10秒内[忍法 : 残影术]残影恢复速度 +50%\n
         - 施放强化残影攻击时， 一次性结算剩余灼伤伤害
        """
        ...

# 火炎灼空 : 草雉剑
# thief/kunoichi/669f1428193f61f9d92c743b72438c4d
# ddc49e9ad1ff72a00b53c6cff5b1e920/669f1428193f61f9d92c743b72438c4d
class Skill47(ActiveSkill):
    """
    召唤出火系忍术根源的古代武器——草雉剑。\n
    使用技能后， 按<X>键可以直接装备召唤出来的草雉剑， 技能持续时间内， 基本攻击变更为火焰剑舞， 灼伤伤害增加， 烈焰印记持续时间发生改变。\n
    并且， 火焰剑舞命中时， 累积[忍法 : 六道轮回]的残影攻击力。\n
    装备草雉剑的状态下， 若再次按技能键， 则残影会投掷火焰剑并引起大爆炸。\n
    最后投掷剑和爆炸的攻击力受[忍法 : 残影术]的影响。 
    """
    name = "火炎灼空 : 草雉剑"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2800, 5000]
    uuid = "669f1428193f61f9d92c743b72438c4d"
    hasVP = False
    hasUP = False

    # 剑下落时的攻击力 : {value0}%
    # REMOVE: data0 = [0, 3249, 4003, 4756, 5509, 6263, 7016, 7770, 8523, 9276, 10030, 10783, 11537, 12290, 13043, 13797, 14550, 15304, 16057, 16811, 17564, 18317, 19071, 19824, 20578, 21331, 22084, 22838, 23591, 24345, 25098, 25852, 26605, 27358, 28112, 28865, 29619, 30372, 31125, 31879, 32632, 33386, 34139, 34892, 35646, 36399, 37153, 37906, 38660, 39413, 40166]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 剑在地面散发的火焰攻击力 : {value1}%
    # REMOVE: data1 = [0, 736, 906, 1077, 1248, 1418, 1589, 1759, 1930, 2101, 2271, 2442, 2613, 2783, 2954, 3124, 3295, 3466, 3636, 3807, 3977, 4148, 4319, 4489, 4660, 4831, 5001, 5172, 5342, 5513, 5684, 5854, 6025, 6195, 6366, 6537, 6707, 6878, 7049, 7219, 7390, 7560, 7731, 7902, 8072, 8243, 8413, 8584, 8755, 8925, 9096]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后投掷剑时的攻击力 : {value2}%
    # REMOVE: data2 = [0, 6364, 7840, 9316, 10791, 12267, 13743, 15219, 16694, 18170, 19646, 21121, 22597, 24073, 25549, 27024, 28500, 29976, 31452, 32927, 34403, 35879, 37355, 38830, 40306, 41782, 43257, 44733, 46209, 47685, 49160, 50636, 52112, 53588, 55063, 56539, 58015, 59491, 60966, 62442, 63918, 65394, 66869, 68345, 69821, 71296, 72772, 74248, 75724, 77199, 78675]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后的3次爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 32257, 39737, 47217, 54697, 62177, 69657, 77137, 84617, 92097, 99577, 107056, 114536, 122016, 129496, 136976, 144456, 151936, 159416, 166896, 174376, 181856, 189336, 196816, 204296, 211775, 219255, 226735, 234215, 241695, 249175, 256655, 264135, 271615, 279095, 286575, 294055, 301535, 309015, 316494, 323974, 331454, 338934, 346414, 353894, 361374, 368854, 376334, 383814, 391294, 398774]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 装备草雉剑时第一次斩击攻击力 : {value4}%
    # REMOVE: data4 = [0, 1547, 1906, 2265, 2623, 2982, 3341, 3700, 4059, 4417, 4776, 5135, 5494, 5852, 6211, 6570, 6929, 7287, 7646, 8005, 8364, 8723, 9081, 9440, 9799, 10158, 10516, 10875, 11234, 11593, 11951, 12310, 12669, 13028, 13387, 13745, 14104, 14463, 14822, 15180, 15539, 15898, 16257, 16615, 16974, 17333, 17692, 18051, 18409, 18768, 19127]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 装备草雉剑时第二次斩击攻击力 : {value5}%
    # REMOVE: data5 = [0, 1547, 1906, 2265, 2623, 2982, 3341, 3700, 4059, 4417, 4776, 5135, 5494, 5852, 6211, 6570, 6929, 7287, 7646, 8005, 8364, 8723, 9081, 9440, 9799, 10158, 10516, 10875, 11234, 11593, 11951, 12310, 12669, 13028, 13387, 13745, 14104, 14463, 14822, 15180, 15539, 15898, 16257, 16615, 16974, 17333, 17692, 18051, 18409, 18768, 19127]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 装备草雉剑时空中、 后跳斩击攻击力 : {value6}%
    # REMOVE: data6 = [0, 1599, 1969, 2340, 2711, 3082, 3452, 3823, 4194, 4565, 4935, 5306, 5677, 6047, 6418, 6789, 7160, 7530, 7901, 8272, 8643, 9013, 9384, 9755, 10125, 10496, 10867, 11238, 11608, 11979, 12350, 12721, 13091, 13462, 13833, 14204, 14574, 14945, 15316, 15686, 16057, 16428, 16799, 17169, 17540, 17911, 18282, 18652, 19023, 19394, 19764]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 斩击额外灼伤攻击力比率 : {value7}%
    # REMOVE: data7 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 斩击灼伤持续时间 : {value8}秒
    # REMOVE: data8 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 烈焰印记灼伤持续时间适用比率 : {value9}%
    # REMOVE: data9 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [火遁·飓风煞]卷入敌人的力量增加率 : {value10}%
    # REMOVE: data10 = [0, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # 召唤的草雉剑持续时间 : {value11}秒
    # REMOVE: data11 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # 草雉剑装备的持续时间 : {value12}秒
    # REMOVE: data12 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)
    # 装备草雉剑时不知火的攻击速度增加 : {value13}%
    # REMOVE: data13 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13, lambda x = None: x)
    # 装备草雉剑后， 斩击命中时， [忍法 ： 六道轮回]攻击力累积量 : {value14}%
    # REMOVE: data14 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14, lambda x = None: x)

# 三元刹
# thief/kunoichi/2ff50c35efcf0f287c4c418c8454da48
# ddc49e9ad1ff72a00b53c6cff5b1e920/2ff50c35efcf0f287c4c418c8454da48
class Skill48(PassiveSkill):
    """
    隐夜·忍者获得查克拉根源——八咫乌之力， 激发三神器的隐藏力量， 领悟忍术的所有知识。\n
    学习后， 增加基本攻击力和转职技能攻击力， 部分技能附加特殊效果。\n
    [忍术精通]\n
    - 减少结印时间， 施放者完成[临兵斗者皆阵]所有结印施放技能时， 适用[忍法 : 残影术]的攻击力。\n
    [火遁·螺旋手里剑]\n
    - 地面施放时\n
     - 螺旋手里剑命中敌人时再次按技能键， 移动到命中位置。\n
    - 空中施放时\n
     - 螺旋手里剑击中地面时再次按技能键， 移动到命中位置。
    """
    name = "三元刹"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "2ff50c35efcf0f287c4c418c8454da48"
    hasVP = False
    hasUP = False

    # 结印时间减少率 : {value0}%
    # REMOVE: data0 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 勾玉之火 : 镰鼬
# thief/kunoichi/845e0ce3235e19f60cc82a082d072cba
# ddc49e9ad1ff72a00b53c6cff5b1e920/845e0ce3235e19f60cc82a082d072cba
class Skill49(ActiveSkill):
    """
    激发八尺琼勾玉的所有隐藏力量， 将其变化为火焰精灵镰鼬。\n
    镰鼬用勾玉之焰席卷敌人后， 重新回到施放者周围。\n
    终结攻击命中敌人时恢复残影， 并立即造成剩余灼伤伤害。\n
    每次消耗残影， [勾玉之火 : 镰鼬]技能的剩余冷却时间减少一定比率， 施放技能前最多可减少10次。\n
    可以通过On/Off功能设置是否立即造成灼伤伤害。
    """
    name = "勾玉之火 : 镰鼬"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [960, 2000]
    uuid = "845e0ce3235e19f60cc82a082d072cba"
    hasVP = False
    hasUP = False

    # 火焰旋风攻击力 : {value0}%
    # REMOVE: data0 = [0, 6523, 7185, 7847, 8509, 9170, 9832, 10494, 11156, 11818, 12479, 13141, 13803, 14465, 15127, 15788, 16450, 17112, 17774, 18435, 19097, 19759, 20421, 21083, 21744, 22406, 23068, 23730, 24392, 25053, 25715, 26377, 27039, 27700, 28362, 29024, 29686, 30348, 31009, 31671, 32333, 32995, 33657, 34318, 34980, 35642, 36304, 36965, 37627, 38289, 38951]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋风多段攻击次数 : {value1}
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 终结攻击力 : {value2}%
    # REMOVE: data2 = [0, 76105, 83826, 91547, 99268, 106989, 114710, 122430, 130151, 137872, 145593, 153314, 161035, 168755, 176476, 184197, 191918, 199639, 207360, 215080, 222801, 230522, 238243, 245964, 253685, 261406, 269126, 276847, 284568, 292289, 300010, 307731, 315451, 323172, 330893, 338614, 346335, 354056, 361776, 369497, 377218, 384939, 392660, 400381, 408101, 415822, 423543, 431264, 438985, 446706, 454426]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后一击命中灼伤的敌人时恢复的残影数 : {value3}
    # REMOVE: data3 = [0, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 消耗残影时剩余冷却时间减少率 : {value4}%
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 剩余冷却时间最多可减少次数 : {value5}
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 火源限界·八咫乌
# thief/kunoichi/6067de229738524687e5a9ee1c53d583
# ddc49e9ad1ff72a00b53c6cff5b1e920/6067de229738524687e5a9ee1c53d583
class Skill50(ActiveSkill):
    """
    激发三神器隐藏的所有力量， 创造出查克拉的根源——八咫乌， 消灭敌人。\n
    八尺琼勾玉中加上草雉剑的火焰创造出的“八咫乌”以基本形态喷射太古烈炎攻击敌人， 并通过八咫镜复制成3个。\n
    然后， 激发三神器隐藏的所有力量的3个八咫乌重新合体， 展现释放全部查克拉的最终形态。\n
    无法通过[忍法 : 残影术]和[忍法 : 六道轮回]使用。\n
    八咫乌的所有攻击受[忍法 : 残影术]的影响。\n
    [三次觉醒技能]\n
    选择[火遁·冥炎业火阵]使用三次觉醒技能时， 与[火遁·冥炎业火阵]共享冷却时间。 \n
    选择[火炎灼空 : 草雉剑]使用三次觉醒技能时， 可以使用三次觉醒技能代替[火炎灼空 : 草雉剑]的终结攻击。 三次觉醒技能在冷却中、 [火炎灼空 : 草雉剑]终结攻击已发动或未装备草雉剑的状态下， 无法使用三次觉醒技能。
    """
    name = "火源限界·八咫乌"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "6067de229738524687e5a9ee1c53d583"
    hasVP = False
    hasUP = False

    # 八咫乌乱舞攻击力 : {value0}%
    # REMOVE: data0 = [0, 8367, 10308, 12248, 14188, 16128, 18069, 20009, 21949, 23890, 25830, 27770, 29710, 31651, 33591, 35531, 37471, 39412, 41352, 43292, 45232, 47173, 49113, 51053, 52994, 54934, 56874, 58814, 60755, 62695, 64635, 66575, 68516, 70456, 72396, 74336, 76277, 78217, 80157, 82098, 84038, 85978, 87918, 89859, 91799, 93739, 95679, 97620, 99560, 101500, 103440]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 八咫乌乱舞多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 八咫乌回归多段攻击力 : {value2}%
    # REMOVE: data2 = [0, 10758, 13253, 15747, 18242, 20737, 23231, 25726, 28220, 30715, 33210, 35704, 38199, 40694, 43188, 45683, 48178, 50672, 53167, 55661, 58156, 60651, 63145, 65640, 68135, 70629, 73124, 75618, 78113, 80608, 83102, 85597, 88092, 90586, 93081, 95575, 98070, 100565, 103059, 105554, 108049, 110543, 113038, 115532, 118027, 120522, 123016, 125511, 128006, 130500, 132995]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 八咫乌回归多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 终结爆炸攻击力 : {value4}%
    # REMOVE: data4 = [0, 251022, 309230, 367438, 425646, 483854, 542062, 600270, 658478, 716686, 774894, 833102, 891310, 949518, 1007726, 1065934, 1124142, 1182350, 1240558, 1298766, 1356974, 1415182, 1473390, 1531598, 1589806, 1648014, 1706222, 1764430, 1822638, 1880846, 1939054, 1997262, 2055470, 2113678, 2171886, 2230094, 2288302, 2346510, 2404718, 2462926, 2521134, 2579342, 2637550, 2695758, 2753966, 2812174, 2870382, 2928590, 2986798, 3045006, 3103214]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'kunoichi'
        self.nameCN = '隐夜·忍者'
        self.role = 'thief'
        self.角色 = '暗夜使者'
        self.职业 = '忍者'
        self.jobId = 'ddc49e9ad1ff72a00b53c6cff5b1e920'
        self.jobGrowId = 'a9a4ef4552d46e39cf6c874a51126410'

        self.武器选项 = [] # TODO
        self.输出类型选项 = [] # TODO
        self.输出类型 = '' # TODO
        self.防具精通属性 = [''] # TODO
        self.防具类型 = ''
        self.buff = ... # TODO

        super().__init__(equVersion, __name__)
