#ddc49e9ad1ff72a00b53c6cff5b1e920
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "thief/rogue/cn/skillDetail"

# 翔击
# thief/rogue/3c5604bdbb0240b8f130f59ab40509c3
# ddc49e9ad1ff72a00b53c6cff5b1e920/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
    向敌人发出向上的切割攻击， 并使敌人浮空。\n
    在空中也可以使用[翔击]， 且按住技能键的时间越长， [翔击]的跳跃高度就越高。\n
    可消耗连击点数发动[终结之击]。
    """
    name = "翔击"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 186, 216, 245, 275, 305, 334, 364, 394, 423, 453, 483, 512, 542, 571, 601, 631, 660, 690, 720, 749]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 101.9, 103, 103.9, 105, 105.8, 106.9, 107.8, 108.9, 112.6, 113, 113.4, 113.9, 114.3, 114.7, 115.2, 115.6, 116, 116.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}% X {value3}
    # REMOVE: data2 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [终结之击]浮空力比率 : {value4}%
    # REMOVE: data4 = [0, 100, 107.3, 114.6, 122, 129.3, 137.3, 144.6, 152, 159.3, 166.6, 167.3, 168, 168.6, 169.3, 170, 170.6, 171.3, 172, 172.6, 173.3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 投掷苦无
# thief/rogue/506e7ed77d517419a6e1c437a2cedb17
# ddc49e9ad1ff72a00b53c6cff5b1e920/506e7ed77d517419a6e1c437a2cedb17
class Skill1(ActiveSkill):
    """
    向敌人投掷苦无， 使远距离的敌人受到无属性物理伤害。\n
    苦无具有略微的诱导性和穿透力， 可以在跳跃状态中投掷。\n
    技能等级越高， 被苦无命中的敌人的僵直时间越长。
    """
    name = "投掷苦无"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 2.5
    mp = [8, 91]
    uuid = "506e7ed77d517419a6e1c437a2cedb17"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 299, 329, 360, 390, 420, 451, 481, 511, 542, 572, 602, 633, 663, 693, 724, 754, 784, 815, 845, 875, 906, 936, 966, 997, 1027, 1057, 1088, 1118, 1148, 1179, 1209, 1239, 1270, 1300, 1330, 1361, 1391, 1421, 1452, 1482, 1512, 1543, 1573, 1603, 1634, 1664, 1694, 1725, 1755, 1785, 1816, 1846, 1876, 1907, 1937, 1967, 1998, 2028, 2058, 2089, 2119, 2149, 2180, 2210, 2240, 2271, 2301, 2331, 2362, 2392]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 苦无投掷个数 : {value1}个
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 僵直时间增加率 : {value2}%
    # REMOVE: data2 = [0, 100, 105.2, 110.3, 115.5, 120.7, 125.9, 131, 136.2, 141.4, 146.6, 151.7, 156.9, 162.1, 167.2, 172.4, 177.6, 182.8, 187.9, 193.1, 198.3, 203.4, 208.6, 213.8, 219, 224.1, 229.3, 234.5, 239.7, 244.8, 250, 255.2, 260.3, 265.5, 270.7, 275.9, 281, 286.2, 291.4, 296.6, 301.7, 306.9, 312.1, 317.2, 322.4, 327.6, 332.8, 337.9, 343.1, 348.3, 353.4, 358.6, 363.8, 369, 374.1, 379.3, 384.5, 389.7, 394.8, 400, 405.2, 410.3, 415.5, 420.7, 425.9, 431, 436.2, 441.4, 446.6, 451.7, 456.9]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最大穿透次数 : {value3}次
    # REMOVE: data3 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 苦无大小 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 后跳
# thief/rogue/7822d6d52e10964a6755f142c666b494
# ddc49e9ad1ff72a00b53c6cff5b1e920/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 基础精通
# thief/rogue/5a56514f35cf0270ae8d6c65f8fefd78
# ddc49e9ad1ff72a00b53c6cff5b1e920/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [翔击]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 受身蹲伏
# thief/rogue/ce26c6b69d02a440a81b552bec94f03b
# ddc49e9ad1ff72a00b53c6cff5b1e920/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# thief/rogue/892ef624d8bf3d7fc045f84825fd6104
# ddc49e9ad1ff72a00b53c6cff5b1e920/892ef624d8bf3d7fc045f84825fd6104
class Skill5(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 切割
# thief/rogue/9dda3f4a849dba1a288dd65e116860f2
# ddc49e9ad1ff72a00b53c6cff5b1e920/9dda3f4a849dba1a288dd65e116860f2
class Skill6(ActiveSkill):
    """
    前冲攻击中输入攻击键时， 施放追加斩击。\n
    攻击力、 攻击范围、 前进速度和前进距离随技能等级增加而增大。
    """
    name = "切割"
    learnLv = 5
    masterLv = 1
    maxLv = 6
    position = 4 #TODO
    rangeLv = 2
    cd = 2.5
    mp = [6, 56]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 419, 462, 504, 547, 589, 632]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲速度和距离比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 102.1, 103.1, 104.1, 105.2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 130, 131, 131, 133, 134, 134]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 焰刃
# thief/rogue/eb71e1d82d92c7e1d40500a0dcd77aa6
# ddc49e9ad1ff72a00b53c6cff5b1e920/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill7(ActiveSkill):
    """
    火属性近身魔法技能； 聚集火焰的力量对敌人进行强力攻击并把敌人击飞。\n
    攻击力、 击飞力、 发动速度和攻击范围随技能等级增加而增大。
    """
    name = "焰刃"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    mp = [15, 168]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1721, 1896, 2070, 2245, 2419, 2594, 2769, 2943, 3118, 3292, 3467, 3642, 3816, 3991, 4165, 4340, 4515, 4689, 4864, 5038, 5213, 5387, 5562, 5737, 5911, 6086, 6260, 6435, 6610, 6784, 6959, 7133, 7308, 7483, 7657, 7832, 8006, 8181, 8356, 8530, 8705, 8879, 9054, 9229, 9403, 9578, 9752, 9927, 10102, 10276, 10451, 10625, 10800, 10974, 11149, 11324, 11498, 11673, 11847, 12022, 12197, 12371, 12546, 12720, 12895, 13070, 13244, 13419, 13593, 13768]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 击飞力比率 : {value1}%
    # REMOVE: data1 = [0, 100, 101, 102.3, 103.3, 104.6, 105.6, 107, 108, 109.3, 110.3, 111.3, 112.6, 113.6, 115, 116, 117.3, 118.3, 119.6, 120.6, 122, 123, 124, 125.3, 126.3, 127.6, 128.6, 130, 131, 132.3, 133.3, 134.3, 135.6, 136.6, 138, 139, 140.3, 141.3, 142.6, 143.6, 144.6, 146, 147, 148.3, 149.3, 150.6, 151.6, 153, 154, 155.3, 156.3, 157.3, 158.6, 159.6, 161, 162, 163.3, 164.3, 165.6, 166.6, 167.6, 169, 170, 171.3, 172.3, 173.6, 174.6, 176, 177, 178, 179.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 发动速度增加率 : {value2}%
    # REMOVE: data2 = [0, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142, 142]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 范围 : {value3}%
    # REMOVE: data3 = [0, 156, 158, 158, 159, 161, 161, 162, 164, 165, 165, 167, 168, 168, 170, 172, 172, 173, 175, 175, 176, 178, 178, 179, 181, 183, 183, 184, 186, 186, 187, 189, 189, 190, 192, 192, 193, 195, 197, 197, 198, 200, 200, 201, 203, 203, 204, 206, 206, 207, 209, 209, 211, 212, 214, 214, 215, 217, 217, 218, 220, 220, 222, 223, 223, 225, 226, 228, 228, 229, 231]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 影袭
# thief/rogue/c9664191611af31142e052dfaef84530
# ddc49e9ad1ff72a00b53c6cff5b1e920/c9664191611af31142e052dfaef84530
class Skill8(ActiveSkill):
    """
    以无视敌人硬直的斩击攻击敌人， 使敌人受到无属性物理伤害的同时进入僵直状态； 之后移动到敌人身后， 伺机进行下一次攻击。\n
    转职为影舞者时， 可以强制控制敌人。\n
    在决斗场中， 无法强制控制敌人， 但是相比其他暗夜使者， 可以使敌人进入更长时间的僵直状态。
    """
    name = "影袭"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 6
    mp = [15, 168]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 3411, 3757, 4103, 4449, 4795, 5141, 5487, 5833, 6179, 6525, 6871, 7217, 7564, 7910, 8256, 8602, 8948, 9294, 9640, 9986, 10332, 10678, 11024, 11370, 11716, 12062, 12408, 12754, 13100, 13446, 13792, 14138, 14484, 14830, 15176, 15523, 15869, 16215, 16561, 16907, 17253, 17599, 17945, 18291, 18637, 18983, 19329, 19675, 20021, 20367, 20713, 21059, 21405, 21751, 22097, 22443, 22789, 23135, 23482, 23828, 24174, 24520, 24866, 25212, 25558, 25904, 26250, 26596, 26942, 27288]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 敌人僵直时间 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [转职为影舞者时] -
    # 僵直时间比率 : {value2}%
    # REMOVE: data2 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暗魂波
# thief/rogue/ade01c1d6afc8a05055225045e89fe49
# ddc49e9ad1ff72a00b53c6cff5b1e920/ade01c1d6afc8a05055225045e89fe49
class Skill9(ActiveSkill):
    """
    向敌人发射暗属性球体。\n
    球体会自动寻找敌人， 发现敌人后对敌人造成伤害， 最后球体爆炸。\n
    -  [转职为黑夜术士后附加效果]  -\n
    施放[降临 : 暴君巴拉克]的状态下， 可以蓄气施放[暗魂波]。\n
    蓄气施放[暗魂波]时， 球体变大且增加攻击力。\n
    在决斗场中， 地图内球体的存在时间减少。
    """
    name = "暗魂波"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 3.5
    mp = [15, 161]
    uuid = "ade01c1d6afc8a05055225045e89fe49"
    hasVP = False
    hasUP = False

    # 多段攻击次数上限 : {value0}次
    # REMOVE: data0 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 多段攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 248, 273, 298, 323, 349, 374, 399, 424, 449, 474, 500, 525, 550, 575, 600, 625, 650, 676, 701, 726, 751, 776, 801, 827, 852, 877, 902, 927, 952, 978, 1003, 1028, 1053, 1078, 1103, 1128, 1154, 1179, 1204, 1229, 1254, 1279, 1305, 1330, 1355, 1380, 1405, 1430, 1455, 1481, 1506, 1531, 1556, 1581, 1606, 1632, 1657, 1682, 1707, 1732, 1757, 1783, 1808, 1833, 1858, 1883, 1908, 1933, 1959, 1984]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 1034, 1139, 1244, 1349, 1454, 1559, 1664, 1768, 1873, 1978, 2083, 2188, 2293, 2398, 2503, 2608, 2713, 2818, 2922, 3027, 3132, 3237, 3342, 3447, 3552, 3657, 3762, 3867, 3971, 4076, 4181, 4286, 4391, 4496, 4601, 4706, 4811, 4916, 5021, 5125, 5230, 5335, 5440, 5545, 5650, 5755, 5860, 5965, 6070, 6175, 6279, 6384, 6489, 6594, 6699, 6804, 6909, 7014, 7119, 7224, 7329, 7433, 7538, 7643, 7748, 7853, 7958, 8063, 8168, 8273]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 诱导力比率 : {value3}%
    # REMOVE: data3 = [0, 100, 103, 108, 110, 115, 118, 120, 125, 128, 130, 135, 138, 143, 145, 148, 153, 155, 158, 163, 165, 170, 173, 175, 180, 183, 185, 190, 193, 198, 200, 203, 208, 210, 215, 218, 220, 225, 228, 230, 235, 238, 243, 245, 248, 253, 255, 258, 263, 265, 270, 273, 275, 280, 283, 285, 290, 293, 298, 300, 303, 308, 310, 315, 318, 320, 325, 328, 330, 335, 338]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [转职为黑夜术士后]
    # 蓄气时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 地图内球体存在时间 : {value5}秒
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [冥河之钥]
    # 多段攻击力 : {value6}%
    # REMOVE: data6 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 弧光闪
# thief/rogue/0969cd4054d93da07708108c0cc1c4b5
# ddc49e9ad1ff72a00b53c6cff5b1e920/0969cd4054d93da07708108c0cc1c4b5
class Skill10(ActiveSkill):
    """
    急速冲向前方的敌人并对其进行闪电般的攻击。\n
    按上下方向键可向Y轴移动； 若急速前冲过程中按跳跃键， 则可停止移动。\n
    暗星可以连续发动两次[弧光闪]； 可在空中施放[弧光闪]； 可强制中断转职技能， 并施放[弧光闪]； 可消耗连击点数发动可控制左右方向的[终结之击]； 学习[弧光连闪]后， 增加追加攻击的可发动次数。\n
    转职为影舞者后， 可以强制中断技能并施放[追影步]； 学习[潜行教义]后， 可以再次按技能键发动追加攻击。\n
    可以利用方向键调整移动方向。
    """
    name = "弧光闪"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 6
    mp = [18, 190]
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 2026, 2232, 2437, 2643, 2848, 3054, 3259, 3465, 3670, 3876, 4081, 4287, 4492, 4698, 4904, 5109, 5315, 5520, 5726, 5931, 6137, 6342, 6548, 6753, 6959, 7164, 7370, 7575, 7781, 7987, 8192, 8398, 8603, 8809, 9014, 9220, 9425, 9631, 9836, 10042, 10247, 10453, 10659, 10864, 11070, 11275, 11481, 11686, 11892, 12097, 12303, 12508, 12714, 12919, 13125, 13330, 13536, 13742, 13947, 14153, 14358, 14564, 14769, 14975, 15180, 15386, 15591, 15797, 16002, 16208]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [终结之击]攻击力 : {value1}%
    # REMOVE: data1 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 发动速度比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 僵直时间比率 : {value3}%
    # REMOVE: data3 = [0, 150, 155, 161, 165, 171, 176, 182, 186, 192, 197, 201, 207, 212, 218, 222, 228, 233, 239, 243, 249, 254, 258, 264, 269, 275, 279, 285, 290, 296, 300, 305, 311, 315, 321, 326, 332, 336, 342, 347, 351, 357, 362, 368, 372, 378, 383, 389, 393, 399, 404, 408, 414, 419, 425, 429, 435, 440, 446, 450, 455, 461, 465, 471, 476, 482, 486, 492, 497, 501, 507]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 骨盾
# thief/rogue/ff171dc487807bb9aa28900ca9a46b41
# ddc49e9ad1ff72a00b53c6cff5b1e920/ff171dc487807bb9aa28900ca9a46b41
class Skill11(ActiveSkill):
    """
    在自身或队员周围召唤由骨头碎片形成的骨盾， 可以增加被骨盾守护的角色的物理防御力和魔法防御力。\n
    该角色被攻击时， 骨头碎片会自动飞向敌人， 并使敌人受到无属性魔法伤害。\n
    每次被攻击时， 骨头碎片会逐块消失。 当骨头碎片全部消失时， 增加的物理防御力和魔法防御力效果就会消失。\n
    [转职为黑夜术士后功能变更]\n
    减少骨盾的持续时间。\n
    学习后减少所受伤害， 施放技能后被攻击一定次数内附加霸体护甲。\n
    可以在其他动作中施放， 不受冷却时间减少效果的影响。\n
    在决斗场中， 不适用持续时间减少和霸体护甲效果， 施放技能时减少所受伤害。
    """
    name = "骨盾"
    learnLv = 10
    masterLv = 1
    maxLv = 7
    position = 1 #TODO
    rangeLv = 3
    cd = 15
    mp = [20, 400]
    uuid = "ff171dc487807bb9aa28900ca9a46b41"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 122, 136, 150, 160, 173, 187, 201]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 骨盾持续时间 : {value1}秒
    # REMOVE: data1 = [0, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 骨头碎片数量 : {value2}
    # REMOVE: data2 = [0, 27, 27, 29, 29, 29, 31, 31]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 魔法防御力增加 : {value3}
    # REMOVE: data3 = [0, 204, 270, 341, 420, 508, 605, 709]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 204, 270, 341, 420, 508, 605, 709]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 发射骨头碎片冷却时间 : {value5}秒
    # REMOVE: data5 = [0, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [转职为黑夜术士后]
    # 持续时间减少率 : 85%
    # 所受伤害减少率 : {value6}%
    # REMOVE: data6 = [0, 4, 8, 12, 16, 20, 20, 20]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 霸体护甲生效次数 : {value7}次
    # REMOVE: data7 = [0, 4, 5, 6, 7, 8, 8, 8]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 忍法 : 影分身
# thief/rogue/a5fa08f5d509e6ff2ebc68856a470b5a
# ddc49e9ad1ff72a00b53c6cff5b1e920/a5fa08f5d509e6ff2ebc68856a470b5a
class Skill12(ActiveSkill):
    """
    把自己的影分身留在原地的同时， 向空中瞬移， 可用左右方向键控制瞬移地点。\n
    被攻击时， 也可以使用此技能。\n
    留在地上的影分身会挑衅一定领域内的敌人； 影分身经过一段时间或受到一定伤害后， 会爆炸并使敌人受到无属性魔法伤害。
    """
    name = "忍法 : 影分身"
    learnLv = 10
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    cd = [30, 29.4, 28.8, 28.2, 27.6, 26.9, 26.3, 25.7, 25.1, 24.5, 23.9, 23.3, 22.7, 22, 21.4, 20.8, 20.2, 19.6, 19, 18.4, 17.8, 17.1, 16.5, 15.9, 15.3, 14.7, 14.1, 13.5, 12.9, 12.2, 11.6, 11, 10.4, 9.8, 9.2, 8.6, 8, 7.3, 6.7, 6.1, 5.5, 4.9, 4.3, 3.7, 3.1, 2.4, 1.8, 1.2, 0.6, 0]
    mp = [20, 230]
    uuid = "a5fa08f5d509e6ff2ebc68856a470b5a"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 918, 1064, 1211, 1357, 1503, 1650, 1796, 1942, 2089, 2235, 2381, 2528, 2674, 2821, 2967, 3113, 3260, 3406, 3552, 3699, 3845, 3991, 4138, 4284, 4430, 4577, 4723, 4869, 5016, 5162, 5308, 5455, 5601, 5747, 5894, 6040, 6187, 6333, 6479, 6626, 6772, 6918, 7065, 7211, 7357, 7504, 7650, 7796, 7943, 8089]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 分身生命值 : {value1}
    # REMOVE: data1 = [0, 168, 192, 216, 276, 372, 456, 540, 624, 739, 864, 998, 1142, 1296, 1459, 1632, 1814, 2006, 2208, 2419, 2640, 2870, 3110, 3360, 3619, 3888, 4166, 4454, 4752, 5059, 5376, 5702, 6038, 6384, 6739, 7104, 7478, 7862, 8256, 8659, 9072, 9494, 9926, 10368, 10819, 11280, 11750, 12230, 12720, 13219, 13728]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 分身持续时间 : {value2}秒
    # REMOVE: data2 = [0, 7, 7.2, 7.4, 7.7, 7.9, 8.2, 8.4, 8.6, 8.9, 9.1, 9.4, 9.6, 9.8, 10.1, 10.3, 10.6, 10.8, 11.1, 11.3, 11.5, 11.8, 12, 12.3, 12.5, 12.7, 13, 13.2, 13.5, 13.7, 14, 14.2, 14.4, 14.7, 14.9, 15.2, 15.4, 15.6, 15.9, 16.1, 16.4, 16.6, 16.8, 17.1, 17.3, 17.6, 17.8, 18.1, 18.3, 18.5, 18.8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 挑衅范围 : {value3}px
    # REMOVE: data3 = [0, 200, 203, 207, 210, 214, 217, 221, 224, 228, 231, 234, 238, 241, 245, 248, 252, 255, 259, 262, 266, 269, 272, 276, 279, 283, 286, 290, 293, 297, 300, 303, 307, 310, 314, 317, 321, 324, 328, 331, 334, 338, 341, 345, 348, 352, 355, 359, 362, 366, 369]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 碎踝
# thief/rogue/5dc7008b12a459325b548b0715c6b73c
# ddc49e9ad1ff72a00b53c6cff5b1e920/5dc7008b12a459325b548b0715c6b73c
class Skill13(ActiveSkill):
    """
    用强力的扫腿踢攻击敌人的脚踝。
    """
    name = "碎踝"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 7
    mp = [15, 168]
    uuid = "5dc7008b12a459325b548b0715c6b73c"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 5882, 6479, 7075, 7672, 8269, 8866, 9462, 10059, 10656, 11253, 11849, 12446, 13043, 13639, 14236, 14833, 15430, 16026, 16623, 17220, 17816, 18413, 19010, 19607, 20203, 20800, 21397, 21994, 22590, 23187, 23784, 24380, 24977, 25574, 26171, 26767, 27364, 27961, 28558, 29154, 29751, 30348, 30944, 31541, 32138, 32735, 33331, 33928, 34525, 35122, 35718, 36315, 36912, 37508, 38105, 38702, 39299, 39895, 40492, 41089, 41685, 42282, 42879, 43476, 44072, 44669, 45266, 45863, 46459, 47056]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 减速几率 : {value1}%
    # REMOVE: data1 = [0, 40, 42.1, 44.1, 46.2, 48.3, 50.3, 52.4, 54.5, 56.6, 58.6, 60.7, 62.8, 64.8, 66.9, 69, 71, 73.1, 75.2, 77.2, 79.3, 81.4, 83.4, 85.5, 87.6, 89.7, 91.7, 93.8, 95.9, 97.9, 100, 102.1, 104.1, 106.2, 108.3, 110.3, 112.4, 114.5, 116.6, 118.6, 120.7, 122.8, 124.8, 126.9, 129, 131, 133.1, 135.2, 137.2, 139.3, 141.4, 143.4, 145.5, 147.6, 149.7, 151.7, 153.8, 155.9, 157.9, 160, 162.1, 164.1, 166.2, 168.3, 170.3, 172.4, 174.5, 176.6, 178.6, 180.7, 182.8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 减速持续时间 : {value2}秒
    # REMOVE: data2 = [0, 3, 3.1, 3.2, 3.31, 3.41, 3.51, 3.62, 3.72, 3.82, 3.93, 4.03, 4.13, 4.24, 4.34, 4.44, 4.55, 4.65, 4.75, 4.86, 4.96, 5.06, 5.17, 5.27, 5.37, 5.48, 5.58, 5.69, 5.79, 5.89, 6, 6.1, 6.2, 6.31, 6.41, 6.51, 6.62, 6.72, 6.82, 6.93, 7.03, 7.13, 7.24, 7.34, 7.44, 7.55, 7.65, 7.75, 7.86, 7.96, 8.06, 8.17, 8.27, 8.37, 8.48, 8.58, 8.69, 8.79, 8.89, 9, 9.1, 9.2, 9.31, 9.41, 9.51, 9.62, 9.72, 9.82, 9.93, 10.03, 10.13]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 移动速度减少率 : {value3}%
    # REMOVE: data3 = [0, 16.2, 17.3, 18.5, 19.6, 20.7, 21.7, 23, 24, 25.1, 26.2, 27.4, 28.5, 29.6, 30.8, 31.9, 32.9, 34, 35.2, 36.3, 37.4, 38.6, 39.7, 40.8, 41.9, 43.1, 44.1, 45.2, 46.3, 47.5, 48.6, 49.7, 50.9, 52, 53.1, 54.1, 55.4, 56.4, 57.5, 58.6, 59.8, 60.9, 62, 63.2, 64.3, 65.3, 66.4, 67.6, 68.7, 69.8, 71, 72.1, 73.2, 74.3, 75.5, 76.5, 77.6, 78.7, 79.9, 81, 82.1, 83.3, 84.4, 85.5, 86.5, 87.8, 88.8, 89.9, 91, 92.2, 93.3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 攻击速度减少率 : {value4}%
    # REMOVE: data4 = [0, 9.5, 10.1, 10.8, 11.3, 12, 12.7, 13.4, 14, 14.7, 15.3, 15.9, 16.6, 17.3, 18, 18.6, 19.2, 19.8, 20.5, 21.2, 21.9, 22.5, 23.1, 23.8, 24.4, 25.1, 25.8, 26.5, 27, 27.7, 28.4, 29, 29.7, 30.2, 30.9, 31.6, 32.3, 32.9, 33.6, 34.2, 34.8, 35.5, 36.2, 36.9, 37.5, 38.1, 38.7, 39.4, 40.1, 40.8, 41.4, 42, 42.7, 43.3, 44, 44.7, 45.4, 45.9, 46.6, 47.3, 47.9, 48.6, 49.1, 49.8, 50.5, 51.2, 51.8, 52.5, 53.1, 53.7, 54.4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 强化 - 后跳
# thief/rogue/2b340542e776818b78f3212af184bd6b
# ddc49e9ad1ff72a00b53c6cff5b1e920/2b340542e776818b78f3212af184bd6b
class Skill14(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# thief/rogue/1fea5a626f15230237946a11a9d11582
# ddc49e9ad1ff72a00b53c6cff5b1e920/1fea5a626f15230237946a11a9d11582
class Skill15(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 疾空踏
# thief/rogue/717f1e2104fe4b796f800352fa143ecc
# ddc49e9ad1ff72a00b53c6cff5b1e920/717f1e2104fe4b796f800352fa143ecc
class Skill16(ActiveSkill):
    """
    从空中快速下降并向敌人发出连续踢击。\n
    连续踢击结束前， 输入Z键可以发动最后一击。\n
    只能在空中使用， 且在下落过程中有敌人时才能施放连续踢击。\n
    终结攻击会引发冲击波， 被命中的敌人会被击飞。\n
    连续踢击过程中连续按下攻击键时， 会增加连续踢击的速度和命中次数。
    """
    name = "疾空踏"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 6.5
    mp = [22, 235]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = True

    # 连续踢击攻击力 : {value0}%
    # REMOVE: data0 = [0, 336, 370, 404, 438, 472, 506, 540, 574, 608, 642, 676, 710, 745, 779, 813, 847, 881, 915, 949, 983, 1017, 1051, 1085, 1119, 1153, 1187, 1221, 1255, 1290, 1324, 1358, 1392, 1426, 1460, 1494, 1528, 1562, 1596, 1630, 1664, 1698, 1732, 1766, 1800, 1835, 1869, 1903, 1937, 1971, 2005, 2039, 2073, 2107, 2141, 2175, 2209, 2243, 2277, 2311, 2345, 2380, 2414, 2448, 2482, 2516, 2550, 2584, 2618, 2652, 2686]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 连续踢击次数 : {value1}次~{value2}次
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后一击攻击力 : {value3}%
    # REMOVE: data3 = [0, 672, 740, 808, 876, 944, 1012, 1080, 1148, 1217, 1285, 1353, 1421, 1489, 1557, 1625, 1693, 1762, 1830, 1898, 1966, 2034, 2102, 2170, 2238, 2307, 2375, 2443, 2511, 2579, 2647, 2715, 2783, 2852, 2920, 2988, 3056, 3124, 3192, 3260, 3328, 3397, 3465, 3533, 3601, 3669, 3737, 3805, 3873, 3942, 4010, 4078, 4146, 4214, 4282, 4350, 4418, 4487, 4555, 4623, 4691, 4759, 4827, 4895, 4963, 5032, 5100, 5168, 5236, 5304, 5372]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 560, 616, 673, 730, 787, 843, 900, 957, 1014, 1071, 1127, 1184, 1241, 1298, 1354, 1411, 1468, 1525, 1581, 1638, 1695, 1752, 1809, 1865, 1922, 1979, 2036, 2092, 2149, 2206, 2263, 2320, 2376, 2433, 2490, 2547, 2603, 2660, 2717, 2774, 2830, 2887, 2944, 3001, 3058, 3114, 3171, 3228, 3285, 3341, 3398, 3455, 3512, 3568, 3625, 3682, 3739, 3796, 3852, 3909, 3966, 4023, 4079, 4136, 4193, 4250, 4306, 4363, 4420, 4477]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 最后一击浮空力比率 : {value5}%
    # REMOVE: data5 = [0, 100, 102, 104, 105, 107, 109, 110, 112, 114, 116, 117, 119, 121, 123, 124, 126, 128, 129, 131, 133, 135, 136, 138, 140, 142, 143, 145, 147, 148, 150, 152, 154, 155, 157, 159, 160, 162, 164, 166, 167, 169, 171, 173, 174, 176, 178, 179, 181, 183, 185, 186, 188, 190, 192, 193, 195, 197, 198, 200, 202, 204, 205, 207, 209, 210, 212, 214, 216, 217, 219]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 冲击波范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 忍法 : 飞鼠
# thief/rogue/4655101518604f874721b3cc249aae10
# ddc49e9ad1ff72a00b53c6cff5b1e920/4655101518604f874721b3cc249aae10
class Skill17(ActiveSkill):
    """
    快速跳向敌人并引爆炸弹， 给予敌人火属性魔法伤害的同时使敌人浮空。
    """
    name = "忍法 : 飞鼠"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 10
    mp = [10, 84]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = True

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 使用次数上限 : {value1}次
    # REMOVE: data1 = [0, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后一击浮空力比率 : {value2}%
    # REMOVE: data2 = [0, 400, 407, 414, 421, 428, 434, 441, 448, 455, 462, 469, 476, 483, 490, 497, 503, 510, 517, 524, 531, 538, 545, 552, 559, 566, 572, 579, 586, 593, 600, 607, 614, 621, 628, 634, 641, 648, 655, 662, 669, 676, 683, 690, 697, 703, 710, 717, 724, 731, 738, 745, 752, 759, 766, 772, 779, 786, 793, 800, 807, 814, 821, 828, 834, 841, 848, 855, 862, 869, 876]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每次追击时攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后一击时攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 每次追击时爆炸范围增加率 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 最后一击爆炸范围增加率 : {value6}%
    # REMOVE: data6 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 爆炸范围比率 : {value7}%
    # REMOVE: data7 = [0, 142, 143, 143, 145, 146, 146, 148, 149, 151, 151, 152, 153, 153, 155, 156, 156, 158, 159, 159, 160, 162, 162, 163, 165, 166, 166, 168, 169, 169, 170, 172, 172, 173, 175, 175, 176, 178, 179, 179, 180, 182, 182, 183, 185, 185, 186, 187, 187, 189, 190, 190, 192, 193, 195, 195, 196, 197, 197, 199, 200, 200, 202, 203, 203, 204, 206, 207, 207, 209, 210]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 天诛
# thief/rogue/f2fb27162beb0b87a7cb9af7900e95f2
# ddc49e9ad1ff72a00b53c6cff5b1e920/f2fb27162beb0b87a7cb9af7900e95f2
class Skill18(ActiveSkill):
    """
    抓取一名敌人后向其头部进行刺击， 被刺击命中的敌人将受到无属性伤害。\n
    若[天诛]背击敌人时， 则会追加一次刺击， 且最后还会追加一次高伤害的切割攻击。
    """
    name = "天诛"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 7
    mp = [28, 308]
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"
    hasVP = False
    hasUP = True

    # 刺击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1499, 1651, 1803, 1955, 2107, 2260, 2412, 2564, 2716, 2868, 3020, 3172, 3324, 3476, 3628, 3780, 3932, 4085, 4237, 4389, 4541, 4693, 4845, 4997, 5149, 5301, 5453, 5605, 5757, 5909, 6062, 6214, 6366, 6518, 6670, 6822, 6974, 7126, 7278, 7430, 7582, 7734, 7887, 8039, 8191, 8343, 8495, 8647, 8799, 8951, 9103, 9255, 9407, 9559, 9712, 9864, 10016, 10168, 10320, 10472, 10624, 10776, 10928, 11080, 11232, 11384, 11537, 11689, 11841, 11993]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 刺击次数 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 切割攻击攻击力 : {value2}%
    # REMOVE: data2 = [0, 6250, 6884, 7518, 8152, 8786, 9420, 10054, 10688, 11322, 11956, 12590, 13224, 13858, 14492, 15126, 15760, 16394, 17028, 17662, 18297, 18931, 19565, 20199, 20833, 21467, 22101, 22735, 23369, 24003, 24637, 25271, 25905, 26539, 27173, 27807, 28441, 29075, 29709, 30343, 30977, 31611, 32245, 32879, 33513, 34147, 34781, 35416, 36050, 36684, 37318, 37952, 38586, 39220, 39854, 40488, 41122, 41756, 42390, 43024, 43658, 44292, 44926, 45560, 46194, 46828, 47462, 48096, 48730, 49364, 49998]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 终结之击
# thief/rogue/cfacda0647b9a0f595df2c2aad30c18d
# ddc49e9ad1ff72a00b53c6cff5b1e920/cfacda0647b9a0f595df2c2aad30c18d
class Skill19(ActiveSkill):
    """
    [终结之击]只能在有连击点数的情况下施放， 施放后将消耗所有连击点数并发动追加攻击。\n
    消耗的连击点数越多， 该技能给予敌人的伤害就越大。
    """
    name = "终结之击"
    learnLv = 15
    masterLv = 20
    maxLv = 30
    position = 6 #TODO
    rangeLv = 2
    mp = [18, 56]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False

    # [终结之击]攻击力比率 : {value0}%
    # REMOVE: data0 = [0, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123, 125, 127, 129, 131, 133, 135, 137, 139]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # - 消耗连击点数后， 攻击力增加比率 -
    # 1点 : {value1}% 
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 2点 : {value2}%
    # REMOVE: data2 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 3点 : {value3}%
    # REMOVE: data3 = [0, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155, 155]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 4点 : {value4}%
    # REMOVE: data4 = [0, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195, 195]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 5点 : {value5}%
    # REMOVE: data5 = [0, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250, 250]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 6点 : {value6}%
    # REMOVE: data6 = [0, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325, 325]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 7点 : {value7}%
    # REMOVE: data7 = [0, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425, 425]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

# 诅咒之箭
# thief/rogue/547ab2b2bd860d3e37355a9cfbc1077c
# ddc49e9ad1ff72a00b53c6cff5b1e920/547ab2b2bd860d3e37355a9cfbc1077c
class Skill20(ActiveSkill):
    """
    召唤暗属性的诅咒之箭后， 向前方敌人发射； 被诅咒之箭命中的敌人会受到暗属性多段魔法伤害， 并有一定几率进入诅咒状态。
    """
    name = "诅咒之箭"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 10 #TODO
    rangeLv = 2
    cd = 10
    mp = [22, 235]
    uuid = "547ab2b2bd860d3e37355a9cfbc1077c"
    hasVP = False
    hasUP = True

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 927, 1021, 1115, 1209, 1303, 1397, 1491, 1585, 1679, 1773, 1867, 1961, 2056, 2150, 2244, 2338, 2432, 2526, 2620, 2714, 2808, 2902, 2996, 3090, 3184, 3278, 3372, 3466, 3560, 3654, 3748, 3842, 3936, 4030, 4124, 4219, 4313, 4407, 4501, 4595, 4689, 4783, 4877, 4971, 5065, 5159, 5253, 5347, 5441, 5535, 5629, 5723, 5817, 5911, 6005, 6099, 6193, 6287, 6382, 6476, 6570, 6664, 6758, 6852, 6946, 7040, 7134, 7228, 7322, 7416]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 发射数量 : {value1}发
    # REMOVE: data1 = [0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 诅咒几率 : {value2}%
    # REMOVE: data2 = [0, 20, 21.4, 22.8, 24.1, 25.5, 26.9, 28.3, 29.7, 31, 32.4, 33.8, 35.2, 36.6, 37.9, 39.3, 40.7, 42.1, 43.4, 44.8, 46.2, 47.6, 49, 50.3, 51.7, 53.1, 54.5, 55.9, 57.2, 58.6, 60, 61.4, 62.8, 64.1, 65.5, 66.9, 68.3, 69.7, 71, 72.4, 73.8, 75.2, 76.6, 77.9, 79.3, 80.7, 82.1, 83.4, 84.8, 86.2, 87.6, 89, 90.3, 91.7, 93.1, 94.5, 95.9, 97.2, 98.6, 100, 101.4, 102.8, 104.1, 105.5, 106.9, 108.3, 109.7, 111, 112.4, 113.8, 115.2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 诅咒持续时间 : {value3}秒
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 多段攻击次数上限 : {value4}
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 弧光连闪
# thief/rogue/4b2c90ec226fd40e967875aa5eabefb2
# ddc49e9ad1ff72a00b53c6cff5b1e920/4b2c90ec226fd40e967875aa5eabefb2
class Skill21(PassiveSkill):
    """
    增加[弧光闪]的追加攻击发动次数。
    """
    name = "弧光连闪"
    learnLv = 15
    masterLv = 1
    maxLv = 10
    position = 5 #TODO
    rangeLv = 2
    uuid = "4b2c90ec226fd40e967875aa5eabefb2"
    hasVP = False
    hasUP = False

    # [弧光闪]追加攻击发动次数增加 : {value0}
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 迅影
# thief/rogue/1b1cfab062e0768bcc889e33e1f30dbf
# ddc49e9ad1ff72a00b53c6cff5b1e920/1b1cfab062e0768bcc889e33e1f30dbf
class Skill22(PassiveSkill):
    """
    使暗星的行动变得更加敏捷， 可增加命中率、 回避率、 攻击速度和移动速度。\n
    强制中断后施放的技能命中敌人时， 可以获得连击点数。\n
    可通过攻击敌人时收集的攻击点数， 额外获得连击点数； 攻击点数能量条蓄满后， 可自动转换为连击点数。\n
    学习后， 后跳过程中可以发动基本攻击。
    """
    name = "迅影"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 5
    uuid = "1b1cfab062e0768bcc889e33e1f30dbf"
    hasVP = False
    hasUP = False

    # 攻击速度增加 : {value0}%
    # REMOVE: data0 = [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 移动速度增加 : {value1}%
    # REMOVE: data1 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 0.3, 0.7, 1, 1.4, 1.7, 2.1, 2.4, 2.8, 3.1, 3.5, 3.8, 4.2, 4.5, 4.9, 5.2, 5.6, 5.9, 6.3, 6.6, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 回避率增加 : {value3}%
    # REMOVE: data3 = [0, 0.6, 1.4, 2, 2.8, 3.4, 4.2, 4.8, 5.6, 6.2, 7, 7.6, 8.4, 9, 9.8, 10.4, 11.2, 11.8, 12.6, 13.2, 14]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [每个技能命中敌人时可收集的攻击点数 / 攻击点数收集上限]
    # 基本攻击 : {value4}P / {value5}P
    # REMOVE: data4 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 前冲攻击 : {value6}P / {value7}P
    # REMOVE: data6 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # REMOVE: data7 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 跳跃攻击 : {value8}P / {value9}P
    # REMOVE: data8 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # REMOVE: data9 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # [翔击] : {value10}P / {value11}P
    # REMOVE: data10 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)
    # REMOVE: data11 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data11 = get_data(f'{prefix}/{uuid}', 11, lambda x = None: x)
    # [弧光闪] : {value12}P / {value13}P
    # REMOVE: data12 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data12 = get_data(f'{prefix}/{uuid}', 12, lambda x = None: x)
    # REMOVE: data13 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data13 = get_data(f'{prefix}/{uuid}', 13, lambda x = None: x)
    # [双刃穿刺] : {value14}P / {value15}P
    # REMOVE: data14 = [0, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14]# noqa: E501
    data14 = get_data(f'{prefix}/{uuid}', 14, lambda x = None: x)
    # REMOVE: data15 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data15 = get_data(f'{prefix}/{uuid}', 15, lambda x = None: x)
    # [绝心击] : {value16}P / {value17}P
    # REMOVE: data16 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data16 = get_data(f'{prefix}/{uuid}', 16, lambda x = None: x)
    # REMOVE: data17 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data17 = get_data(f'{prefix}/{uuid}', 17, lambda x = None: x)
    # [旋舞斩] : {value18}P / {value19}P
    # REMOVE: data18 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data18 = get_data(f'{prefix}/{uuid}', 18, lambda x = None: x)
    # REMOVE: data19 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data19 = get_data(f'{prefix}/{uuid}', 19, lambda x = None: x)
    # [旋刃] : {value20}P / {value21}P
    # REMOVE: data20 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data20 = get_data(f'{prefix}/{uuid}', 20, lambda x = None: x)
    # REMOVE: data21 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data21 = get_data(f'{prefix}/{uuid}', 21, lambda x = None: x)
    # [剑刃风暴] : {value22}P / {value23}P
    # REMOVE: data22 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data22 = get_data(f'{prefix}/{uuid}', 22, lambda x = None: x)
    # REMOVE: data23 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data23 = get_data(f'{prefix}/{uuid}', 23, lambda x = None: x)
    # [雷光刃影] : {value24}P / {value25}P
    # REMOVE: data24 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data24 = get_data(f'{prefix}/{uuid}', 24, lambda x = None: x)
    # REMOVE: data25 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data25 = get_data(f'{prefix}/{uuid}', 25, lambda x = None: x)
    # [螺旋穿刺] : {value26}P / {value27}P
    # REMOVE: data26 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data26 = get_data(f'{prefix}/{uuid}', 26, lambda x = None: x)
    # REMOVE: data27 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data27 = get_data(f'{prefix}/{uuid}', 27, lambda x = None: x)
    # [疾风乱舞] : {value28}P / {value29}P
    # REMOVE: data28 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data28 = get_data(f'{prefix}/{uuid}', 28, lambda x = None: x)
    # REMOVE: data29 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data29 = get_data(f'{prefix}/{uuid}', 29, lambda x = None: x)
    # [绝境瞬狱袭] : {value30}P / {value31}P
    # REMOVE: data30 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data30 = get_data(f'{prefix}/{uuid}', 30, lambda x = None: x)
    # REMOVE: data31 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data31 = get_data(f'{prefix}/{uuid}', 31, lambda x = None: x)
    # [旋刃冲击] : {value32}P / {value33}P
    # REMOVE: data32 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data32 = get_data(f'{prefix}/{uuid}', 32, lambda x = None: x)
    # REMOVE: data33 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data33 = get_data(f'{prefix}/{uuid}', 33, lambda x = None: x)
    # [陨落螺旋刺] : {value34}P / {value35}P
    # REMOVE: data34 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data34 = get_data(f'{prefix}/{uuid}', 34, lambda x = None: x)
    # REMOVE: data35 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data35 = get_data(f'{prefix}/{uuid}', 35, lambda x = None: x)
    # [乱空杀] : {value36}P / {value37}P
    # REMOVE: data36 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data36 = get_data(f'{prefix}/{uuid}', 36, lambda x = None: x)
    # REMOVE: data37 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data37 = get_data(f'{prefix}/{uuid}', 37, lambda x = None: x)
    # [月影突袭] : {value38}P / {value39}P
    # REMOVE: data38 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data38 = get_data(f'{prefix}/{uuid}', 38, lambda x = None: x)
    # REMOVE: data39 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data39 = get_data(f'{prefix}/{uuid}', 39, lambda x = None: x)
    # [天渊星狱] : {value40}P / {value41}P
    # REMOVE: data40 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data40 = get_data(f'{prefix}/{uuid}', 40, lambda x = None: x)
    # REMOVE: data41 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data41 = get_data(f'{prefix}/{uuid}', 41, lambda x = None: x)
    # [幻灭瞬杀] : {value42}P / {value43}P
    # REMOVE: data42 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data42 = get_data(f'{prefix}/{uuid}', 42, lambda x = None: x)
    # REMOVE: data43 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data43 = get_data(f'{prefix}/{uuid}', 43, lambda x = None: x)

# 绝心击
# thief/rogue/4224f9b0b8c7c903e9a1e0f9d9f6d04d
# ddc49e9ad1ff72a00b53c6cff5b1e920/4224f9b0b8c7c903e9a1e0f9d9f6d04d
class Skill23(ActiveSkill):
    """
    快速迈进并向前方敌人进行斩击， 被斩击命中的敌人将受到伤害， 并有一定几率进入眩晕状态。\n
    斩击后， 可消耗连击点数发动[终结之击]。
    """
    name = "绝心击"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 7
    mp = [25, 273]
    uuid = "4224f9b0b8c7c903e9a1e0f9d9f6d04d"
    hasVP = False
    hasUP = True

    # 斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 5952, 6556, 7159, 7763, 8367, 8971, 9575, 10178, 10782, 11386, 11990, 12594, 13197, 13801, 14405, 15009, 15613, 16216, 16820, 17424, 18028, 18632, 19235, 19839, 20443, 21047, 21651, 22255, 22858, 23462, 24066, 24670, 25274, 25877, 26481, 27085, 27689, 28293, 28896, 29500, 30104, 30708, 31312, 31915, 32519, 33123, 33727, 34331, 34934, 35538, 36142, 36746, 37350, 37953, 38557, 39161, 39765, 40369, 40972, 41576, 42180, 42784, 43388, 43991, 44595, 45199, 45803, 46407, 47010, 47614]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 眩晕几率 : {value1}%
    # REMOVE: data1 = [0, 41.6, 43.2, 44.8, 46.4, 48, 49.6, 51.2, 52.8, 54.4, 56, 57.6, 59.2, 60.8, 62.4, 64, 65.6, 67.2, 68.8, 70.4, 72, 73.6, 75.2, 76.8, 78.4, 80, 81.6, 83.2, 84.8, 86.4, 88, 89.6, 91.2, 92.8, 94.4, 96, 97.6, 99.2, 100.8, 102.4, 104, 105.6, 107.2, 108.8, 110.4, 112, 113.6, 115.2, 116.8, 118.4, 118.4, 121.5, 123.1, 124.7, 126.3, 127.9, 129.5, 131, 132.6, 134.2, 135.8, 137.4, 139, 140.6, 142.2, 143.8, 145.4, 147, 148.6, 150.2, 151.8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 眩晕持续时间 : {value2}秒
    # REMOVE: data2 = [0, 1.04, 1.08, 1.12, 1.15, 1.2, 1.24, 1.28, 1.32, 1.36, 1.4, 1.44, 1.48, 1.52, 1.56, 1.6, 1.64, 1.68, 1.72, 1.76, 1.8, 1.84, 1.88, 1.92, 1.96, 2, 2.04, 2.08, 2.12, 2.16, 2.2, 2.24, 2.28, 2.31, 2.36, 2.4, 2.44, 2.48, 2.52, 2.56, 2.6, 2.64, 2.68, 2.72, 2.76, 2.8, 2.84, 2.88, 2.92, 2.96, 2.96, 3.03, 3.07, 3.11, 3.15, 3.19, 3.23, 3.27, 3.31, 3.35, 3.39, 3.43, 3.47, 3.51, 3.55, 3.59, 3.63, 3.67, 3.71, 3.75, 3.79]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # -  [终结之击]时  -
    # 踢击攻击力 : {value3}%
    # REMOVE: data3 = [0, 182, 201, 219, 238, 256, 275, 293, 312, 330, 349, 367, 386, 404, 422, 441, 459, 478, 496, 515, 533, 552, 570, 589, 607, 626, 644, 663, 681, 700, 718, 737, 755, 774, 792, 811, 829, 848, 866, 885, 903, 922, 940, 959, 977, 995, 1014, 1032, 1051, 1069, 1088, 1106, 1125, 1143, 1162, 1180, 1199, 1217, 1236, 1254, 1273, 1291, 1310, 1328, 1347, 1365, 1384, 1402, 1421, 1439, 1458]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 切割攻击力 : {value4}% X {value5}
    # REMOVE: data4 = [0, 337, 371, 405, 440, 474, 508, 542, 576, 611, 645, 679, 713, 747, 781, 816, 850, 884, 918, 952, 987, 1021, 1055, 1089, 1123, 1158, 1192, 1226, 1260, 1294, 1328, 1363, 1397, 1431, 1465, 1499, 1534, 1568, 1602, 1636, 1670, 1705, 1739, 1773, 1807, 1841, 1876, 1910, 1944, 1978, 2012, 2046, 2081, 2115, 2149, 2183, 2217, 2252, 2286, 2320, 2354, 2388, 2423, 2457, 2491, 2525, 2559, 2593, 2628, 2662, 2696]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 空跃
# thief/rogue/d085127b0edd719782bd618d5688f4a1
# ddc49e9ad1ff72a00b53c6cff5b1e920/d085127b0edd719782bd618d5688f4a1
class Skill24(ActiveSkill):
    """
    在跳跃中进行再一次跳跃。
    """
    name = "空跃"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 10 #TODO
    rangeLv = 1
    uuid = "d085127b0edd719782bd618d5688f4a1"
    hasVP = False
    hasUP = False


# 双刃穿刺
# thief/rogue/8ee0099656df08a0b39225f8a21d514b
# ddc49e9ad1ff72a00b53c6cff5b1e920/8ee0099656df08a0b39225f8a21d514b
class Skill25(ActiveSkill):
    """
    用双手把武器插入敌人身体后， 再用脚踢进行攻击。\n
    对可抓取的敌人命中刺击时， 进入无敌状态并强控敌人。\n
    对无法抓取的敌人不适用控制效果。\n
    可消耗连击点数发动[终结之击]。
    """
    name = "双刃穿刺"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 7
    mp = [47, 518]
    uuid = "8ee0099656df08a0b39225f8a21d514b"
    hasVP = False
    hasUP = True

    # 双手刺击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1445, 1592, 1739, 1885, 2032, 2179, 2325, 2472, 2618, 2765, 2912, 3058, 3205, 3352, 3498, 3645, 3791, 3938, 4085, 4231, 4378, 4525, 4671, 4818, 4965, 5111, 5258, 5404, 5551, 5698, 5844, 5991, 6138, 6284, 6431, 6578, 6724, 6871, 7017, 7164, 7311, 7457, 7604, 7751, 7897, 8044, 8190, 8337, 8484, 8630, 8777, 8924, 9070, 9217, 9364, 9510, 9657, 9803, 9950, 10097, 10243, 10390, 10537, 10683, 10830, 10976, 11123, 11270, 11416, 11563]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第1次踢击攻击力 : {value1}%
    # REMOVE: data1 = [0, 2166, 2385, 2605, 2825, 3045, 3264, 3484, 3704, 3923, 4143, 4363, 4583, 4802, 5022, 5242, 5461, 5681, 5901, 6121, 6340, 6560, 6780, 6999, 7219, 7439, 7659, 7878, 8098, 8318, 8537, 8757, 8977, 9197, 9416, 9636, 9856, 10075, 10295, 10515, 10734, 10954, 11174, 11394, 11613, 11833, 12053, 12272, 12492, 12712, 12932, 13151, 13371, 13591, 13810, 14030, 14250, 14470, 14689, 14909, 15129, 15348, 15568, 15788, 16008, 16227, 16447, 16667, 16886, 17106, 17326]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 第2次踢击攻击力 : {value2}%
    # REMOVE: data2 = [0, 2888, 3181, 3474, 3766, 4059, 4352, 4645, 4938, 5231, 5524, 5817, 6110, 6403, 6696, 6989, 7282, 7575, 7868, 8161, 8454, 8747, 9040, 9333, 9625, 9918, 10211, 10504, 10797, 11090, 11383, 11676, 11969, 12262, 12555, 12848, 13141, 13434, 13727, 14020, 14313, 14606, 14899, 15191, 15484, 15777, 16070, 16363, 16656, 16949, 17242, 17535, 17828, 18121, 18414, 18707, 19000, 19293, 19586, 19879, 20172, 20465, 20758, 21050, 21343, 21636, 21929, 22222, 22515, 22808, 23101]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [终结之击]攻击力比率 : {value3}%
    # REMOVE: data3 = [0, 1297, 1429, 1560, 1692, 1824, 1955, 2087, 2218, 2350, 2482, 2613, 2745, 2877, 3008, 3140, 3271, 3403, 3535, 3666, 3798, 3929, 4061, 4193, 4324, 4456, 4587, 4719, 4851, 4982, 5114, 5245, 5377, 5509, 5640, 5772, 5903, 6035, 6167, 6298, 6430, 6561, 6693, 6825, 6956, 7088, 7220, 7351, 7483, 7614, 7746, 7878, 8009, 8141, 8272, 8404, 8536, 8667, 8799, 8930, 9062, 9194, 9325, 9457, 9588, 9720, 9852, 9983, 10115, 10246, 10378]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 周围敌人的伤害比率 : {value4}%
    # REMOVE: data4 = [0, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115, 115]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 暗星武器精通
# thief/rogue/da6e37c1e3f0e8867f70007d89c239ff
# ddc49e9ad1ff72a00b53c6cff5b1e920/da6e37c1e3f0e8867f70007d89c239ff
class Skill26(PassiveSkill):
    """
       学习后， 增加物理攻击力， 并减少转职技能的冷却时间， 同时增加[终结之击]攻击力。 技能达到15级以上时， 提升每个技能命中敌人时可收集的攻击点数和攻击点数收集上限， 并且在装备匕首和双剑时获得额外效果。\n
    [装备匕首时]\n
    使用匕首系武器时， 增加攻击速度、 回避率、 命中率。\n
    [装备双剑时]\n
    使用双剑系武器时， 增加敌人的僵直率、 回避率、 命中率。
    """
    name = "暗星武器精通"
    learnLv = 20
    masterLv = 20
    maxLv = 30
    position = 0 #TODO
    rangeLv = 4
    uuid = "da6e37c1e3f0e8867f70007d89c239ff"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 3.6, 5.3, 7, 8.7, 10.4, 12.1, 13.8, 15.5, 17.2, 18.9, 20.6, 22.3, 24, 25.7, 27.4, 29.1, 30.8, 32.5, 34.2, 35.9, 38.7, 41.5, 44.3, 47.1, 49.9, 52.7, 55.5, 58.3, 61.1, 63.9]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冷却时间减少率 : {value1}%
    # REMOVE: data1 = [0, 1, 1.3, 1.6, 1.9, 2.2, 2.5, 2.8, 3.1, 3.4, 3.7, 4, 4.3, 4.6, 4.9, 5.2, 5.5, 5.8, 6.1, 6.4, 6.7, 7, 7.3, 7.6, 7.9, 8.2, 8.5, 8.8, 9.1, 9.4, 9.7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力增加率 : {value2}%
    # REMOVE: data2 = [0, 22, 23, 25, 26, 27, 28, 29, 31, 32, 33, 34, 36, 37, 38, 39, 40, 42, 43, 44, 45, 46, 48, 49, 50, 51, 52, 54, 55, 56, 57]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每次攻击可收集的攻击点数比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 每次攻击可收集的攻击点数最大值比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [装备匕首时]
    # 攻击速度增加 : {value5}%
    # REMOVE: data5 = [0, 1, 1.8, 2.6, 3.4, 4.2, 5, 5.8, 6.6, 7.4, 8.2, 9, 9.8, 10.6, 11.4, 12.2, 13, 13.8, 14.6, 15.4, 16.2, 17, 17.8, 18.6, 19.4, 20.2, 21, 21.8, 22.6, 23.4, 24.2]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 回避率增加 : {value6}%
    # REMOVE: data6 = [0, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 命中率增加 : {value7}%.
    # REMOVE: data7 = [0, 0.8, 1.2, 1.8, 2.2, 2.6, 3, 3.4, 3.8, 4.2, 4.8, 5.2, 5.6, 6, 6.4, 6.8, 7.2, 7.8, 8.2, 8.6, 9, 9.4, 9.8, 10.2, 10.8, 11.2, 11.6, 12, 12.4, 12.8, 13.2]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [装备双剑时]
    # 敌人僵直率增加 : {value8}%
    # REMOVE: data8 = [0, 2.8, 5.8, 8.6, 11.4, 14.2, 17.2, 20, 22.8, 25.8, 28.6, 31.4, 34.2, 37.2, 40, 42.8, 45.8, 48.6, 51.4, 54.2, 57.2, 60, 62.8, 65.8, 68.6, 71.4, 74.2, 77.2, 80, 82.8, 85.8]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 回避率增加 : {value9}%
    # REMOVE: data9 = [0, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)
    # 命中率增加 : {value10}%
    # REMOVE: data10 = [0, 0.8, 1.2, 1.8, 2.2, 2.6, 3, 3.4, 3.8, 4.2, 4.8, 5.2, 5.6, 6, 6.4, 6.8, 7.2, 7.8, 8.2, 8.6, 9, 9.4, 9.8, 10.2, 10.8, 11.2, 11.6, 12, 12.4, 12.8, 13.2]# noqa: E501
    data10 = get_data(f'{prefix}/{uuid}', 10, lambda x = None: x)

# 旋舞斩
# thief/rogue/c7bf7ccab413009640e65ca6f2f0263a
# ddc49e9ad1ff72a00b53c6cff5b1e920/c7bf7ccab413009640e65ca6f2f0263a
class Skill27(ActiveSkill):
    """
    在原地快速旋转并攻击周围敌人。\n
    在地上施放转职技能时， 可强制中断当前进行的技能动作， 并立即施放[旋舞斩]。\n
    可消耗1点连击点数发动[终结之击]。 [终结之击]发动后若存在连击点数， 则可以继续发动[终结之击]。
    """
    name = "旋舞斩"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 7
    mp = [25, 273]
    uuid = "c7bf7ccab413009640e65ca6f2f0263a"
    hasVP = False
    hasUP = True

    # 回旋斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 5629, 6200, 6771, 7342, 7913, 8484, 9055, 9626, 10197, 10768, 11339, 11910, 12481, 13053, 13624, 14195, 14766, 15337, 15908, 16479, 17050, 17621, 18192, 18763, 19334, 19905, 20476, 21047, 21618, 22189, 22760, 23331, 23902, 24473, 25045, 25616, 26187, 26758, 27329, 27900, 28471, 29042, 29613, 30184, 30755, 31326, 31897, 32468, 33039, 33610, 34181, 34752, 35323, 35894, 36465, 37036, 37608, 38179, 38750, 39321, 39892, 40463, 41034, 41605, 42176, 42747, 43318, 43889, 44460, 45031]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [终结之击]攻击力 : {value1}%
    # REMOVE: data1 = [0, 1127, 1241, 1356, 1470, 1584, 1699, 1813, 1927, 2042, 2156, 2270, 2385, 2499, 2613, 2728, 2842, 2956, 3071, 3185, 3299, 3414, 3528, 3642, 3757, 3871, 3985, 4100, 4214, 4328, 4443, 4557, 4671, 4786, 4900, 5014, 5129, 5243, 5357, 5472, 5586, 5700, 5815, 5929, 6043, 6158, 6272, 6386, 6501, 6615, 6729, 6844, 6958, 7072, 7187, 7301, 7415, 7530, 7644, 7758, 7873, 7987, 8101, 8216, 8330, 8444, 8559, 8673, 8787, 8902, 9016]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暴击
# thief/rogue/fc1262c19f3d0477ee8eda47b8db8696
# ddc49e9ad1ff72a00b53c6cff5b1e920/fc1262c19f3d0477ee8eda47b8db8696
class Skill28(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 旋刃
# thief/rogue/01384bbfc346775d1267fa0bc4ca605f
# ddc49e9ad1ff72a00b53c6cff5b1e920/01384bbfc346775d1267fa0bc4ca605f
class Skill29(ActiveSkill):
    """
    旋转刀锋， 以极快速度切割敌人。\n
    再次输入技能键或Z键， 可以发动第二击和第三击横扫攻击， 第三击横扫后消耗连击点数发动[终结之击]。\n
    学习[绝命时刻]后， 施放时将以极快的速度一次性发动第一击、 第二击、 第三击横扫攻击。
    """
    name = "旋刃"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 8
    mp = [45, 469]
    uuid = "01384bbfc346775d1267fa0bc4ca605f"
    hasVP = False
    hasUP = True

    # 第1次斩击攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 619, 682, 745, 807, 870, 933, 996, 1059, 1121, 1184, 1247, 1310, 1373, 1435, 1498, 1561, 1624, 1686, 1749, 1812, 1875, 1938, 2000, 2063, 2126, 2189, 2252, 2314, 2377, 2440, 2503, 2566, 2628, 2691, 2754, 2817, 2880, 2942, 3005, 3068, 3131, 3194, 3256, 3319, 3382, 3445, 3508, 3570, 3633, 3696, 3759, 3822, 3884, 3947, 4010, 4073, 4135, 4198, 4261, 4324, 4387, 4449, 4512, 4575, 4638, 4701, 4763, 4826, 4889, 4952]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 第2次斩击攻击力 : {value2}% X {value3}
    # REMOVE: data2 = [0, 855, 942, 1028, 1115, 1202, 1289, 1375, 1462, 1549, 1635, 1722, 1809, 1896, 1982, 2069, 2156, 2243, 2329, 2416, 2503, 2589, 2676, 2763, 2850, 2936, 3023, 3110, 3197, 3283, 3370, 3457, 3544, 3630, 3717, 3804, 3890, 3977, 4064, 4151, 4237, 4324, 4411, 4498, 4584, 4671, 4758, 4844, 4931, 5018, 5105, 5191, 5278, 5365, 5452, 5538, 5625, 5712, 5798, 5885, 5972, 6059, 6145, 6232, 6319, 6406, 6492, 6579, 6666, 6752, 6839]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 第3次斩击攻击力 : {value4}% X {value5}
    # REMOVE: data4 = [0, 1170, 1289, 1408, 1526, 1645, 1764, 1882, 2001, 2120, 2238, 2357, 2476, 2595, 2713, 2832, 2951, 3069, 3188, 3307, 3426, 3544, 3663, 3782, 3900, 4019, 4138, 4256, 4375, 4494, 4613, 4731, 4850, 4969, 5087, 5206, 5325, 5444, 5562, 5681, 5800, 5918, 6037, 6156, 6274, 6393, 6512, 6631, 6749, 6868, 6987, 7105, 7224, 7343, 7462, 7580, 7699, 7818, 7936, 8055, 8174, 8292, 8411, 8530, 8649, 8767, 8886, 9005, 9123, 9242, 9361]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [终结之击]攻击力 : {value6}% X {value7}
    # REMOVE: data6 = [0, 527, 580, 634, 687, 741, 794, 848, 901, 955, 1008, 1062, 1115, 1169, 1222, 1276, 1329, 1382, 1436, 1489, 1543, 1596, 1650, 1703, 1757, 1810, 1864, 1917, 1971, 2024, 2078, 2131, 2184, 2238, 2291, 2345, 2398, 2452, 2505, 2559, 2612, 2666, 2719, 2773, 2826, 2880, 2933, 2986, 3040, 3093, 3147, 3200, 3254, 3307, 3361, 3414, 3468, 3521, 3575, 3628, 3682, 3735, 3788, 3842, 3895, 3949, 4002, 4056, 4109, 4163, 4216]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # REMOVE: data7 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

# 疾驰
# thief/rogue/42c82812f86ff6704ae9952a2e6093a4
# ddc49e9ad1ff72a00b53c6cff5b1e920/42c82812f86ff6704ae9952a2e6093a4
class Skill30(ActiveSkill):
    """
    用极快的速度向前方冲刺。\n
    施放技能时， 若按上/下方向键， 则可以控制冲刺方向； 移动时， 进入无敌状态。\n
    可以强制中断冲刺并立即施放基本攻击、 跳跃以及技能； 可以强制中断当前进行的技能动作， 并立即施放[疾驰]。
    """
    name = "疾驰"
    learnLv = 30
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    mp = [10, 10]
    uuid = "42c82812f86ff6704ae9952a2e6093a4"
    hasVP = False
    hasUP = False


# 剑刃风暴
# thief/rogue/3829c15bf5f520c13998a3479ba0ce7b
# ddc49e9ad1ff72a00b53c6cff5b1e920/3829c15bf5f520c13998a3479ba0ce7b
class Skill31(ActiveSkill):
    """
    快速旋转切割周围的敌人。\n
    旋转时， 可以用方向键控制移动方向， 在空中也可以发动。\n
    旋转攻击中可以消耗连击点数发动[终结之击]； 发动[终结之击]时， 可以垂直上升并使敌人浮空。\n
    学习[绝命时刻]后， 增加移动速度和吸附力， 减少多段攻击间隔。
    """
    name = "剑刃风暴"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 10
    mp = [65, 699]
    uuid = "3829c15bf5f520c13998a3479ba0ce7b"
    hasVP = False
    hasUP = True

    # 旋转攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 1137, 1252, 1368, 1483, 1598, 1714, 1829, 1944, 2060, 2175, 2291, 2406, 2521, 2637, 2752, 2867, 2983, 3098, 3213, 3329, 3444, 3559, 3675, 3790, 3905, 4021, 4136, 4251, 4367, 4482, 4598, 4713, 4828, 4944, 5059, 5174, 5290, 5405, 5520, 5636, 5751, 5866, 5982, 6097, 6212, 6328, 6443, 6558, 6674, 6789, 6905, 7020, 7135, 7251, 7366, 7481, 7597, 7712, 7827, 7943, 8058, 8173, 8289, 8404, 8519, 8635, 8750, 8865, 8981, 9096]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 2283, 2514, 2746, 2978, 3209, 3441, 3672, 3904, 4135, 4367, 4599, 4830, 5062, 5293, 5525, 5757, 5988, 6220, 6451, 6683, 6915, 7146, 7378, 7609, 7841, 8072, 8304, 8536, 8767, 8999, 9230, 9462, 9694, 9925, 10157, 10388, 10620, 10851, 11083, 11315, 11546, 11778, 12009, 12241, 12473, 12704, 12936, 13167, 13399, 13631, 13862, 14094, 14325, 14557, 14788, 15020, 15252, 15483, 15715, 15946, 16178, 16410, 16641, 16873, 17104, 17336, 17567, 17799, 18031, 18262]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 旋转时移动速度 : {value3}
    # REMOVE: data3 = [0, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 侧步
# thief/rogue/e49e57b2e8fbeceb0a2c56a0c63fe6c5
# ddc49e9ad1ff72a00b53c6cff5b1e920/e49e57b2e8fbeceb0a2c56a0c63fe6c5
class Skill32(ActiveSkill):
    """
    向Y轴侧跳移动， 按上下方向键可以控制移动方向。 若不按方向键， 则默认向下方移动。\n
    可以强制中断转职技能并立即施放[侧步]。 施放时可以按攻击键进行跳跃攻击。\n
    在决斗场中施放[侧步]时无法进行跳跃攻击。
    """
    name = "侧步"
    learnLv = 30
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    cd = 1.2
    mp = [3, 3]
    uuid = "e49e57b2e8fbeceb0a2c56a0c63fe6c5"
    hasVP = False
    hasUP = False


# 暗掠
# thief/rogue/b501ae53638d33a32351904f31cb6aa3
# ddc49e9ad1ff72a00b53c6cff5b1e920/b501ae53638d33a32351904f31cb6aa3
class Skill33(ActiveSkill):
    """
    增加暴击伤害， 效果持续一定时间。
    """
    name = "暗掠"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 2
    cd = 5
    uuid = "b501ae53638d33a32351904f31cb6aa3"
    hasVP = False
    hasUP = False

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 暴击伤害增加率 : {value1}%
    # REMOVE: data1 = [0, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 螺旋穿刺
# thief/rogue/bb34e8854a93fd250347a1c64119f7ab
# ddc49e9ad1ff72a00b53c6cff5b1e920/bb34e8854a93fd250347a1c64119f7ab
class Skill34(ActiveSkill):
    """
    向前移动并使自身急速旋转攻击敌人。\n
    若在地面上施放该技能， 则以抛物线跳跃并旋转； 若在空中施放该技能， 则水平前进并发动旋转攻击。\n
    向前移动过程中， 若再次按技能键或<Z>键， 则直接向下进行强力攻击并形成冲击波； 此时， 可以消耗连击点数发动[终结之击]。
    """
    name = "螺旋穿刺"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [128, 1072]
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 移动距离 : {value0}px
    # REMOVE: data0 = [0, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋转攻击力 : {value1}% X {value2}
    # REMOVE: data1 = [0, 1515, 1669, 1822, 1976, 2130, 2283, 2437, 2591, 2744, 2898, 3052, 3205, 3359, 3513, 3666, 3820, 3974, 4127, 4281, 4435, 4589, 4742, 4896, 5050, 5203, 5357, 5511, 5664, 5818, 5972, 6125, 6279, 6433, 6586, 6740, 6894, 7047, 7201, 7355, 7508, 7662, 7816, 7970, 8123, 8277, 8431, 8584, 8738, 8892, 9045, 9199, 9353, 9506, 9660, 9814, 9967, 10121, 10275, 10428, 10582, 10736, 10889, 11043, 11197, 11351, 11504, 11658, 11812, 11965, 12119]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 向下强击攻击力 : {value3}%
    # REMOVE: data3 = [0, 1516, 1670, 1823, 1977, 2131, 2285, 2438, 2592, 2746, 2900, 3054, 3207, 3361, 3515, 3669, 3823, 3976, 4130, 4284, 4438, 4591, 4745, 4899, 5053, 5207, 5360, 5514, 5668, 5822, 5975, 6129, 6283, 6437, 6591, 6744, 6898, 7052, 7206, 7359, 7513, 7667, 7821, 7975, 8128, 8282, 8436, 8590, 8743, 8897, 9051, 9205, 9359, 9512, 9666, 9820, 9974, 10127, 10281, 10435, 10589, 10743, 10896, 11050, 11204, 11358, 11511, 11665, 11819, 11973, 12127]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 5318, 5857, 6397, 6936, 7476, 8015, 8555, 9094, 9634, 10173, 10713, 11252, 11792, 12331, 12871, 13410, 13950, 14489, 15029, 15568, 16108, 16647, 17186, 17726, 18265, 18805, 19344, 19884, 20423, 20963, 21502, 22042, 22581, 23121, 23660, 24200, 24739, 25279, 25818, 26358, 26897, 27437, 27976, 28516, 29055, 29595, 30134, 30674, 31213, 31753, 32292, 32832, 33371, 33911, 34450, 34990, 35529, 36069, 36608, 37147, 37687, 38226, 38766, 39305, 39845, 40384, 40924, 41463, 42003, 42542]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [终结之击]攻击力 : {value5}%
    # REMOVE: data5 = [0, 3192, 3516, 3840, 4164, 4488, 4811, 5135, 5459, 5783, 6107, 6431, 6755, 7078, 7402, 7726, 8050, 8374, 8698, 9021, 9345, 9669, 9993, 10317, 10641, 10965, 11288, 11612, 11936, 12260, 12584, 12908, 13231, 13555, 13879, 14203, 14527, 14851, 15175, 15498, 15822, 16146, 16470, 16794, 17118, 17441, 17765, 18089, 18413, 18737, 19061, 19385, 19708, 20032, 20356, 20680, 21004, 21328, 21651, 21975, 22299, 22623, 22947, 23271, 23595, 23918, 24242, 24566, 24890, 25214, 25538]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value6}%
    # REMOVE: data6 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [螺旋穿刺]\n
        基本冷却时间变更为30秒\n
        - 总攻击力 +100%\n
        施放过程中回避率 +50%\n
        可以通过按左、 右方向键调整[终结之击]发动方向
        """
        ...

    def vp_2(self):
        """
        [螺旋穿刺]\n
        攻击范围及移动距离 +60%\n
        地面施放时， 会跳跃后发动技能\n
        旋转攻击强化\n
        - 不穿透敌人\n
        - 多段攻击次数 +200%\n
        - 多段攻击间隔 -67%\n
        [终结之击]变更\n
        - 旋转攻击中再次按技能键无法发动下劈\n
        - 旋转攻击中可以发动[终结之击]\n
        - [终结之击]变更为下劈攻击\n
        - 下劈攻击及下劈冲击波攻击力合算至[终结之击]\n
        总攻击力相同
        """
        ...

# 雷光刃影
# thief/rogue/e4c354a89c337310aeb7041d5e742828
# ddc49e9ad1ff72a00b53c6cff5b1e920/e4c354a89c337310aeb7041d5e742828
class Skill35(ActiveSkill):
    """
    抓取敌人后， 对其进行连续地突刺攻击， 最后再向下猛踢敌人。\n
    向下猛踢碰到地面时， 生成冲击波； 抓取成功时， 进入无敌状态， 并使敌人进入强制控制状态。\n
    攻击无法抓取的敌人时， 将直接进行向下猛踢， 增加向下猛踢攻击力且不会控制敌人。 向下猛踢后， 可消耗连击点数发动[终结之击]。\n
    在决斗场中[终结之击]无法使敌人浮空。
    """
    name = "雷光刃影"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [91, 763]
    uuid = "e4c354a89c337310aeb7041d5e742828"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 突刺攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 1602, 1765, 1927, 2090, 2252, 2415, 2578, 2740, 2903, 3065, 3228, 3390, 3553, 3715, 3878, 4040, 4203, 4366, 4528, 4691, 4853, 5016, 5178, 5341, 5503, 5666, 5828, 5991, 6154, 6316, 6479, 6641, 6804, 6966, 7129, 7291, 7454, 7616, 7779, 7942, 8104, 8267, 8429, 8592, 8754, 8917, 9079, 9242, 9405, 9567, 9730, 9892, 10055, 10217, 10380, 10542, 10705, 10867, 11030, 11193, 11355, 11518, 11680, 11843, 12005, 12168, 12330, 12493, 12655, 12818]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 踢击攻击力 : {value2}%
    # REMOVE: data2 = [0, 4807, 5294, 5782, 6270, 6757, 7245, 7733, 8220, 8708, 9196, 9683, 10171, 10658, 11146, 11634, 12121, 12609, 13097, 13584, 14072, 14560, 15047, 15535, 16023, 16510, 16998, 17485, 17973, 18461, 18948, 19436, 19924, 20411, 20899, 21387, 21874, 22362, 22849, 23337, 23825, 24312, 24800, 25288, 25775, 26263, 26751, 27238, 27726, 28214, 28701, 29189, 29676, 30164, 30652, 31139, 31627, 32115, 32602, 33090, 33578, 34065, 34553, 35041, 35528, 36016, 36503, 36991, 37479, 37966, 38454]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 踢击攻击力  (无法抓取的敌人) : {value3}%
    # REMOVE: data3 = [0, 9614, 10589, 11564, 12539, 13515, 14490, 15465, 16440, 17416, 18391, 19366, 20342, 21317, 22292, 23267, 24243, 25218, 26193, 27169, 28144, 29119, 30094, 31070, 32045, 33020, 33996, 34971, 35946, 36921, 37897, 38872, 39847, 40823, 41798, 42773, 43748, 44724, 45699, 46674, 47650, 48625, 49600, 50575, 51551, 52526, 53501, 54477, 55452, 56427, 57402, 58378, 59353, 60328, 61303, 62279, 63254, 64229, 65205, 66180, 67155, 68130, 69106, 70081, 71056, 72032, 73007, 73982, 74957, 75933, 76908]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 踢击冲击波攻击力 : {value4}%
    # REMOVE: data4 = [0, 6410, 7061, 7711, 8361, 9012, 9662, 10312, 10963, 11613, 12263, 12913, 13564, 14214, 14864, 15515, 16165, 16815, 17466, 18116, 18766, 19417, 20067, 20717, 21368, 22018, 22668, 23319, 23969, 24619, 25270, 25920, 26570, 27220, 27871, 28521, 29171, 29822, 30472, 31122, 31773, 32423, 33073, 33724, 34374, 35024, 35675, 36325, 36975, 37626, 38276, 38926, 39577, 40227, 40877, 41527, 42178, 42828, 43478, 44129, 44779, 45429, 46080, 46730, 47380, 48031, 48681, 49331, 49982, 50632, 51282]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [终结之击]攻击力 : {value5}%
    # REMOVE: data5 = [0, 3203, 3528, 3853, 4178, 4503, 4828, 5153, 5478, 5803, 6128, 6453, 6778, 7103, 7428, 7753, 8078, 8403, 8728, 9053, 9378, 9703, 10027, 10352, 10677, 11002, 11327, 11652, 11977, 12302, 12627, 12952, 13277, 13602, 13927, 14252, 14577, 14902, 15227, 15552, 15877, 16202, 16527, 16852, 17177, 17502, 17827, 18152, 18477, 18801, 19126, 19451, 19776, 20101, 20426, 20751, 21076, 21401, 21726, 22051, 22376, 22701, 23026, 23351, 23676, 24001, 24326, 24651, 24976, 25301, 25626]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 范围比率 (除踢击冲击波) : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 踢击冲击波范围比率 : {value7}%
    # REMOVE: data7 = [0, 100, 101, 102, 103.5, 104.5, 105.5, 106.5, 108, 109, 110, 111, 112, 113.5, 114.5, 115.5, 116.5, 118, 119, 120, 121, 122, 123.5, 124.5, 125.5, 126.5, 128, 129, 130, 131, 132, 133.5, 134.5, 135.5, 136.5, 138, 139, 140, 141, 142, 143.5, 144.5, 145.5, 146.5, 148, 149, 150, 151, 152, 153.5, 154.5, 155.5, 156.5, 158, 159, 160, 161, 162, 163.5, 164.5, 165.5, 166.5, 168, 169, 170, 171, 172, 173.5, 174.5, 175.5, 176.5]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    def vp_1(self):
        """
        [雷光刃影]\n
        固定以对无法抓取目标的形态发动\n
        - 踢击攻击下落速度 +40%\n
        [月轮舞]\n
        使用[雷光刃影]的[终结之击]时， 攻击速度和移动速度增加量增加20%， 效果持续15秒
        """
        ...

    def vp_2(self):
        """
        [雷光刃影]\n
        吸附周围敌人并抓取\n
        攻击范围 +25%\n
        抓取失败时冷却时间变更为2秒
        """
        ...

# 疾风乱舞
# thief/rogue/1dad88963abdc96b091fcab185a8820d
# ddc49e9ad1ff72a00b53c6cff5b1e920/1dad88963abdc96b091fcab185a8820d
class Skill36(ActiveSkill):
    """
    快速接近前方敌人， 并对该敌人进行狂风般的乱舞攻击。\n
    突进过程中， 按上下方向键可以调整移动方向， 成功抓住后进入无敌状态并强控敌人。\n
    乱舞攻击时， 若按跳跃键， 则会向周围的其他敌人瞬移， 并对其进行乱舞攻击。此时， 会在之前乱舞攻击过的敌人身上留下一个分身； 分身会在一定时间内持续攻击该敌人后消失。\n
    后踢后， 可消耗连击点数发动[终结之击]。\n
    在决斗场中， 强制中断基本攻击和技能动作发动时， 无法沿Y轴移动。
    """
    name = "疾风乱舞"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [164, 1376]
    uuid = "1dad88963abdc96b091fcab185a8820d"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 乱舞攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 1524, 1679, 1833, 1988, 2143, 2297, 2452, 2606, 2761, 2916, 3070, 3225, 3379, 3534, 3689, 3843, 3998, 4153, 4307, 4462, 4616, 4771, 4926, 5080, 5235, 5389, 5544, 5699, 5853, 6008, 6163, 6317, 6472, 6626, 6781, 6936, 7090, 7245, 7399, 7554, 7709, 7863, 8018, 8173, 8327, 8482, 8636, 8791, 8946, 9100, 9255, 9409, 9564, 9719, 9873, 10028, 10182, 10337, 10492, 10646, 10801, 10956, 11110, 11265, 11419, 11574, 11729, 11883, 12038, 12192]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 分身攻击力 : {value2}% X {value3}
    # REMOVE: data2 = [0, 1514, 1668, 1822, 1975, 2129, 2282, 2436, 2590, 2743, 2897, 3051, 3204, 3358, 3511, 3665, 3819, 3972, 4126, 4280, 4433, 4587, 4740, 4894, 5048, 5201, 5355, 5509, 5662, 5816, 5969, 6123, 6277, 6430, 6584, 6738, 6891, 7045, 7198, 7352, 7506, 7659, 7813, 7967, 8120, 8274, 8427, 8581, 8735, 8888, 9042, 9196, 9349, 9503, 9656, 9810, 9964, 10117, 10271, 10425, 10578, 10732, 10885, 11039, 11193, 11346, 11500, 11654, 11807, 11961, 12114]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后一击攻击力 : {value4}%
    # REMOVE: data4 = [0, 2725, 3002, 3278, 3555, 3831, 4107, 4384, 4660, 4937, 5213, 5490, 5766, 6043, 6319, 6596, 6872, 7149, 7425, 7701, 7978, 8254, 8531, 8807, 9084, 9360, 9637, 9913, 10190, 10466, 10743, 11019, 11296, 11572, 11848, 12125, 12401, 12678, 12954, 13231, 13507, 13784, 14060, 14337, 14613, 14890, 15166, 15442, 15719, 15995, 16272, 16548, 16825, 17101, 17378, 17654, 17931, 18207, 18484, 18760, 19036, 19313, 19589, 19866, 20142, 20419, 20695, 20972, 21248, 21525, 21801]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [终结之击]攻击力 : {value5}%
    # REMOVE: data5 = [0, 5107, 5625, 6143, 6661, 7179, 7697, 8216, 8734, 9252, 9770, 10288, 10806, 11324, 11842, 12360, 12878, 13397, 13915, 14433, 14951, 15469, 15987, 16505, 17023, 17541, 18059, 18577, 19096, 19614, 20132, 20650, 21168, 21686, 22204, 22722, 23240, 23758, 24277, 24795, 25313, 25831, 26349, 26867, 27385, 27903, 28421, 28939, 29458, 29976, 30494, 31012, 31530, 32048, 32566, 33084, 33602, 34120, 34638, 35157, 35675, 36193, 36711, 37229, 37747, 38265, 38783, 39301, 39819, 40338, 40856]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 瞬移距离上限 : {value6}px
    # REMOVE: data6 = [0, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313, 313]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value7}%
    # REMOVE: data7 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    def vp_1(self):
        """
        [疾风乱舞]\n
        移动功能强化\n
        施放时追踪最近的敌人\n
        - 突进距离上限 +50%\n
        - 瞬移范围 +100%
        """
        ...

    def vp_2(self):
        """
        [疾风乱舞]\n
        突进过程中， 进入无敌状态\n
        抓取成功时， 为600px范围内的所有敌人赋予与暗星的攻击相同的瞬移分身\n
        无法通过跳跃键瞬移
        """
        ...

# 死亡风暴
# thief/rogue/c77a417c43de80c4ce32c1ed405d174a
# ddc49e9ad1ff72a00b53c6cff5b1e920/c77a417c43de80c4ce32c1ed405d174a
class Skill37(PassiveSkill):
    """
    施放[剑刃风暴]时， 由风暴中心向外呈环形投掷匕首。
    """
    name = "死亡风暴"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 3
    uuid = "c77a417c43de80c4ce32c1ed405d174a"
    hasVP = True
    hasUP = False
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 匕首攻击力 : {value0}%
    # REMOVE: data0 = [0, 686, 795, 905, 1014, 1123, 1233, 1342, 1452, 1561, 1670, 1780, 1889, 1998, 2108, 2217, 2326, 2436, 2545, 2655, 2764, 2873, 2983, 3092, 3201, 3311, 3420, 3529, 3639, 3748, 3858, 3967, 4076, 4186, 4295, 4404, 4514, 4623, 4732, 4842, 4951, 5060, 5170, 5279, 5389, 5498, 5607, 5717, 5826, 5935, 6045, 6154, 6263, 6373, 6482, 6592, 6701, 6810, 6920, 7029, 7138, 7248, 7357, 7466, 7576, 7685, 7795, 7904, 8013, 8123, 8232]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 投掷匕首数量 : {value1}个
    # REMOVE: data1 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [死亡风暴]\n
        向600px范围内最强敌人投掷匕首\n
        匕首发射数 -33%\n
        - 总攻击力相同\n
        [剑刃风暴]\n
        每次攻击获得的连击点数 +100%\n
        施放[终结之击]时， 剩余旋转攻击力合算至[终结之击]攻击力\n
        - 学习[陨落风暴]后， 合算[陨落螺旋刺]的旋转攻击力
        """
        ...

    def vp_2(self):
        """
        [死亡风暴]\n
        不再投掷匕首， 而是在风暴内部生成刀刃飓风\n
        - 刀刃飓风多段攻击次数 : 10次\n
        - 总攻击力相同\n
        [剑刃风暴]\n
        - 攻击范围及移动距离 +30%\n
        聚集敌人功能强化\n
        - 吸附力 +200%\n
        - 可以吸附霸体状态的敌人
        """
        ...

# 绝境瞬狱袭
# thief/rogue/128b9ddef2262f40723deae4407bdb42
# ddc49e9ad1ff72a00b53c6cff5b1e920/128b9ddef2262f40723deae4407bdb42
class Skill38(ActiveSkill):
    """
    前冲突击使敌人浮空， 然后发动连续攻击。\n
    前冲和连续攻击过程中， 自身进入无敌状态， 前冲攻击没有命中敌人时， 不会发动连续攻击。\n
    可以在地上和空中发动， 第3击后可消耗连击点数发动[终结之击]。\n
    在决斗场中， 无法在空中发动。
    """
    name = "绝境瞬狱袭"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [311, 2612]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 前冲突击攻击力 : {value0}%
    # REMOVE: data0 = [0, 4230, 4659, 5088, 5517, 5946, 6375, 6804, 7233, 7663, 8092, 8521, 8950, 9379, 9808, 10237, 10666, 11095, 11524, 11954, 12383, 12812, 13241, 13670, 14099, 14528, 14957, 15386, 15815, 16245, 16674, 17103, 17532, 17961, 18390, 18819, 19248, 19677, 20106, 20536, 20965, 21394, 21823, 22252, 22681, 23110, 23539, 23968, 24398, 24827, 25256, 25685, 26114, 26543, 26972, 27401, 27830, 28259, 28689, 29118, 29547, 29976, 30405, 30834, 31263, 31692, 32121, 32550, 32980, 33409, 33838]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第1击攻击力 : {value1}%
    # REMOVE: data1 = [0, 6339, 6982, 7625, 8269, 8912, 9555, 10198, 10841, 11484, 12127, 12770, 13413, 14057, 14700, 15343, 15986, 16629, 17272, 17915, 18558, 19201, 19845, 20488, 21131, 21774, 22417, 23060, 23703, 24346, 24990, 25633, 26276, 26919, 27562, 28205, 28848, 29491, 30134, 30778, 31421, 32064, 32707, 33350, 33993, 34636, 35279, 35922, 36566, 37209, 37852, 38495, 39138, 39781, 40424, 41067, 41710, 42354, 42997, 43640, 44283, 44926, 45569, 46212, 46855, 47498, 48142, 48785, 49428, 50071, 50714]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 第2击攻击力 : {value2}%
    # REMOVE: data2 = [0, 8456, 9314, 10172, 11029, 11887, 12745, 13603, 14461, 15319, 16176, 17034, 17892, 18750, 19608, 20466, 21324, 22181, 23039, 23897, 24755, 25613, 26471, 27328, 28186, 29044, 29902, 30760, 31618, 32475, 33333, 34191, 35049, 35907, 36765, 37623, 38480, 39338, 40196, 41054, 41912, 42770, 43627, 44485, 45343, 46201, 47059, 47917, 48775, 49632, 50490, 51348, 52206, 53064, 53922, 54779, 55637, 56495, 57353, 58211, 59069, 59926, 60784, 61642, 62500, 63358, 64216, 65074, 65931, 66789, 67647]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 第3击攻击力 : {value3}%
    # REMOVE: data3 = [0, 10569, 11641, 12713, 13786, 14858, 15930, 17002, 18074, 19147, 20219, 21291, 22363, 23436, 24508, 25580, 26652, 27724, 28797, 29869, 30941, 32013, 33085, 34158, 35230, 36302, 37374, 38447, 39519, 40591, 41663, 42735, 43808, 44880, 45952, 47024, 48096, 49169, 50241, 51313, 52385, 53458, 54530, 55602, 56674, 57746, 58819, 59891, 60963, 62035, 63107, 64180, 65252, 66324, 67396, 68469, 69541, 70613, 71685, 72757, 73830, 74902, 75974, 77046, 78118, 79191, 80263, 81335, 82407, 83480, 84552]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [终结之击]攻击力 : {value4}%
    # REMOVE: data4 = [0, 5917, 6517, 7117, 7717, 8318, 8918, 9518, 10118, 10719, 11319, 11919, 12519, 13119, 13720, 14320, 14920, 15520, 16121, 16721, 17321, 17921, 18522, 19122, 19722, 20322, 20923, 21523, 22123, 22723, 23324, 23924, 24524, 25124, 25724, 26325, 26925, 27525, 28125, 28726, 29326, 29926, 30526, 31127, 31727, 32327, 32927, 33528, 34128, 34728, 35328, 35929, 36529, 37129, 37729, 38329, 38930, 39530, 40130, 40730, 41331, 41931, 42531, 43131, 43732, 44332, 44932, 45532, 46133, 46733, 47333]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [绝境瞬狱袭]\n
        移动功能强化\n
        - 前冲攻击范围 +60%\n
        - 前冲攻击时可以Y轴移动\n
        施放速度 +20%
        """
        ...

    def vp_2(self):
        """
        [绝境瞬狱袭]\n
        变更为可填充2次的技能\n
        - 首次施放后10秒内可以施放第二次\n
        - 删除第2击、 第3击攻击\n
        - 前冲、 第1击攻击后发动[终结之击]\n
        - 发动[终结之击]时命中率增加20%， 效果持续10秒\n
        - 包括[终结之击]在内的所有攻击可以获得最大连击点数\n
        - 总攻击力相同
        """
        ...

# 月弧
# thief/rogue/de3fea2d65c597f4d55c70a02b97fc79
# ddc49e9ad1ff72a00b53c6cff5b1e920/de3fea2d65c597f4d55c70a02b97fc79
class Skill39(PassiveSkill):
    """
    获得连击点数时， 增加命中率、 回避率、 物理暴击率和暴击伤害， 效果持续一定时间。
    """
    name = "月弧"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "de3fea2d65c597f4d55c70a02b97fc79"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 暴击伤害增加率 : {value1}%
    # REMOVE: data1 = [0, 11.5, 13.5, 15.5, 17.5, 19.5, 21.5, 23.5, 25.5, 27.5, 29.5, 31.5, 33.5, 35.5, 37.5, 39.5, 41.5, 43.5, 45.5, 47.5, 49.5, 51.5, 53.5, 55.5, 57.5, 59.5, 61.5, 63.5, 65.5, 67.5, 69.5, 71.5, 73.5, 75.5, 77.5, 79.5, 81.5, 83.5, 85.5, 87.5, 89.5, 91.5, 93.5, 95.5, 97.5, 99.5, 101.5, 103.5, 105.5, 107.5, 109.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 物理暴击率增加 : {value2}%
    # REMOVE: data2 = [0, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 回避率增加 : {value3}%
    # REMOVE: data3 = [0, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 命中率增加 : {value4}%
    # REMOVE: data4 = [0, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 月轮舞
# thief/rogue/c61f5a010370101402b05b21916c2071
# ddc49e9ad1ff72a00b53c6cff5b1e920/c61f5a010370101402b05b21916c2071
class Skill40(ActiveSkill):
    """
    施放[月轮舞]后， 会进入月舞模式并持续一定时间。 在月舞模式下， 增加攻击范围， 且基本攻击、 前冲攻击和跳跃攻击变成多段攻击； 获得连击点数时， 增加攻击速度和移动速度。\n
    在月舞模式下， 基本攻击、 跳跃攻击和前冲攻击不受[基础精通]的影响。 增加攻击速度和移动速度的增益效果可以重叠一定次数。\n
    施放技能动作中， 进入无敌状态； 可以在空中施放。
    """
    name = "月轮舞"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 7
    cd = 145
    mp = [850, 7000]
    uuid = "c61f5a010370101402b05b21916c2071"
    hasVP = False
    hasUP = False

    # 月舞模式持续时间 : {value0}秒
    # REMOVE: data0 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 普通/跳跃/前冲攻击次数增加 : {value1}次
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 效果重叠次数上限 : {value2}次
    # REMOVE: data2 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每次重叠攻击速度增加 : {value3}%
    # REMOVE: data3 = [0, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 每次重叠移动速度增加 : {value4}%
    # REMOVE: data4 = [0, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 月舞终结
# thief/rogue/dec8961c485edb02036ba00c789010f0
# ddc49e9ad1ff72a00b53c6cff5b1e920/dec8961c485edb02036ba00c789010f0
class Skill41(ActiveSkill):
    """
    可以在[月轮舞]增益状态下施放， 施放时发动强力连续斩击。\n
    共发动4次斩击， 1~3次斩击命中时， 分身进行突进攻击后发动终结斩击。\n
    被1~3段斩击命中的敌人会被强制控制并吸附过来， 并且可以在空中发动。\n
    学习后， 技能等级补正为与[月轮舞]相同。
    """
    name = "月舞终结"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cd = 145
    mp = [850, 7000]
    uuid = "dec8961c485edb02036ba00c789010f0"
    hasVP = False
    hasUP = False

    # 第1次斩击攻击力 : {value0}%
    # REMOVE: data0 = [0, 13774, 16968, 20162, 23356, 26550, 29744, 32938, 36132, 39325, 42519, 45713, 48907, 52101, 55295, 58489, 61683, 64877, 68071, 71265, 74459, 77653, 80847, 84041, 87235, 90429, 93623, 96817, 100010, 103204, 106398, 109592, 112786, 115980, 119174, 122368, 125562, 128756, 131950, 135144, 138338, 141532, 144726, 147920, 151114, 154308, 157502, 160696, 163889, 167083, 170277]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第2次斩击攻击力 : {value1}%
    # REMOVE: data1 = [0, 15742, 19392, 23042, 26692, 30343, 33993, 37643, 41293, 44943, 48594, 52244, 55894, 59544, 63195, 66845, 70495, 74145, 77795, 81446, 85096, 88746, 92396, 96047, 99697, 103347, 106997, 110647, 114298, 117948, 121598, 125248, 128899, 132549, 136199, 139849, 143500, 147150, 150800, 154450, 158100, 161751, 165401, 169051, 172701, 176352, 180002, 183652, 187302, 190952, 194603]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 第3次斩击攻击力 : {value2}%
    # REMOVE: data2 = [0, 17709, 21816, 25922, 30029, 34135, 38242, 42348, 46455, 50561, 54668, 58774, 62881, 66987, 71094, 75200, 79307, 83413, 87520, 91626, 95733, 99839, 103946, 108052, 112159, 116265, 120372, 124478, 128585, 132691, 136798, 140904, 145011, 149117, 153224, 157330, 161437, 165543, 169650, 173756, 177863, 181969, 186076, 190182, 194289, 198395, 202502, 206608, 210715, 214822, 218928]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 分身突进攻击力 : {value3}%
    # REMOVE: data3 = [0, 19677, 24240, 28803, 33365, 37928, 42491, 47054, 51616, 56179, 60742, 65305, 69868, 74430, 78993, 83556, 88119, 92682, 97244, 101807, 106370, 110933, 115495, 120058, 124621, 129184, 133747, 138309, 142872, 147435, 151998, 156560, 161123, 165686, 170249, 174812, 179374, 183937, 188500, 193063, 197626, 202188, 206751, 211314, 215877, 220439, 225002, 229565, 234128, 238691, 243253]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后斩击攻击力 : {value4}%
    # REMOVE: data4 = [0, 31483, 38784, 46084, 53385, 60685, 67985, 75286, 82586, 89887, 97187, 104488, 111788, 119089, 126389, 133690, 140990, 148290, 155591, 162891, 170192, 177492, 184793, 192093, 199394, 206694, 213995, 221295, 228595, 235896, 243196, 250497, 257797, 265098, 272398, 279699, 286999, 294299, 301600, 308900, 316201, 323501, 330802, 338102, 345403, 352703, 360004, 367304, 374604, 381905, 389205]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 旋刃冲击
# thief/rogue/6a1d1f08a6572be420bb3a256c44c015
# ddc49e9ad1ff72a00b53c6cff5b1e920/6a1d1f08a6572be420bb3a256c44c015
class Skill42(ActiveSkill):
    """
    向前方投掷2个旋转刀刃。\n
    旋转刀刃在一定时间内聚拢敌人， 造成多段伤害。\n
    投掷出的旋转刀刃在触碰到敌人时停止移动， 若没有触碰到敌人， 则会移动至最大距离。\n
    旋转刀刃持续期间， 可消耗连击点数发动[终结之击]。 发动[终结之击]时， 快速移动到第一次投掷的旋转刀刃的位置， 对敌人造成多段伤害。 多次施放技能后发动[终结之击]时， 移动到存在的旋转刀刃中最先投掷的刀锋位置。\n
    在持续时间内， 即使发动[终结之击]， 旋转刀刃也不会消失。
    """
    name = "旋刃冲击"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 2
    cd = 30
    mp = [400, 1120]
    uuid = "6a1d1f08a6572be420bb3a256c44c015"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 旋转刀刃攻击力 : {value0}%
    # REMOVE: data0 = [0, 1181, 1301, 1421, 1540, 1660, 1780, 1900, 2020, 2140, 2259, 2379, 2499, 2619, 2739, 2858, 2978, 3098, 3218, 3338, 3458, 3577, 3697, 3817, 3937, 4057, 4176, 4296, 4416, 4536, 4656, 4776, 4895, 5015, 5135, 5255, 5375, 5494, 5614, 5734, 5854, 5974, 6094, 6213, 6333, 6453, 6573, 6693, 6812, 6932, 7052]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋转刀刃持续时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 旋转刀刃多段攻击间隔 : {value2}秒
    # REMOVE: data2 = [0, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25, 0.25]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 旋转刀刃投掷距离上限 : {value3}px
    # REMOVE: data3 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [终结之击]攻击力 : {value4}% X {value5}
    # REMOVE: data4 = [0, 1322, 1456, 1590, 1724, 1858, 1992, 2126, 2260, 2394, 2529, 2663, 2797, 2931, 3065, 3199, 3333, 3467, 3601, 3735, 3869, 4004, 4138, 4272, 4406, 4540, 4674, 4808, 4942, 5076, 5210, 5344, 5479, 5613, 5747, 5881, 6015, 6149, 6283, 6417, 6551, 6685, 6819, 6953, 7088, 7222, 7356, 7490, 7624, 7758, 7892]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [旋刃冲击]\n
        [双刃穿刺]命中时自动施放[旋刃冲击]， 并适用以下效果\n
        - 可施放[旋刃冲击]时发动\n
        - [双刃穿刺]的第2、 3次攻击生成旋转刀刃\n
        - 旋转刀刃不吸附敌人\n
        [终结之击]攻击强化\n
        - 施放速度 +80%\n
        - 多段攻击次数 -80%\n
        - 总攻击力相同\n
        [双刃穿刺]\n
        攻击范围 +25%
        """
        ...

    def vp_2(self):
        """
        [旋刃冲击]\n
        范围 +70%\n
        旋转刀刃强化\n
        - 每次攻击获得的连击点数 +100%\n
        - 可获得的连击点数上限 +1100%\n
        - 持续时间 +100%\n
        - 总攻击力相同\n
        [终结之击]攻击时， 获得最大连击点数
        """
        ...

# 陨落螺旋刺
# thief/rogue/38612d8f2561edc2eb68d5057a837bfa
# ddc49e9ad1ff72a00b53c6cff5b1e920/38612d8f2561edc2eb68d5057a837bfa
class Skill43(ActiveSkill):
    """
    跳跃后， 以极快的速度旋转并冲向地面， 落地时生成冲击波。\n
    在地面发动时， 可以使用方向键调整落地位置； 在空中发动时， 立即向地面发动旋转攻击。\n
    可消耗连击点数发动[终结之击]。
    """
    name = "陨落螺旋刺"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 3
    cd = 50
    mp = [800, 1680]
    uuid = "38612d8f2561edc2eb68d5057a837bfa"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 旋转攻击力 : {value0}%
    # REMOVE: data0 = [0, 5244, 5776, 6307, 6839, 7371, 7903, 8435, 8967, 9499, 10031, 10563, 11095, 11627, 12159, 12691, 13223, 13755, 14287, 14819, 15351, 15883, 16415, 16947, 17479, 18011, 18543, 19074, 19606, 20138, 20670, 21202, 21734, 22266, 22798, 23330, 23862, 24394, 24926, 25458, 25990, 26522, 27054, 27586, 28118, 28650, 29182, 29714, 30246, 30778, 31310]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冲击波攻击力 : {value1}%
    # REMOVE: data1 = [0, 36703, 40426, 44150, 47873, 51597, 55320, 59044, 62767, 66491, 70214, 73938, 77661, 81385, 85108, 88832, 92555, 96279, 100002, 103726, 107449, 111173, 114896, 118620, 122343, 126067, 129790, 133514, 137237, 140961, 144684, 148408, 152131, 155855, 159578, 163302, 167025, 170749, 174472, 178196, 181919, 185643, 189366, 193090, 196813, 200537, 204260, 207984, 211707, 215431, 219154]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 10489, 11553, 12618, 13682, 14746, 15810, 16874, 17938, 19002, 20066, 21131, 22195, 23259, 24323, 25387, 26451, 27515, 28579, 29644, 30708, 31772, 32836, 33900, 34964, 36028, 37092, 38157, 39221, 40285, 41349, 42413, 43477, 44541, 45605, 46670, 47734, 48798, 49862, 50926, 51990, 53054, 54119, 55183, 56247, 57311, 58375, 59439, 60503, 61567, 62632]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [陨落螺旋刺]\n
        处于可以施放状态下施放[剑刃风暴]时， 自动发动[陨落螺旋刺]， 并适用以下效果\n
        - 删除冲击波攻击\n
        - 旋转攻击多段攻击次数上限 +7\n
        - [剑刃风暴]旋转攻击时， 附加[陨落螺旋刺]旋转攻击力\n
        - [剑刃风暴]终结之击攻击时， 附加[陨落螺旋刺]终结之击攻击力\n
        - 以施放[剑刃风暴]终结之击时消耗的连击点数为标准， 适用[陨落螺旋刺]终结之击攻击力\n
        - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [陨落螺旋刺]\n
        攻击范围 +40%\n
        降落速度 +300%\n
        - 增加落地后可发动[终结之击]的时间\n
        - 地面施放时跳跃高度 +50%\n
        删除旋转攻击\n
        - 每次攻击获得的连击点数 +300%\n
        - 总攻击力相同
        """
        ...

# 极限追击
# thief/rogue/0c3a468aee1f7ce06bf91eb3319518c1
# ddc49e9ad1ff72a00b53c6cff5b1e920/0c3a468aee1f7ce06bf91eb3319518c1
class Skill44(PassiveSkill):
    """
    将身体能力强化到极致， 增加物理攻击力和连击点数上限， 并可以强制中断技能后施放。\n
    强制中断技能的功能可以在已学的技能栏中， 通过鼠标右击进行开启/关闭切换。
    """
    name = "极限追击"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "0c3a468aee1f7ce06bf91eb3319518c1"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 连击点数上限增加量 : {value1}个
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 乱空杀
# thief/rogue/5cac3411ccef1af333953e0ded5e942d
# ddc49e9ad1ff72a00b53c6cff5b1e920/5cac3411ccef1af333953e0ded5e942d
class Skill45(ActiveSkill):
    """
    以极快的速度掠过敌人进行攻击。\n
    下劈后， 可以通1过消耗连击点数使用[终结之击]。
    """
    name = "乱空杀"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 3
    cube = 3
    cd = 30
    mp = [580, 4500]
    uuid = "5cac3411ccef1af333953e0ded5e942d"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 连续斩击攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 4187, 4854, 5522, 6189, 6857, 7524, 8192, 8859, 9527, 10194, 10861, 11529, 12196, 12864, 13531, 14199, 14866, 15534, 16201, 16869, 17536, 18204, 18871, 19539, 20206, 20873, 21541, 22208, 22876, 23543, 24211, 24878, 25546, 26213, 26881, 27548, 28216, 28883, 29551, 30218, 30885, 31553, 32220, 32888, 33555, 34223, 34890, 35558, 36225, 36893]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 向下斩击攻击力 : {value2}%
    # REMOVE: data2 = [0, 16746, 19415, 22085, 24754, 27424, 30094, 32763, 35433, 38102, 40772, 43442, 46111, 48781, 51450, 54120, 56790, 59459, 62129, 64798, 67468, 70138, 72807, 75477, 78146, 80816, 83486, 86155, 88825, 91494, 94164, 96834, 99503, 102173, 104842, 107512, 110182, 112851, 115521, 118190, 120860, 123530, 126199, 128869, 131538, 134208, 136878, 139547, 142217, 144886, 147556]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [终结之击]攻击力 : {value3}%
    # REMOVE: data3 = [0, 8370, 9705, 11039, 12374, 13708, 15042, 16377, 17711, 19046, 20380, 21714, 23049, 24383, 25717, 27052, 28386, 29721, 31055, 32389, 33724, 35058, 36393, 37727, 39061, 40396, 41730, 43065, 44399, 45733, 47068, 48402, 49737, 51071, 52405, 53740, 55074, 56409, 57743, 59077, 60412, 61746, 63081, 64415, 65749, 67084, 68418, 69753, 71087, 72421, 73756]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [乱空杀]\n
        施放以下技能过程中发动时， 由分身施放\n
        - 适用技能 : [疾驰]、 [旋刃]、 [疾风乱舞]、 [月影突袭]\n
        - 分身施放时， 无法获得[乱空杀]的连击点数， 按最大连击点数适用[终结之击]攻击力\n
        - 基本冷却时间变更为24.9秒\n
        - 总攻击力 -17%
        """
        ...

    def vp_2(self):
        """
        [乱空杀]\n
        攻击范围 +45%\n
        快速地攻击前后方\n
        - 连续斩击多段攻击次数 -50%\n
        - 每次攻击获得的连击点数 +67%\n
        - 总攻击力相同
        """
        ...

# 月影突袭
# thief/rogue/e1daab884dd07fc9e70d08b83d1790eb
# ddc49e9ad1ff72a00b53c6cff5b1e920/e1daab884dd07fc9e70d08b83d1790eb
class Skill46(ActiveSkill):
    """
    向前方突进， 用肉眼看不见的速度多次斩击。\n
    斩击可以将敌人聚集到中央。 多段斩击后， 可消耗连击点数发动[终结之击]。
    """
    name = "月影突袭"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 5
    cd = 50
    mp = [800, 6000]
    uuid = "e1daab884dd07fc9e70d08b83d1790eb"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段斩击攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 6453, 7108, 7762, 8417, 9072, 9726, 10381, 11036, 11690, 12345, 13000, 13654, 14309, 14964, 15618, 16273, 16928, 17582, 18237, 18892, 19546, 20201, 20856, 21510, 22165, 22820, 23474, 24129, 24784, 25438, 26093, 26748, 27402, 28057, 28712, 29366, 30021, 30675, 31330, 31985, 32639, 33294, 33949, 34603, 35258, 35913, 36567, 37222, 37877, 38531]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 12909, 14219, 15529, 16838, 18148, 19457, 20767, 22077, 23386, 24696, 26006, 27315, 28625, 29934, 31244, 32554, 33863, 35173, 36483, 37792, 39102, 40412, 41721, 43031, 44340, 45650, 46960, 48269, 49579, 50889, 52198, 53508, 54818, 56127, 57437, 58746, 60056, 61366, 62675, 63985, 65295, 66604, 67914, 69224, 70533, 71843, 73152, 74462, 75772, 77081]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [月影突袭]\n
        可以在空中施放\n
        多段攻击强化\n
        - 施放速度 +25%\n
        - 使敌人进入混乱异常状态， 效果持续3秒\n
        [终结之击]攻击强化\n
        - 施放速度 +25%\n
        - 多段攻击后可以立即发动
        """
        ...

    def vp_2(self):
        """
        [月影突袭]\n
        攻击范围 +35%\n
        多段攻击可以吸附霸体和无法抓取类型的敌人\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 25秒\n
        - 单次攻击力 -50%
        """
        ...

# 天渊星狱
# thief/rogue/002cbdd9bfd0f0b970451ae8d48d029e
# ddc49e9ad1ff72a00b53c6cff5b1e920/002cbdd9bfd0f0b970451ae8d48d029e
class Skill47(ActiveSkill):
    """
    化为一束星光快速造成多段攻击， 随后从空中坠下引起爆炸。\n
       吸附多段攻击命中的敌人， 可以在空中施放。\n
    对无法抓取的敌人不适用控制效果。\n
    从空中坠下后， 可消耗连击点数发动[终结之击]。
    """
    name = "天渊星狱"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 8000]
    uuid = "002cbdd9bfd0f0b970451ae8d48d029e"
    hasVP = False
    hasUP = False

    # 星光多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 538, 663, 788, 912, 1037, 1162, 1287, 1412, 1536, 1661, 1786, 1911, 2036, 2160, 2285, 2410, 2535, 2659, 2784, 2909, 3034, 3159, 3283, 3408, 3533, 3658, 3782, 3907, 4032, 4157, 4282, 4406, 4531, 4656, 4781, 4905, 5030, 5155, 5280, 5405, 5529, 5654, 5779, 5904, 6029, 6153, 6278, 6403, 6528, 6652]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 124643, 153545, 182448, 211351, 240253, 269156, 298059, 326962, 355864, 384767, 413670, 442572, 471475, 500378, 529280, 558183, 587086, 615988, 644891, 673794, 702696, 731599, 760502, 789404, 818307, 847210, 876112, 905015, 933918, 962820, 991723, 1020626, 1049528, 1078431, 1107334, 1136236, 1165139, 1194042, 1222944, 1251847, 1280750, 1309652, 1338555, 1367458, 1396361, 1425263, 1454166, 1483069, 1511971, 1540874]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 25892, 31896, 37900, 43903, 49907, 55911, 61915, 67919, 73923, 79927, 85931, 91934, 97938, 103942, 109946, 115950, 121954, 127958, 133962, 139966, 145969, 151973, 157977, 163981, 169985, 175989, 181993, 187997, 194001, 200004, 206008, 212012, 218016, 224020, 230024, 236028, 242032, 248036, 254039, 260043, 266047, 272051, 278055, 284059, 290063, 296067, 302070, 308074, 314078, 320082]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 幻灭瞬杀
# thief/rogue/9376d04c476cd41d60ed1974ca69ab95
# ddc49e9ad1ff72a00b53c6cff5b1e920/9376d04c476cd41d60ed1974ca69ab95
class Skill48(ActiveSkill):
    """
    瞬间释放超越身体极限的力量， 向前方突进。 突进时， 隐夜·暗星如残影攻击般快速攻击敌人。\n
    前方范围内存在敌人时才能施放该技能， 可以在地上和空中发动。\n
    突进后， 可以消耗连击点数发动[终结之击]。 
    """
    name = "幻灭瞬杀"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [960, 7200]
    uuid = "9376d04c476cd41d60ed1974ca69ab95"
    hasVP = False
    hasUP = False

    # 突进残影攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 20893, 23013, 25132, 27252, 29372, 31491, 33611, 35730, 37850, 39970, 42089, 44209, 46328, 48448, 50568, 52687, 54807, 56926, 59046, 61165, 63285, 65405, 67524, 69644, 71763, 73883, 76003, 78122, 80242, 82361, 84481, 86601, 88720, 90840, 92959, 95079, 97199, 99318, 101438, 103557, 105677, 107797, 109916, 112036, 114155, 116275, 118395, 120514, 122634, 124753]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 20898, 23018, 25138, 27258, 29379, 31499, 33619, 35739, 37859, 39979, 42099, 44219, 46339, 48460, 50580, 52700, 54820, 56940, 59060, 61180, 63300, 65420, 67540, 69661, 71781, 73901, 76021, 78141, 80261, 82381, 84501, 86621, 88742, 90862, 92982, 95102, 97222, 99342, 101462, 103582, 105702, 107822, 109943, 112063, 114183, 116303, 118423, 120543, 122663, 124783]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 绝命时刻
# thief/rogue/5536486eaf9b13c9a8283447cb5e77ab
# ddc49e9ad1ff72a00b53c6cff5b1e920/5536486eaf9b13c9a8283447cb5e77ab
class Skill49(PassiveSkill):
    """
    激发超越身体极限的力量， 获得强大的攻击力和敌人无法感知的行动速度。\n
    学习后， 增加基本攻击力和转职技能攻击力， [旋刃]和[剑刃风暴]技能附加特殊效果。\n
    [旋刃]\n
    以极快的速度发动第1击、第2击和第3击。\n
    [剑刃风暴]\n
    增加移动速度和吸附力。
    """
    name = "绝命时刻"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "5536486eaf9b13c9a8283447cb5e77ab"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [剑刃风暴]
    # 移动速度增加率 : {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 吸附力增加率 : {value2}%
    # REMOVE: data2 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 多段攻击间隔减少率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 影·万古星辰
# thief/rogue/ef9d26746effee9199b54541f01b8752
# ddc49e9ad1ff72a00b53c6cff5b1e920/ef9d26746effee9199b54541f01b8752
class Skill50(ActiveSkill):
    """
    集中精神后， 暂时突破身体的极限， 将力量强化到极致。 然后， 凝聚星辰能量， 如光速般移动。\n
    移动时， 隐夜·暗星以极快的速度对范围内最强的敌人进行多次旋转斩击。\n
    可以在地上和空中施放， 施放时， 连击点数累积到上限。\n
    可以在旋转斩击后， 消耗连击点数发动[终结之击]。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "影·万古星辰"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 9667]
    uuid = "ef9d26746effee9199b54541f01b8752"
    hasVP = False
    hasUP = False

    # 旋转斩击攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 26098, 32150, 38202, 44253, 50305, 56357, 62409, 68460, 74512, 80564, 86616, 92667, 98719, 104771, 110823, 116874, 122926, 128978, 135030, 141082, 147133, 153185, 159237, 165289, 171340, 177392, 183444, 189496, 195547, 201599, 207651, 213703, 219754, 225806, 231858, 237910, 243961, 250013, 256065, 262117, 268168, 274220, 280272, 286324, 292375, 298427, 304479, 310531, 316582, 322634]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [终结之击]攻击力 : {value2}%
    # REMOVE: data2 = [0, 67872, 83610, 99348, 115087, 130825, 146563, 162302, 178040, 193778, 209517, 225255, 240993, 256732, 272470, 288208, 303947, 319685, 335423, 351162, 366900, 382638, 398377, 414115, 429853, 445592, 461330, 477068, 492807, 508545, 524283, 540022, 555760, 571498, 587237, 602975, 618713, 634452, 650190, 665928, 681667, 697405, 713143, 728882, 744620, 760358, 776097, 791835, 807573, 823312, 839050]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'rogue'
        self.nameCN = '隐夜·刺客'
        self.role = 'thief'
        self.角色 = '暗夜使者'
        self.职业 = '刺客'
        self.jobId = 'ddc49e9ad1ff72a00b53c6cff5b1e920'
        self.jobGrowId = '37495b941da3b1661bc900e68ef3b2c6'

        self.武器选项 = [] # TODO
        self.输出类型选项 = [] # TODO
        self.输出类型 = '' # TODO
        self.防具精通属性 = [''] # TODO
        self.防具类型 = ''
        self.buff = ... # TODO

        super().__init__(equVersion, __name__)
