#a5ccbaf5538981c6ef99b236c0a60b73
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "mage_male/blood_mage/cn/skillDetail"

# 魔法旋风
# mage_male/blood_mage/3c5604bdbb0240b8f130f59ab40509c3
# a5ccbaf5538981c6ef99b236c0a60b73/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
    向敌人发出无属性旋风并使其浮空。\n
    转职为次元行者后， 技能类型变为独立攻击力。\n
    - [转职为猩红法师时附加效果] -\n
    外形发生变化， 可以吸收猩红气息。\n
    - [转职为逐风者时附加效果] -\n
    增加攻击力， 可以按<X>键进行追加操作。
    """
    name = "魔法旋风"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 4 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 118, 137, 156, 174, 193, 212, 231, 250, 268, 287, 306, 325, 344, 363, 381, 400, 419, 438, 457, 475]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 131.4, 132.8, 134, 135.4, 136.5, 138, 139.1, 140.5, 141.7, 143.1, 147.7, 152.2, 157.1, 162, 166.5, 171.4, 176.2, 180.8, 185.7, 190.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [转职为猩红法师后] -
    # 猩红气息吸收率 : {value2}%
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # - [转职为逐风者后] -
    # 攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 魔法冰球
# mage_male/blood_mage/5dc7008b12a459325b548b0715c6b73c
# a5ccbaf5538981c6ef99b236c0a60b73/5dc7008b12a459325b548b0715c6b73c
class Skill1(ActiveSkill):
    """
    向前方发射魔法冰球。\n
    在决斗场内， 冰球大小随技能等级增加而增大。
    """
    name = "魔法冰球"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 2
    mp = [10, 84]
    uuid = "5dc7008b12a459325b548b0715c6b73c"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 695, 766, 836, 907, 977, 1048, 1118, 1189, 1259, 1330, 1400, 1471, 1541, 1612, 1682, 1753, 1823, 1894, 1964, 2035, 2105, 2176, 2246, 2317, 2387, 2458, 2528, 2599, 2669, 2740, 2810, 2881, 2951, 3022, 3092, 3163, 3233, 3304, 3374, 3445, 3515, 3586, 3656, 3727, 3797, 3868, 3938, 4009, 4079, 4150, 4220, 4291, 4361, 4432, 4502, 4573, 4643, 4714, 4784, 4855, 4925, 4996, 5066, 5137, 5207, 5278, 5348, 5419, 5489, 5560]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 冰球大小 : {value1}%
    # REMOVE: data1 = [0, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 不死之身
# mage_male/blood_mage/bb34e8854a93fd250347a1c64119f7ab
# a5ccbaf5538981c6ef99b236c0a60b73/bb34e8854a93fd250347a1c64119f7ab
class Skill2(PassiveSkill):
    """
    角色死亡后带着少量生命值原地复活， 并且进入自动恢复生命值模式。\n
    自动恢复生命值模式下， 角色的生命值值可以在一定时间内自动恢复至100%， 但无法借用任何道具或其它途径恢复生命值， 且所受到的伤害还会加剧。\n
    若在恢复模式下死亡， 则无法再次通过该技能复活。
    """
    name = "不死之身"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 3
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = False
    hasUP = False

    # 恢复模式下所受伤害增加 : {value0}%
    # REMOVE: data0 = [0, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 死亡时立即恢复的生命值量 : {value1}%
    # REMOVE: data1 = [0, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 恢复模式持续时间(普通地下城) : {value2}秒
    # REMOVE: data2 = [0, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 恢复模式持续时间(亡者峡谷) : {value3}秒
    # REMOVE: data3 = [0, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 黑暗之眼
# mage_male/blood_mage/6e33d47e6622ce03b6defdd912140270
# a5ccbaf5538981c6ef99b236c0a60b73/6e33d47e6622ce03b6defdd912140270
class Skill3(PassiveSkill):
    """
    增加魔法师的魔法值最大值； 若魔法值低于一定比率时， 还可增加魔法值恢复速度。
    """
    name = "黑暗之眼"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 魔法值最大值增加 : {value0}%
    # REMOVE: data0 = [0, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 可触发恢复效果时的魔法值比率 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值恢复速度增加 : {value2}倍
    # REMOVE: data2 = [0, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 赤影步
# mage_male/blood_mage/ac21c02567f04a92b54dd85c091d1e5a
# a5ccbaf5538981c6ef99b236c0a60b73/ac21c02567f04a92b54dd85c091d1e5a
class Skill4(ActiveSkill):
    """
    快速移动到前方最远处敌人的身后。\n
    使用向前方向键时， 可移动到最大距离。\n
    在决斗场内， 无论前方有无敌人， 都会移动到最大距离。
    """
    name = "赤影步"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 2
    cd = 1.5
    mp = [51, 51]
    uuid = "ac21c02567f04a92b54dd85c091d1e5a"
    hasVP = False
    hasUP = False

    # 移动距离上限 : {value0}px
    # REMOVE: data0 = [0, 400]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 敌人无法发觉的时间 : {value1}秒
    # REMOVE: data1 = [0, 0.3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)


# 基础精通
# mage_male/blood_mage/5a56514f35cf0270ae8d6c65f8fefd78
# a5ccbaf5538981c6ef99b236c0a60b73/5a56514f35cf0270ae8d6c65f8fefd78
class Skill6(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [魔法旋风]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)


# 幽冥火
# mage_male/blood_mage/cfacda0647b9a0f595df2c2aad30c18d
# a5ccbaf5538981c6ef99b236c0a60b73/cfacda0647b9a0f595df2c2aad30c18d
class Skill11(ActiveSkill):
    """
    生成两团幽冥火， 可以增加自身的物理和魔法防御力， 且造成一定伤害， 效果持续一定时间。\n
    转职成次元行者时， 可以学习[虚妄之火]技能。\n
    学习[虚妄之火]后， 持续时间变更为无限， 且无法发动攻击。
    """
    name = "幽冥火"
    learnLv = 10
    masterLv = 10
    maxLv = 20
    position = 9 #TODO
    rangeLv = 3
    cd = 10
    mp = [30, 345]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 每个火球增加物理防御力 : {value1}
    # REMOVE: data1 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每个火球增加魔法防御力 : {value2}
    # REMOVE: data2 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每个火球的攻击力 : {value3}%
    # REMOVE: data3 = [0, 814, 944, 1074, 1203, 1333, 1463, 1593, 1722, 1852, 1982, 2112, 2241, 2371, 2501, 2631, 2761, 2890, 3020, 3150, 3280]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [虚妄之火效果] -
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法防御力增加 : {value5}
    # REMOVE: data5 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 血蝠之袭
# mage_male/blood_mage/d429147c372b549c3dadcabcba50787f
# a5ccbaf5538981c6ef99b236c0a60b73/d429147c372b549c3dadcabcba50787f
class Skill16(ActiveSkill):
    """
    召唤蝙蝠冲向敌人造成多段伤害并吸取猩红气息。
    """
    name = "血蝠之袭"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    mp = [24, 240]
    uuid = "d429147c372b549c3dadcabcba50787f"
    hasVP = False
    hasUP = True

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 587, 647, 706, 766, 825, 885, 944, 1004, 1063, 1123, 1183, 1242, 1302, 1361, 1421, 1480, 1540, 1599, 1659, 1718, 1778, 1838, 1897, 1957, 2016, 2076, 2135, 2195, 2254, 2314, 2374, 2433, 2493, 2552, 2612, 2671, 2731, 2790, 2850, 2909, 2969, 3029, 3088, 3148, 3207, 3267, 3326, 3386, 3445, 3505, 3565, 3624, 3684, 3743, 3803, 3862, 3922, 3981, 4041, 4100, 4160, 4220, 4279, 4339, 4398, 4458, 4517, 4577, 4636, 4696]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 15
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 猩红气息吸收量 : {value2}%
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 鲜血融合
# mage_male/blood_mage/0113c8b1306ca76d208f83f2d093dd62
# a5ccbaf5538981c6ef99b236c0a60b73/0113c8b1306ca76d208f83f2d093dd62
class Skill17(PassiveSkill):
    """
    从攻击的敌人身上吸取力量， 与黑暗之眼进行融合， 产生新的力量之源——猩红气息。 猩红法师的命中率因猩红探测能力而增加。\n
    当猩红气息蓄满时， 角色会进入一种兴奋状态， 增加物理武器攻击力、 减少猩红气息消耗系技能的冷却时间。\n
    猩红气息可以用吸收系技能吸收， 并在吸收状态下， 减少猩红气息消耗系技能的消耗量。\n
    猩红气息不足时， 可以消耗生命值施放猩红气息消耗系技能。
    """
    name = "鲜血融合"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "0113c8b1306ca76d208f83f2d093dd62"
    hasVP = False
    hasUP = False

    # [学习技能时效果]
    # 命中率增加 : {value0}%
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 吸收状态持续时间增加 : {value1}秒
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [猩红气息高涨状态]
    # 物理武器攻击力增加率 : {value2}%
    # REMOVE: data2 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 猩红气息消耗系技能冷却时间减少率 : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 持续时间 : {value4}秒
    # REMOVE: data4 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [猩红气息吸收状态下]消耗系技能附加效果
    # 猩红气息消耗量减少率 : {value5}%
    # REMOVE: data5 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [猩红气息不足时]
    # 消耗生命值比率 : 猩红气息消耗量的{value6}%
    # REMOVE: data6 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    associate = [{"data":data3,"type":"*cdReduce","skills":["血翼突击","鲜血长枪","猩红狩猎","狱血之牙","绯红之狱","隐行之噬","血翼绽放","死亡之握","血翼蔽空"]}]

# 鲜血之誓
# mage_male/blood_mage/8b08f9504167a9c0f3a1d29d71b7943e
# a5ccbaf5538981c6ef99b236c0a60b73/8b08f9504167a9c0f3a1d29d71b7943e
class Skill18(PassiveSkill):
    """
    将穿戴的武器和猩红气息融合到一起， 像身体的一部分一样操控自如。\n
    改变基本攻击、 冲刺攻击、 跳跃攻击、 [魔法旋风]的攻击效果； 攻击时敌人时， 可以吸收猩红气息。
    """
    name = "鲜血之誓"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 8 #TODO
    rangeLv = 2
    uuid = "8b08f9504167a9c0f3a1d29d71b7943e"
    hasVP = False
    hasUP = False

    # 第1击猩红气息吸收量 : {value0}%
    # REMOVE: data0 = [0, 1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第2击猩红气息吸收量 : {value1}%
    # REMOVE: data1 = [0, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 第3击猩红气息吸收量 : {value2}%
    # REMOVE: data2 = [0, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 第4击猩红气息吸收量 : {value3}%
    # REMOVE: data3 = [0, 4]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冲刺攻击猩红气息吸收量 : {value4}%
    # REMOVE: data4 = [0, 2]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 跳跃攻击猩红气息吸收量 : {value5}%
    # REMOVE: data5 = [0, 1]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 血翼突击
# mage_male/blood_mage/ab6fc3303df03b58911967dfca2b5d07
# a5ccbaf5538981c6ef99b236c0a60b73/ab6fc3303df03b58911967dfca2b5d07
class Skill19(ActiveSkill):
    """
    消耗猩红气息， 将双臂变形为翅膀形状的利刃， 冲向前方的敌人。\n
    该技能可以击退敌人。\n
    可以在空中施放该技能， 利用方向键可以指定降落地点。
    """
    name = "血翼突击"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    uuid = "ab6fc3303df03b58911967dfca2b5d07"
    hasVP = False
    hasUP = True

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 自身冲撞攻击力 : {value1}%
    # REMOVE: data1 = [0, 7307, 8048, 8790, 9531, 10272, 11013, 11755, 12496, 13237, 13979, 14720, 15461, 16202, 16944, 17685, 18426, 19168, 19909, 20650, 21392, 22133, 22874, 23615, 24357, 25098, 25839, 26581, 27322, 28063, 28804, 29546, 30287, 31028, 31770, 32511, 33252, 33993, 34735, 35476, 36217, 36959, 37700, 38441, 39182, 39924, 40665, 41406, 42148, 42889, 43630, 44371, 45113, 45854, 46595, 47337, 48078, 48819, 49561, 50302, 51043, 51784, 52526, 53267, 54008, 54750, 55491, 56232, 56973, 57715, 58456]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 血翼斩击攻击力 : {value2}%
    # REMOVE: data2 = [0, 7307, 8048, 8790, 9531, 10272, 11013, 11755, 12496, 13237, 13979, 14720, 15461, 16202, 16944, 17685, 18426, 19168, 19909, 20650, 21392, 22133, 22874, 23615, 24357, 25098, 25839, 26581, 27322, 28063, 28804, 29546, 30287, 31028, 31770, 32511, 33252, 33993, 34735, 35476, 36217, 36959, 37700, 38441, 39182, 39924, 40665, 41406, 42148, 42889, 43630, 44371, 45113, 45854, 46595, 47337, 48078, 48819, 49561, 50302, 51043, 51784, 52526, 53267, 54008, 54750, 55491, 56232, 56973, 57715, 58456]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 鲜血长枪
# mage_male/blood_mage/002cbdd9bfd0f0b970451ae8d48d029e
# a5ccbaf5538981c6ef99b236c0a60b73/002cbdd9bfd0f0b970451ae8d48d029e
class Skill20(ActiveSkill):
    """
    用猩红气息之枪刺穿敌人后举起。\n
    举起状态可以持续一定时间， 若再按下技能键， 则把敌人砸向地面。\n
    对无法抓取的敌人不适用抓取和控制效果。
    """
    name = "鲜血长枪"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 6
    uuid = "002cbdd9bfd0f0b970451ae8d48d029e"
    hasVP = False
    hasUP = True

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 刺击攻击力 : {value1}%
    # REMOVE: data1 = [0, 4915, 5414, 5912, 6411, 6909, 7408, 7907, 8405, 8904, 9403, 9901, 10400, 10898, 11397, 11896, 12394, 12893, 13392, 13890, 14389, 14887, 15386, 15885, 16383, 16882, 17381, 17879, 18378, 18876, 19375, 19874, 20372, 20871, 21370, 21868, 22367, 22865, 23364, 23863, 24361, 24860, 25359, 25857, 26356, 26854, 27353, 27852, 28350, 28849, 29348, 29846, 30345, 30843, 31342, 31841, 32339, 32838, 33337, 33835, 34334, 34832, 35331, 35830, 36328, 36827, 37326, 37824, 38323, 38821, 39320]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 举起状态持续时间 : {value2}秒
    # REMOVE: data2 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 砸向地面攻击力 : {value3}%
    # REMOVE: data3 = [0, 4915, 5414, 5912, 6411, 6909, 7408, 7907, 8405, 8904, 9403, 9901, 10400, 10898, 11397, 11896, 12394, 12893, 13392, 13890, 14389, 14887, 15386, 15885, 16383, 16882, 17381, 17879, 18378, 18876, 19375, 19874, 20372, 20871, 21370, 21868, 22367, 22865, 23364, 23863, 24361, 24860, 25359, 25857, 26356, 26854, 27353, 27852, 28350, 28849, 29348, 29846, 30345, 30843, 31342, 31841, 32339, 32838, 33337, 33835, 34334, 34832, 35331, 35830, 36328, 36827, 37326, 37824, 38323, 38821, 39320]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hie3 = 1
    # 对无法抓取的敌人攻击力 : {value4}%
    # REMOVE: data4 = [0, 4915, 5414, 5912, 6411, 6909, 7408, 7907, 8405, 8904, 9403, 9901, 10400, 10898, 11397, 11896, 12394, 12893, 13392, 13890, 14389, 14887, 15386, 15885, 16383, 16882, 17381, 17879, 18378, 18876, 19375, 19874, 20372, 20871, 21370, 21868, 22367, 22865, 23364, 23863, 24361, 24860, 25359, 25857, 26356, 26854, 27353, 27852, 28350, 28849, 29348, 29846, 30345, 30843, 31342, 31841, 32339, 32838, 33337, 33835, 34334, 34832, 35331, 35830, 36328, 36827, 37326, 37824, 38323, 38821, 39320]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 血之共鸣
# mage_male/blood_mage/95b58ec89893dd9e50da1281ebe57175
# a5ccbaf5538981c6ef99b236c0a60b73/95b58ec89893dd9e50da1281ebe57175
class Skill22(PassiveSkill):
    """
    精通鲜血的力量并与之共鸣。
    """
    name = "血之共鸣"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 0 #TODO
    rangeLv = 3
    uuid = "95b58ec89893dd9e50da1281ebe57175"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    associate = [{"data":data0}]

# 血蝠之舞
# mage_male/blood_mage/c91a62dc0a18360acf5031ac0ebf09f5
# a5ccbaf5538981c6ef99b236c0a60b73/c91a62dc0a18360acf5031ac0ebf09f5
class Skill23(ActiveSkill):
    """
    召唤蝙蝠群， 使范围内的敌人受到多段伤害并吸取猩红气息。
    """
    name = "血蝠之舞"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 6
    mp = [80, 800]
    uuid = "c91a62dc0a18360acf5031ac0ebf09f5"
    hasVP = False
    hasUP = True

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 237, 261, 285, 309, 333, 357, 381, 405, 429, 453, 477, 501, 526, 550, 574, 598, 622, 646, 670, 694, 718, 742, 766, 790, 814, 838, 862, 886, 910, 934, 958, 982, 1006, 1030, 1054, 1079, 1103, 1127, 1151, 1175, 1199, 1223, 1247, 1271, 1295, 1319, 1343, 1367, 1391, 1415, 1439, 1463, 1487, 1511, 1535, 1559, 1583, 1607, 1632, 1656, 1680, 1704, 1728, 1752, 1776, 1800, 1824, 1848, 1872, 1896]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 51
    # 持续时间 : {value1}秒
    # REMOVE: data1 = [0, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1, 5.1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51, 51]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 猩红气息吸收量 : {value3}%
    # REMOVE: data3 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 猩红狩猎
# mage_male/blood_mage/0c3a468aee1f7ce06bf91eb3319518c1
# a5ccbaf5538981c6ef99b236c0a60b73/0c3a468aee1f7ce06bf91eb3319518c1
class Skill24(ActiveSkill):
    """
    在前方生成猩红之池， 从中射出针刺攻击敌人。\n
    施放时， 输入向下/后方向键时， 则针刺就会从背后攻击敌人。
    """
    name = "猩红狩猎"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 8
    uuid = "0c3a468aee1f7ce06bf91eb3319518c1"
    hasVP = False
    hasUP = True

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 针刺攻击力 : {value1}%
    # REMOVE: data1 = [0, 2552, 2811, 3070, 3329, 3588, 3846, 4105, 4364, 4623, 4882, 5141, 5400, 5659, 5918, 6177, 6435, 6694, 6953, 7212, 7471, 7730, 7989, 8248, 8507, 8766, 9024, 9283, 9542, 9801, 10060, 10319, 10578, 10837, 11096, 11355, 11613, 11872, 12131, 12390, 12649, 12908, 13167, 13426, 13685, 13944, 14202, 14461, 14720, 14979, 15238, 15497, 15756, 16015, 16274, 16533, 16791, 17050, 17309, 17568, 17827, 18086, 18345, 18604, 18863, 19122, 19380, 19639, 19898, 20157, 20416]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit0 = 5
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 赤红燃烧
# mage_male/blood_mage/5cac3411ccef1af333953e0ded5e942d
# a5ccbaf5538981c6ef99b236c0a60b73/5cac3411ccef1af333953e0ded5e942d
class Skill25(ActiveSkill):
    """
    增加攻击力。
    """
    name = "赤红燃烧"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 8 #TODO
    rangeLv = 3
    cd = 5
    uuid = "5cac3411ccef1af333953e0ded5e942d"
    hasVP = False
    hasUP = False

    # 增益效果持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击力和技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 狱血之犬
# mage_male/blood_mage/85f7c810ad503790e8626439fe936d56
# a5ccbaf5538981c6ef99b236c0a60b73/85f7c810ad503790e8626439fe936d56
class Skill26(ActiveSkill):
    """
    利用猩红气息生成犬形怪物咬住敌人， 使其无法动弹， 然后撕咬敌人造成多段伤害并吸取猩红气息。\n
    施放时输入下方向键 ， 可以缩短犬形怪物的突进距离。
    """
    name = "狱血之犬"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 10
    mp = [112, 1120]
    uuid = "85f7c810ad503790e8626439fe936d56"
    hasVP = False
    hasUP = True

    # 物理攻击力 : {value0}%
    # REMOVE: data0 = [0, 956, 1053, 1150, 1246, 1343, 1440, 1537, 1634, 1731, 1828, 1925, 2022, 2119, 2216, 2313, 2410, 2507, 2604, 2701, 2798, 2895, 2991, 3088, 3185, 3282, 3379, 3476, 3573, 3670, 3767, 3864, 3961, 4058, 4155, 4252, 4349, 4446, 4543, 4640, 4737, 4833, 4930, 5027, 5124, 5221, 5318, 5415, 5512, 5609, 5706, 5803, 5900, 5997, 6094, 6191, 6288, 6385, 6482, 6579, 6675, 6772, 6869, 6966, 7063, 7160, 7257, 7354, 7451, 7548, 7645]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 撕咬多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 956, 1053, 1150, 1247, 1344, 1441, 1538, 1635, 1732, 1829, 1926, 2023, 2120, 2217, 2314, 2411, 2508, 2605, 2702, 2799, 2896, 2993, 3090, 3187, 3284, 3381, 3478, 3575, 3672, 3769, 3866, 3963, 4060, 4157, 4254, 4351, 4448, 4545, 4642, 4739, 4836, 4933, 5030, 5127, 5224, 5321, 5418, 5514, 5611, 5708, 5805, 5902, 5999, 6096, 6193, 6290, 6387, 6484, 6581, 6678, 6775, 6872, 6969, 7066, 7163, 7260, 7357, 7454, 7551, 7648]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 13
    # 撕咬攻击持续时间 : {value2}秒
    # REMOVE: data2 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 撕咬攻击多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 猩红气息吸收量 : {value4}%
    # REMOVE: data4 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 狱血之牙
# mage_male/blood_mage/31823197cc0b04d4c5dcf8f928d9220c
# a5ccbaf5538981c6ef99b236c0a60b73/31823197cc0b04d4c5dcf8f928d9220c
class Skill27(ActiveSkill):
    """
    利用猩红气息生成巨大的尖齿撕咬敌人。\n
    施放时， 输入向前方向键， 则可以在更远处生成尖齿。
    """
    name = "狱血之牙"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 12
    uuid = "31823197cc0b04d4c5dcf8f928d9220c"
    hasVP = False
    hasUP = True

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 撕咬攻击力 : {value1}%
    # REMOVE: data1 = [0, 17074, 18806, 20538, 22270, 24003, 25735, 27467, 29199, 30931, 32663, 34395, 36128, 37860, 39592, 41324, 43056, 44788, 46520, 48253, 49985, 51717, 53449, 55181, 56913, 58645, 60378, 62110, 63842, 65574, 67306, 69038, 70770, 72503, 74235, 75967, 77699, 79431, 81163, 82896, 84628, 86360, 88092, 89824, 91556, 93288, 95021, 96753, 98485, 100217, 101949, 103681, 105413, 107146, 108878, 110610, 112342, 114074, 115806, 117538, 119271, 121003, 122735, 124467, 126199, 127931, 129663, 131396, 133128, 134860, 136592]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit0 = 1
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 绯红之狱
# mage_male/blood_mage/dac8d8207618150c162e4c6f9e168527
# a5ccbaf5538981c6ef99b236c0a60b73/dac8d8207618150c162e4c6f9e168527
class Skill28(ActiveSkill):
    """
    爆发出旋转的猩红气息， 对周围的敌人造成多段攻击伤害。
    """
    name = "绯红之狱"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    uuid = "dac8d8207618150c162e4c6f9e168527"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 2652, 2921, 3190, 3459, 3728, 3997, 4266, 4535, 4804, 5073, 5342, 5611, 5881, 6150, 6419, 6688, 6957, 7226, 7495, 7764, 8033, 8302, 8571, 8840, 9109, 9378, 9647, 9916, 10185, 10454, 10723, 10992, 11261, 11530, 11799, 12069, 12338, 12607, 12876, 13145, 13414, 13683, 13952, 14221, 14490, 14759, 15028, 15297, 15566, 15835, 16104, 16373, 16642, 16911, 17180, 17449, 17718, 17987, 18257, 18526, 18795, 19064, 19333, 19602, 19871, 20140, 20409, 20678, 20947, 21216]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 10
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130, 130]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [绯红之狱]\n
        不再生成猩红气息， 而是展开猩红地狱攻击更大范围\n
        猩红地狱展开期间所受伤害减少， 并从接触猩红地狱的敌人身上汲取生命值\n
         - 攻击时间增加\n
         - 攻击过程中所受伤害 -70%\n
         - 猩红地狱每次命中敌人时， 恢复1%的生命值 (最多恢复10%)
        """
        ...

    def vp_2(self):
        """
        [绯红之狱]\n
        冷却时间变更为6秒\n
        总攻击力 -66.6%\n
         - 猩红气息消耗量 -66.6%\n
        固定在前方生成猩红气息\n
         - 施放技能后可以移动\n
        召唤猩红气息时， 同时召唤蝙蝠群\n
         - [血蝠之舞]技能不在冷却时间时， 施放该技能会同时施放[血蝠之舞]
        """
        self.cd = 6
        self.skillRation *= 1 - 0.666
        ...

# 噬魂囚笼
# mage_male/blood_mage/8e358ecf99ac9df31a6132aeafe378a9
# a5ccbaf5538981c6ef99b236c0a60b73/8e358ecf99ac9df31a6132aeafe378a9
class Skill29(ActiveSkill):
    """
    在地面生成巨大的猩红之池， 从外围开始往中心喷射向上的猩红气息。\n
    向上喷射的血气将敌人击退至猩红之池中心， 并吸取血气。
    """
    name = "噬魂囚笼"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [192, 1920]
    uuid = "8e358ecf99ac9df31a6132aeafe378a9"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 1421, 1565, 1709, 1853, 1998, 2142, 2286, 2430, 2574, 2718, 2863, 3007, 3151, 3295, 3439, 3583, 3728, 3872, 4016, 4160, 4304, 4448, 4593, 4737, 4881, 5025, 5169, 5313, 5457, 5602, 5746, 5890, 6034, 6178, 6322, 6467, 6611, 6755, 6899, 7043, 7187, 7332, 7476, 7620, 7764, 7908, 8052, 8196, 8341, 8485, 8629, 8773, 8917, 9061, 9206, 9350, 9494, 9638, 9782, 9926, 10071, 10215, 10359, 10503, 10647, 10791, 10936, 11080, 11224, 11368]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 24
    # 持续时间 : {value1}秒
    # REMOVE: data1 = [0, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4, 4.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 猩红气息吸收量 : {value3}%
    # REMOVE: data3 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [噬魂囚笼]\n
        使用强化过的力量施放技能\n
         - 攻击范围 +50%\n
         - 设置僵直减少\n
         - 吸附力增加\n
        怨魂会抓住敌人， 附加减速效果\n
         - 攻击速度和移动速度 -50%
        """
        ...

    def vp_2(self):
        """
        [噬魂囚笼]\n
        存在正在被吸收猩红气息的敌人时可以施放\n
         - 将对方的灵魂抽出变成铃铛\n
         - 将抽出的灵魂附着在敌人身上\n
        删除向上攻击\n
         - 5秒后铃铛破碎， 对灵魂被抽出的敌人造成单次伤害\n
        存在铃铛的状态下施放[猩红狩猎]技能时， 使用猩红之枪穿透铃铛\n
         - 铃铛立即破碎， 适用[猩红狩猎]技能和该技能的伤害\n
         - 总攻击力相同
        """
        ...

# 隐行之噬
# mage_male/blood_mage/78b86e64fbb74c1db1b71c50a5ac21cd
# a5ccbaf5538981c6ef99b236c0a60b73/78b86e64fbb74c1db1b71c50a5ac21cd
class Skill30(ActiveSkill):
    """
    向前潜行一段距离并抓取一个敌人吸取大量的猩红气息。\n
    施放技能时消耗一定的猩红气息， 但是通过技能可以吸取更多猩红气息。
    """
    name = "隐行之噬"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    uuid = "78b86e64fbb74c1db1b71c50a5ac21cd"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 猩红气息吸收量 : {value1}%
    # REMOVE: data1 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 吸血次数 : {value2}次
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 吸血目标攻击力 : {value3}%
    # REMOVE: data3 = [0, 67266, 74090, 80914, 87738, 94562, 101386, 108211, 115035, 121859, 128683, 135507, 142331, 149155, 155979, 162803, 169627, 176451, 183275, 190100, 196924, 203748, 210572, 217396, 224220, 231044, 237868, 244692, 251516, 258340, 265165, 271989, 278813, 285637, 292461, 299285, 306109, 312933, 319757, 326581, 333405, 340229, 347054, 353878, 360702, 367526, 374350, 381174, 387998, 394822, 401646, 408470, 415294, 422119, 428943, 435767, 442591, 449415, 456239, 463063, 469887, 476711, 483535, 490359, 497183, 504008, 510832, 517656, 524480, 531304, 538128]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 吸血目标范围攻击力 : {value4}%
    # REMOVE: data4 = [0, 67266, 74090, 80914, 87738, 94562, 101386, 108211, 115035, 121859, 128683, 135507, 142331, 149155, 155979, 162803, 169627, 176451, 183275, 190100, 196924, 203748, 210572, 217396, 224220, 231044, 237868, 244692, 251516, 258340, 265165, 271989, 278813, 285637, 292461, 299285, 306109, 312933, 319757, 326581, 333405, 340229, 347054, 353878, 360702, 367526, 374350, 381174, 387998, 394822, 401646, 408470, 415294, 422119, 428943, 435767, 442591, 449415, 456239, 463063, 469887, 476711, 483535, 490359, 497183, 504008, 510832, 517656, 524480, 531304, 538128]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 对无法抓取的目标吸血攻击力 : {value5}%
    # REMOVE: data5 = [0, 67266, 74090, 80914, 87738, 94562, 101386, 108211, 115035, 121859, 128683, 135507, 142331, 149155, 155979, 162803, 169627, 176451, 183275, 190100, 196924, 203748, 210572, 217396, 224220, 231044, 237868, 244692, 251516, 258340, 265165, 271989, 278813, 285637, 292461, 299285, 306109, 312933, 319757, 326581, 333405, 340229, 347054, 353878, 360702, 367526, 374350, 381174, 387998, 394822, 401646, 408470, 415294, 422119, 428943, 435767, 442591, 449415, 456239, 463063, 469887, 476711, 483535, 490359, 497183, 504008, 510832, 517656, 524480, 531304, 538128]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 对无法抓取的目标吸血范围攻击力 : {value6}%
    # REMOVE: data6 = [0, 67266, 74090, 80914, 87738, 94562, 101386, 108211, 115035, 121859, 128683, 135507, 142331, 149155, 155979, 162803, 169627, 176451, 183275, 190100, 196924, 203748, 210572, 217396, 224220, 231044, 237868, 244692, 251516, 258340, 265165, 271989, 278813, 285637, 292461, 299285, 306109, 312933, 319757, 326581, 333405, 340229, 347054, 353878, 360702, 367526, 374350, 381174, 387998, 394822, 401646, 408470, 415294, 422119, 428943, 435767, 442591, 449415, 456239, 463063, 469887, 476711, 483535, 490359, 497183, 504008, 510832, 517656, 524480, 531304, 538128]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 吸血结束后无敌时间 : {value7}秒
    # REMOVE: data7 = [0, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35, 0.35]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

    def vp_1(self):
        """
        [隐行之噬]\n
        不存在目标的情况下无法施放\n
        不再向敌人突进， 而是融入黑暗进行攻击\n
         - 追踪前方一定范围内的敌人
        """
        ...

    def vp_2(self):
        """
        [隐行之噬]\n
        更加残忍地从敌人体内夺取体力\n
         - 不再撕咬敌人， 而是用猩红之爪迅速进行更大范围的攻击\n
         - 恢复所消耗生命值的20%\n
        吸收猩红气息， 一定时间内增加活力\n
         - 30秒内移动速度 +10%
        """
        ...

# 赤狱之力
# mage_male/blood_mage/f4a561e272cc434a4905b3aa0c0de090
# a5ccbaf5538981c6ef99b236c0a60b73/f4a561e272cc434a4905b3aa0c0de090
class Skill31(PassiveSkill):
    """
    猩红法师觉醒为赤狱伯爵， 可以使猩红气息发挥出更强的效果。\n
    进入地下城时，猩红气息系列技能始终处于高涨状态， 技能形态发生变化， 并增加攻击力。
    """
    name = "赤狱之力"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "f4a561e272cc434a4905b3aa0c0de090"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5, 33, 34.5, 36, 37.5, 39, 40.5, 42, 43.5, 45, 46.5, 48, 49.5, 51, 52.5, 54, 55.5, 57, 58.5, 60, 61.5, 63, 64.5, 66, 67.5, 69, 70.5, 72, 73.5, 75, 76.5, 78, 79.5, 81, 82.5, 84, 85.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    associate = [{"data":data0}]

# 伯爵之歌
# mage_male/blood_mage/0e409ac3e1c1f3976b3ef2bfe4c13069
# a5ccbaf5538981c6ef99b236c0a60b73/0e409ac3e1c1f3976b3ef2bfe4c13069
class Skill32(ActiveSkill):
    """
    赤狱伯爵爆发体内的力量， 变成猩红之湖，将眼前的所有东西用猩红之枪穿刺掉，并吸收血气。\n
    [成为锐利之枪， 穿刺敌人吧！]
    """
    name = "伯爵之歌"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    uuid = "0e409ac3e1c1f3976b3ef2bfe4c13069"
    hasVP = False
    hasUP = False

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 5806, 7152, 8498, 9844, 11190, 12537, 13883, 15229, 16575, 17921, 19268, 20614, 21960, 23306, 24652, 25999, 27345, 28691, 30037, 31383, 32730, 34076, 35422, 36768, 38114, 39461, 40807, 42153, 43499, 44845, 46192, 47538, 48884, 50230, 51576, 52923, 54269, 55615, 56961, 58307, 59654, 61000, 62346, 63692, 65038, 66385, 67731, 69077, 70423, 71769]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 14
    # 多段攻击次数 : {value2}次秒
    # REMOVE: data2 = [0, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最终一击攻击力 : {value3}%
    # REMOVE: data3 = [0, 34833, 42910, 50987, 59065, 67142, 75219, 83296, 91374, 99451, 107528, 115605, 123682, 131760, 139837, 147914, 155991, 164068, 172146, 180223, 188300, 196377, 204455, 212532, 220609, 228686, 236763, 244841, 252918, 260995, 269072, 277150, 285227, 293304, 301381, 309458, 317536, 325613, 333690, 341767, 349844, 357922, 365999, 374076, 382153, 390231, 398308, 406385, 414462, 422539, 430617]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1
    # 猩红气息吸收量 : {value4}%
    # REMOVE: data4 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 魔仆召唤 : 狱犬
# mage_male/blood_mage/2e2b7efe778656690f9c8cb6e47c3932
# a5ccbaf5538981c6ef99b236c0a60b73/2e2b7efe778656690f9c8cb6e47c3932
class Skill33(ActiveSkill):
    """
    在前方的猩红之池中召唤魔犬军团攻击范围内的敌人。\n
    魔犬来回跳跃撕咬敌人并吸取猩红气息。\n
    施放时， 输入向前方向键， 则可以在更远处生成猩红之池。
    """
    name = "魔仆召唤 : 狱犬"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [640, 1920]
    uuid = "2e2b7efe778656690f9c8cb6e47c3932"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 2849, 3138, 3427, 3716, 4005, 4294, 4583, 4872, 5161, 5450, 5739, 6028, 6317, 6606, 6895, 7184, 7473, 7762, 8052, 8341, 8630, 8919, 9208, 9497, 9786, 10075, 10364, 10653, 10942, 11231, 11520, 11809, 12098, 12387, 12676, 12965, 13254, 13543, 13832, 14121, 14410, 14699, 14988, 15277, 15566, 15855, 16144, 16433, 16722, 17011]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 17
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 猩红气息吸收量 : {value2}%
    # REMOVE: data2 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [魔仆召唤 : 狱犬]\n
        召唤覆盖更大范围的狱犬\n
        四只狱犬冲向沼泽中央， 将敌人聚集到中心位置\n
         - 随后血口出现在沼泽中央， 吞噬敌人\n
         - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [魔仆召唤 : 狱犬]\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 12.5秒\n
         - 单次攻击力 -50%\n
        召唤准备时间 -50%\n
        在前方一定范围内最强敌人下方召唤沼泽， 追踪目标\n
         - 沼泽可以追踪敌人到一定高度
        """
        self.cd = 12.5
        self.skillRation *= 1 - 0.5
        ...

# 血翼绽放
# mage_male/blood_mage/902a016f6978f13740f237e4740a5646
# a5ccbaf5538981c6ef99b236c0a60b73/902a016f6978f13740f237e4740a5646
class Skill34(ActiveSkill):
    """
    化作蝙蝠群瞬移到前方， 然后向周围散发蝙蝠群冲击波和猩红之翼攻击敌人。\n
    蝙蝠群冲击波可以将敌人汇聚到角色身边。\n
    施放时， 可以利用向前/下方向键调整瞬移距离。
    """
    name = "血翼绽放"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    uuid = "902a016f6978f13740f237e4740a5646"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蝙蝠群冲击波攻击力 : {value1}%
    # REMOVE: data1 = [0, 32327, 35606, 38886, 42165, 45445, 48724, 52004, 55284, 58563, 61843, 65122, 68402, 71681, 74961, 78240, 81520, 84799, 88079, 91358, 94638, 97917, 101197, 104476, 107756, 111036, 114315, 117595, 120874, 124154, 127433, 130713, 133992, 137272, 140551, 143831, 147110, 150390, 153669, 156949, 160228, 163508, 166788, 170067, 173347, 176626, 179906, 183185, 186465, 189744, 193024]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 猩红之翼攻击力 : {value2}%
    # REMOVE: data2 = [0, 48490, 53409, 58329, 63248, 68167, 73087, 78006, 82925, 87845, 92764, 97683, 102602, 107522, 112441, 117360, 122280, 127199, 132118, 137038, 141957, 146876, 151795, 156715, 161634, 166553, 171473, 176392, 181311, 186230, 191150, 196069, 200988, 205908, 210827, 215746, 220666, 225585, 230504, 235423, 240343, 245262, 250181, 255101, 260020, 264939, 269859, 274778, 279697, 284616, 289536]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [血翼绽放]\n
        瞬移前， 可以长按技能键蓄气\n
         - 蓄力时间上限 : 0.35秒\n
         - 蓄气过程中无敌\n
        根据蓄气时间增加攻击范围\n
         - 最大蓄气时增加40%
        """
        ...

    def vp_2(self):
        """
        [血翼绽放]\n
        可以在空中施放技能\n
        瞬移后， 可以强制中断僵直并施放其他转职技能
        """
        ...

# 地狱冥犬
# mage_male/blood_mage/4c5271b0ecce120d7fc113f377fae76f
# a5ccbaf5538981c6ef99b236c0a60b73/4c5271b0ecce120d7fc113f377fae76f
class Skill35(ActiveSkill):
    """
    利用猩红气息和蝙蝠群生成巨大的犬形怪撕咬敌人， 并吸收猩红气息。\n
    施放时， 输入向前方向键， 可以撕咬更远处的敌人。
    """
    name = "地狱冥犬"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 2
    cube = 3
    cd = 30
    mp = [1066, 2133]
    uuid = "4c5271b0ecce120d7fc113f377fae76f"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 撕咬攻击力 : {value0}%
    # REMOVE: data0 = [0, 2241, 2468, 2695, 2923, 3150, 3377, 3605, 3832, 4059, 4287, 4514, 4741, 4969, 5196, 5423, 5651, 5878, 6105, 6333, 6560, 6787, 7015, 7242, 7469, 7696, 7924, 8151, 8378, 8606, 8833, 9060, 9288, 9515, 9742, 9970, 10197, 10424, 10652, 10879, 11106, 11334, 11561, 11788, 12016, 12243, 12470, 12698, 12925, 13152, 13380]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 20
    # 撕咬次数 : {value1}次
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 冲向地面攻击力 : {value2}%
    # REMOVE: data2 = [0, 44815, 49361, 53908, 58454, 63001, 67547, 72094, 76640, 81187, 85733, 90279, 94826, 99372, 103919, 108465, 113012, 117558, 122105, 126651, 131198, 135744, 140290, 144837, 149383, 153930, 158476, 163023, 167569, 172116, 176662, 181208, 185755, 190301, 194848, 199394, 203941, 208487, 213034, 217580, 222127, 226673, 231219, 235766, 240312, 244859, 249405, 253952, 258498, 263045, 267591]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 猩红气息吸收量 : {value3}%
    # REMOVE: data3 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [地狱冥犬]\n
        召唤地狱冥犬， 攻击大范围敌人\n
         - 删除撕咬攻击\n
         - 变更冲向地面的攻击范围\n
         - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [地狱冥犬]\n
        基本冷却时间变更为60秒\n
        总攻击力 +100%\n
        在第一只冥犬的对面额外召唤一只冥犬， 同时进行攻击\n
         - 猩红气息吸收量 +100%
        """
        ...

# 鲜血之殇
# mage_male/blood_mage/370586038cf40378f20d338d507a780c
# a5ccbaf5538981c6ef99b236c0a60b73/370586038cf40378f20d338d507a780c
class Skill36(PassiveSkill):
    """
    赤狱君主领悟了猩红真谛， 可以给敌人造成更大的致命伤。 在猩红气息蓄满的状态下吸收气息时， 可以恢复体力。
    """
    name = "鲜血之殇"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 3
    uuid = "370586038cf40378f20d338d507a780c"
    hasVP = False
    hasUP = False

    # 暴击伤害增加率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 物理暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 猩红气息吸收量与生命值恢复量比率 : {value2}%
    # REMOVE: data2 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    associate = [{"data":data0}]

# 死亡之握
# mage_male/blood_mage/dd32a9825ec1af42a91f2223be6658e5
# a5ccbaf5538981c6ef99b236c0a60b73/dd32a9825ec1af42a91f2223be6658e5
class Skill37(ActiveSkill):
    """
    形成猩红气息湖泊， 将上面的目标吸附到猩红法师的前方。 然后向敌人身上插入猩红气息之刺使其进入眩晕状态， 然后将刺和精气一起拔出。
    """
    name = "死亡之握"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 5
    cd = 50
    uuid = "dd32a9825ec1af42a91f2223be6658e5"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 拔出精气时攻击力 : {value1}%
    # REMOVE: data1 = [0, 124351, 136966, 149582, 162197, 174812, 187428, 200043, 212658, 225274, 237889, 250504, 263120, 275735, 288350, 300965, 313581, 326196, 338811, 351427, 364042, 376657, 389273, 401888, 414503, 427119, 439734, 452349, 464965, 477580, 490195, 502811, 515426, 528041, 540657, 553272, 565887, 578502, 591118, 603733, 616348, 628964, 641579, 654194, 666810, 679425, 692040, 704656, 717271, 729886, 742502]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [死亡之握]\n
        攻击范围变更为猩红湖水的范围\n
         - 删除聚集敌人功能\n
         - 攻击接触到猩红湖水的所有敌人
        """
        ...

    def vp_2(self):
        """
        [死亡之握]\n
        删除按住技能键后调整攻击时机的功能\n
         - 攻击准备时间 +0.5秒\n
        攻击准备时， 可以施放部分技能， 将力量储存在湖泊中\n
         - 提取精气时， 结算所储存技能的伤害\n
        [可储存的技能] (6种)\n
         - [血蝠之袭]、 [鲜血长枪]、 [血蝠之舞]、[猩红狩猎]、 [狱血之犬]、 [狱血之牙]
        """
        ...

# 血界彼岸
# mage_male/blood_mage/fa3ee243b36699e9d3fc34328adf6417
# a5ccbaf5538981c6ef99b236c0a60b73/fa3ee243b36699e9d3fc34328adf6417
class Skill38(ActiveSkill):
    """
    赤狱君主释放体内的力量， 生成龙卷风攻击敌人并吸取猩红气息。\n
    连续按攻击键或技能键， 可以加快攻击速度。\n
    [和我融为一体吧！]
    """
    name = "血界彼岸"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    uuid = "fa3ee243b36699e9d3fc34328adf6417"
    hasVP = False
    hasUP = False

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 猩红气息吸收量 : {value1}%
    # REMOVE: data1 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击力 : {value2}%
    # REMOVE: data2 = [0, 3549, 4372, 5195, 6018, 6841, 7664, 8486, 9309, 10132, 10955, 11778, 12601, 13424, 14247, 15070, 15893, 16716, 17539, 18362, 19185, 20008, 20830, 21653, 22476, 23299, 24122, 24945, 25768, 26591, 27414, 28237, 29060, 29883, 30706, 31529, 32352, 33174, 33997, 34820, 35643, 36466, 37289, 38112, 38935, 39758, 40581, 41404, 42227, 43050, 43873]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 34
    # 多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34, 34]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最终一击攻击力 : {value4}%
    # REMOVE: data4 = [0, 120663, 148642, 176622, 204602, 232581, 260561, 288541, 316520, 344500, 372480, 400460, 428439, 456419, 484399, 512378, 540358, 568338, 596318, 624297, 652277, 680257, 708236, 736216, 764196, 792176, 820155, 848135, 876115, 904094, 932074, 960054, 988034, 1016013, 1043993, 1071973, 1099952, 1127932, 1155912, 1183891, 1211871, 1239851, 1267831, 1295810, 1323790, 1351770, 1379749, 1407729, 1435709, 1463689, 1491668]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 1

# 猩红之眼
# mage_male/blood_mage/3cb633d00f8f6ee088682c9171020d26
# a5ccbaf5538981c6ef99b236c0a60b73/3cb633d00f8f6ee088682c9171020d26
class Skill39(PassiveSkill):
    """
    知源·猩红法师自身的心脏和生命——黑暗之眼与猩红气息彻底同化， 再生出一个完整的“猩红之眼”。\n
    凭借猩红之眼的力量， 增加基本攻击力和转职技能攻击力， 增加猩红气息的吸收量和吸收持续时间， 部分技能获得附加效果。\n
    [血蝠之袭]\n
    召唤大量血蝠群攻击敌人， 最多可以攻击10个敌人。\n
    [狱血之牙]\n
    存在猩红气息吸收的敌人时， 在敌人位置生成尖齿， 造成更大范围的伤害。
    """
    name = "猩红之眼"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "3cb633d00f8f6ee088682c9171020d26"
    hasVP = False
    hasUP = False

    # 基本、 技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 猩红气息吸收量增加率 : {value1}%
    # REMOVE: data1 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 吸收持续时间增加率 : {value2}%
    # REMOVE: data2 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [狱血之牙]探索范围 : {value3}px
    # REMOVE: data3 = [0, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    associate = [{"data":data0}]

# 血翼蔽空
# mage_male/blood_mage/6d7c9a15c08cc41d70125083e869e1a1
# a5ccbaf5538981c6ef99b236c0a60b73/6d7c9a15c08cc41d70125083e869e1a1
class Skill40(ActiveSkill):
    """
    生成血翼， 原地旋转的同时大幅挥动血翼， 击飞前方的敌人。\n
    角色后方的敌人被击时， 被击退至向角色前方一定距离。
    """
    name = "血翼蔽空"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    uuid = "6d7c9a15c08cc41d70125083e869e1a1"
    hasVP = False
    hasUP = False

    # 猩红气息消耗量 : {value0}%
    # REMOVE: data0 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 猩红之翼斩击攻击力 : {value1}%
    # REMOVE: data1 = [0, 200503, 220844, 241185, 261526, 281867, 302207, 322548, 342889, 363230, 383571, 403912, 424253, 444594, 464934, 485275, 505616, 525957, 546298, 566639, 586980, 607321, 627662, 648002, 668343, 688684, 709025, 729366, 749707, 770048, 790389, 810730, 831070, 851411, 871752, 892093, 912434, 932775, 953116, 973457, 993797, 1014138, 1034479, 1054820, 1075161, 1095502, 1115843, 1136184, 1156525, 1176865, 1197206]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit0 = 1

# 血域帷幕·陨灭
# mage_male/blood_mage/1ff42548e611b94781a1ae8f063dd679
# a5ccbaf5538981c6ef99b236c0a60b73/1ff42548e611b94781a1ae8f063dd679
class Skill41(ActiveSkill):
    """
    消耗剩余的所有猩红气息展开猩红气息帷幕， 从敌人体内抽取生命根源的猩红气息并束缚敌人。\n
    然后， 将抽取的猩红气息凝集成结晶体后将其打碎， 对敌人造成致命的伤害。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "血域帷幕·陨灭"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    uuid = "1ff42548e611b94781a1ae8f063dd679"
    hasVP = False
    hasUP = False

    # 猩红气息帷幕攻击力 : {value0}%
    # REMOVE: data0 = [0, 68076, 83862, 99647, 115433, 131219, 147004, 162790, 178576, 194362, 210147, 225933, 241719, 257504, 273290, 289076, 304862, 320647, 336433, 352219, 368005, 383790, 399576, 415362, 431147, 446933, 462719, 478505, 494290, 510076, 525862, 541647, 557433, 573219, 589005, 604790, 620576, 636362, 652147, 667933, 683719, 699505, 715290, 731076, 746862, 762647, 778433, 794219, 810005, 825790, 841576]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 猩红气息吸收多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 6808, 8386, 9965, 11543, 13122, 14700, 16279, 17858, 19436, 21015, 22593, 24172, 25750, 27329, 28908, 30486, 32065, 33643, 35222, 36800, 38379, 39958, 41536, 43115, 44693, 46272, 47850, 49429, 51008, 52586, 54165, 55743, 57322, 58900, 60479, 62058, 63636, 65215, 66793, 68372, 69950, 71529, 73108, 74686, 76265, 77843, 79422, 81000, 82579, 84158]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 20
    # 猩红气息吸收多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 终结爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 476531, 587031, 697531, 808031, 918531, 1029031, 1139531, 1250031, 1360531, 1471031, 1581531, 1692031, 1802531, 1913031, 2023531, 2134031, 2244531, 2355031, 2465532, 2576032, 2686532, 2797032, 2907532, 3018032, 3128532, 3239032, 3349532, 3460032, 3570532, 3681032, 3791532, 3902032, 4012532, 4123032, 4233532, 4344032, 4454532, 4565032, 4675532, 4786032, 4896532, 5007032, 5117532, 5228032, 5338532, 5449032, 5559532, 5670032, 5780532, 5891032]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 1


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'blood_mage'
        self.nameCN = '知源·血法师'
        self.role = 'mage_male'
        self.角色 = '魔法师(男)'
        self.职业 = '血法师'
        self.jobId = 'a5ccbaf5538981c6ef99b236c0a60b73'
        self.jobGrowId = '6d459bc74ba73ee4fe5cdc4655400193'

        self.武器选项 = ['矛', '魔杖', '法杖', '棍棒']
        self.输出类型选项 = ['物理百分比']
        self.输出类型 = '物理百分比'
        self.防具精通属性 = ['力量']
        self.防具类型 = '皮甲'
        self.buff = 2.042

        super().__init__(equVersion, __name__)
