#a5ccbaf5538981c6ef99b236c0a60b73
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "mage_male/dimension_walker/cn/skillDetail"


# 不死之身
# mage_male/dimension_walker/bb34e8854a93fd250347a1c64119f7ab
# a5ccbaf5538981c6ef99b236c0a60b73/bb34e8854a93fd250347a1c64119f7ab
class Skill2(PassiveSkill):
    """
    角色死亡后带着少量生命值原地复活， 并且进入自动恢复生命值模式。\n
    自动恢复生命值模式下， 角色的生命值值可以在一定时间内自动恢复至100%， 但无法借用任何道具或其它途径恢复生命值， 且所受到的伤害还会加剧。\n
    若在恢复模式下死亡， 则无法再次通过该技能复活。
    """
    name = "不死之身"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 3
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = False
    hasUP = False

    # 恢复模式下所受伤害增加 : {value0}%
    # REMOVE: data0 = [0, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 死亡时立即恢复的生命值量 : {value1}%
    # REMOVE: data1 = [0, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 恢复模式持续时间(普通地下城) : {value2}秒
    # REMOVE: data2 = [0, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 恢复模式持续时间(亡者峡谷) : {value3}秒
    # REMOVE: data3 = [0, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 黑暗之眼
# mage_male/dimension_walker/6e33d47e6622ce03b6defdd912140270
# a5ccbaf5538981c6ef99b236c0a60b73/6e33d47e6622ce03b6defdd912140270
class Skill3(PassiveSkill):
    """
    增加魔法师的魔法值最大值； 若魔法值低于一定比率时， 还可增加魔法值恢复速度。
    """
    name = "黑暗之眼"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 1
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 魔法值最大值增加 : {value0}%
    # REMOVE: data0 = [0, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 可触发恢复效果时的魔法值比率 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值恢复速度增加 : {value2}倍
    # REMOVE: data2 = [0, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 超然感知
# mage_male/dimension_walker/d53301bb328baf12a3ae482cc6a565dd
# a5ccbaf5538981c6ef99b236c0a60b73/d53301bb328baf12a3ae482cc6a565dd
class Skill4(PassiveSkill):
    """
    基本攻击变更为蕴含次元能量的魔法球， 并生成边界能量。\n
    [次元边界]\n
    -基本攻击或次元系列技能命中敌人时， 增加边界能量。\n
    -次元系列技能命中敌人时， 引发次元波动。\n
    - 能量条填满时， 可以获得次元石。\n
    -若在一定时间内没有引发次元波动， 边界能量条和波动数会逐渐减少。\n
    施放[次元边界]技能时， 会消耗次元石。\n
    [若你能看见别人看不见的东西， 只会让你更麻烦。]
    """
    name = "超然感知"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    uuid = "d53301bb328baf12a3ae482cc6a565dd"
    hasVP = False
    hasUP = False

    # 边界能量条最大值 : {value0}
    # REMOVE: data0 = [0, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 次元石持有量上限 : {value1}个
    # REMOVE: data1 = [0, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 普通攻击命中时能量条增加量 : {value2}
    # REMOVE: data2 = [0, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 次元边界
# mage_male/dimension_walker/7e904ea3d2a9faa054604e55120a9268
# a5ccbaf5538981c6ef99b236c0a60b73/7e904ea3d2a9faa054604e55120a9268
class Skill5(ActiveSkill):
    """
    施放时消耗一个次元石， 在下一个次元系列技能附加特殊能力或改变形态。\n
    已附加[次元边界]效果的次元系列技能， 将减少边界能量条获得量。\n
    可以强制中断释放中的转职技能， 并立即施放该技能。\n
    [请注意使用， 请尽快使用， 请不要给别人看， 除非你想其他人把你当成骗子。]
    """
    name = "次元边界"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 3
    cd = 0.1
    uuid = "7e904ea3d2a9faa054604e55120a9268"
    hasVP = False
    hasUP = False

    # 施放时所需次元石数量 : {value0}个
    # REMOVE: data0 = [0, 1]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 次元之乖离扫把精通
# mage_male/dimension_walker/5152480fdde81362575a488d4cec4af9
# a5ccbaf5538981c6ef99b236c0a60b73/5152480fdde81362575a488d4cec4af9
class Skill6(PassiveSkill):
    """
    可以装备扫把。 装备扫把时， 增加施放速度和命中率。\n
    学习[虚空之力]后， 装备扫把的状态下， 进入地下城或完全死亡后复活时， 增加1个边界能量条的波动次数。\n
    [很可惜， 由于某些原因， 需要放弃一些天生的东西。]
    """
    name = "次元之乖离扫把精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 7 #TODO
    rangeLv = 1
    uuid = "5152480fdde81362575a488d4cec4af9"
    hasVP = False
    hasUP = False

    # 施放速度增加 : {value0}%
    # REMOVE: data0 = [0, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)


# 基础精通
# mage_male/dimension_walker/5a56514f35cf0270ae8d6c65f8fefd78
# a5ccbaf5538981c6ef99b236c0a60b73/5a56514f35cf0270ae8d6c65f8fefd78
class Skill8(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [魔法旋风]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    associate = [{"type":"*skillRation","data":[i-100 if i>0 else 0 for i in data0],"skills":["乖离 : 禁忌之奈雅丽"]}]

# 幽冥火
# mage_male/dimension_walker/cfacda0647b9a0f595df2c2aad30c18d
# a5ccbaf5538981c6ef99b236c0a60b73/cfacda0647b9a0f595df2c2aad30c18d
class Skill13(ActiveSkill):
    """
    生成两团幽冥火， 可以增加自身的物理和魔法防御力， 且造成一定伤害， 效果持续一定时间。\n
    转职成次元行者时， 可以学习[虚妄之火]技能。\n
    学习[虚妄之火]后， 持续时间变更为无限， 且无法发动攻击。
    """
    name = "幽冥火"
    learnLv = 10
    masterLv = 10
    maxLv = 20
    position = 1 #TODO
    rangeLv = 3
    cd = 10
    mp = [30, 345]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 每个火球增加物理防御力 : {value1}
    # REMOVE: data1 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每个火球增加魔法防御力 : {value2}
    # REMOVE: data2 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每个火球的攻击力 : {value3}%
    # REMOVE: data3 = [0, 814, 944, 1074, 1203, 1333, 1463, 1593, 1722, 1852, 1982, 2112, 2241, 2371, 2501, 2631, 2761, 2890, 3020, 3150, 3280]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [虚妄之火效果] -
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法防御力增加 : {value5}
    # REMOVE: data5 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)


# 瞬移
# mage_male/dimension_walker/3d8f3d438405d79f8d3ed68072674d1e
# a5ccbaf5538981c6ef99b236c0a60b73/3d8f3d438405d79f8d3ed68072674d1e
class Skill14(ActiveSkill):
    """
    向指定方向快速移动一定距离。
    """
    name = "瞬移"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 2
    cd = 1.5
    mp = [40, 40]
    uuid = "3d8f3d438405d79f8d3ed68072674d1e"
    hasVP = False
    hasUP = False

    # X轴移动距离 : {value0}px
    # REMOVE: data0 = [0, 400]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # Y轴移动距离 : {value1}px
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 次元 : 坠落
# mage_male/dimension_walker/4f2e001e9a19eb7bae50ad1840dfb329
# a5ccbaf5538981c6ef99b236c0a60b73/4f2e001e9a19eb7bae50ad1840dfb329
class Skill19(ActiveSkill):
    """
    在空中开启次元之门， 掉落杂物箱。 被杂物箱命中的敌人将会进入眩晕状态， 还有一定几率掉落装有爆炸物的箱子。 施放时若按方向键， 可以在更远处掉落箱子。\n
    转职为次元行者后， 可以适用[次元边界]的效果。\n
    [次元边界效果]\n
    可将箱子掉落点周围的敌人汇聚到一起。\n
    [初学次元学的怪才们， 通常第一次犯的失误是将次元之门开在自己的头部上方， 第二次犯的失误是重复第一个失误……]
    """
    name = "次元 : 坠落"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 4
    mp = [30, 280]
    uuid = "4f2e001e9a19eb7bae50ad1840dfb329"
    hasVP = False
    hasUP = True

    # 普通情况下箱子掉落位置 : {value0}px
    # REMOVE: data0 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 按方向键时箱子掉落位置 : {value1}px
    # REMOVE: data1 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 边界能量条增加量 : {value2}
    # REMOVE: data2 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 箱子魔法攻击力 : {value3}
    # REMOVE: data3 = [0, 1231, 1355, 1480, 1605, 1730, 1855, 1980, 2104, 2229, 2354, 2479, 2604, 2729, 2853, 2978, 3103, 3228, 3353, 3478, 3603, 3727, 3852, 3977, 4102, 4227, 4352, 4476, 4601, 4726, 4851, 4976, 5101, 5225, 5350, 5475, 5600, 5725, 5850, 5974, 6099, 6224, 6349, 6474, 6599, 6724, 6848, 6973, 7098, 7223, 7348, 7473, 7597, 7722, 7847, 7972, 8097, 8222, 8346, 8471, 8596, 8721, 8846, 8971, 9095, 9220, 9345, 9470, 9595, 9720, 9845]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit0 = 1
    # 箱子冲击波攻击力 : {value4}
    # REMOVE: data4 = [0, 4190, 4616, 5041, 5466, 5891, 6316, 6741, 7166, 7591, 8016, 8442, 8867, 9292, 9717, 10142, 10567, 10992, 11417, 11843, 12268, 12693, 13118, 13543, 13968, 14393, 14818, 15243, 15669, 16094, 16519, 16944, 17369, 17794, 18219, 18644, 19070, 19495, 19920, 20345, 20770, 21195, 21620, 22045, 22470, 22896, 23321, 23746, 24171, 24596, 25021, 25446, 25871, 26296, 26722, 27147, 27572, 27997, 28422, 28847, 29272, 29697, 30123, 30548, 30973, 31398, 31823, 32248, 32673, 33098, 33523]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 0
    # 爆炸物箱子出现几率 : {value5}%
    # REMOVE: data5 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 爆炸物箱子攻击力 : {value6}
    # REMOVE: data6 = [0, 5280, 5816, 6351, 6887, 7423, 7958, 8494, 9030, 9565, 10101, 10637, 11172, 11708, 12244, 12779, 13315, 13851, 14386, 14922, 15458, 15993, 16529, 17065, 17600, 18136, 18671, 19207, 19743, 20278, 20814, 21350, 21885, 22421, 22957, 23492, 24028, 24564, 25099, 25635, 26171, 26706, 27242, 27778, 28313, 28849, 29385, 29920, 30456, 30992, 31527, 32063, 32599, 33134, 33670, 34206, 34741, 35277, 35813, 36348, 36884, 37420, 37955, 38491, 39026, 39562, 40098, 40633, 41169, 41705, 42240]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    hit6 = 1
    # 眩晕持续时间 : {value7}秒
    # REMOVE: data7 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # [次元边界效果]
    # 次元边界能量条增加量 : {value8}
    # REMOVE: data8 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    # 周围敌人吸附范围 : {value9}px
    # REMOVE: data9 = [0, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220, 220]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)

    mode = ["箱子","普通"]

    def setMode(self, mode):
        if mode == "普通":
            self.hit6 = 0
            self.hit4 = 1
        return super().setMode(mode)

# 乖离 : 虚无
# mage_male/dimension_walker/dbf8b30c7057032af0d68fcfa289fdae
# a5ccbaf5538981c6ef99b236c0a60b73/dbf8b30c7057032af0d68fcfa289fdae
class Skill20(PassiveSkill):
    """
    召唤异界的怪物——虚无环绕在脚下。\n
    虚无存在的时间内， 可以增加角色和奈雅丽的基本攻击力和次元系列技能的伤害。\n
    虚无可通过[乖离 : 迷雾]向前方发射， 附着敌人时， 技能效果发生改变。\n
    虚无的技能等级每次上升时， 怪物的影响力会变得更强， 施放[乖离 : 迷雾]时的生命值消耗量会增加。\n
    [是狂气的痕迹还是我的过失？]
    """
    name = "乖离 : 虚无"
    learnLv = 15
    masterLv = 10
    maxLv = 20
    position = 7 #TODO
    rangeLv = 3
    uuid = "dbf8b30c7057032af0d68fcfa289fdae"
    hasVP = False
    hasUP = False

    # 基本攻击和次元系列技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 迷雾附着敌人时， 基本攻击和次元系列技能攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 1.5, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    associate = [{"data":data0,"skills":["次元 : 坠落","次元 : 虚影","次元 : 跃迁","次元 : 离子束","次元 : 万花镜","次元 : 粒子风暴","次元 : 时空磁场","次元 : 粒子波","次元 : 思维聚爆","次元 : 奇点","禁断之盛宴","未明·次元崩坏","乖离 : 禁忌之奈雅丽"]}]

# 次元扭曲装置
# mage_male/dimension_walker/fc458e449ee00b01dbf88d09aae65462
# a5ccbaf5538981c6ef99b236c0a60b73/fc458e449ee00b01dbf88d09aae65462
class Skill21(PassiveSkill):
    """
    为了研究次元之力开发的道具。\n
    增加自身的技能攻击力、 魔法暴击率、 魔法值和施放速度。\n
    [虽然呼吸不畅， 但总比死了好多了吧……]
    """
    name = "次元扭曲装置"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 0 #TODO
    rangeLv = 3
    uuid = "fc458e449ee00b01dbf88d09aae65462"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值上限增加率 : {value2}%
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 施放速度增加 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    associate = [{"data":data0}]

# 次元 : 虚影
# mage_male/dimension_walker/1812a1ece67bb37b6b44b54766450064
# a5ccbaf5538981c6ef99b236c0a60b73/1812a1ece67bb37b6b44b54766450064
class Skill22(ActiveSkill):
    """
    将自身的形象投射到次元， 向前发射并攻击敌人。\n
    使用上下方向键时， 可以改变发射方向。\n
    [次元边界效果]\n
    缩短发射距离， 但是可以击退路径上的敌人。\n
    [有没有想过镜中的世界才是真实的？]
    """
    name = "次元 : 虚影"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 5
    mp = [20, 210]
    uuid = "1812a1ece67bb37b6b44b54766450064"
    hasVP = False
    hasUP = True

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击力 : {value1}
    # REMOVE: data1 = [0, 7846, 8642, 9438, 10234, 11030, 11826, 12622, 13418, 14214, 15010, 15806, 16602, 17398, 18194, 18990, 19786, 20582, 21378, 22173, 22969, 23765, 24561, 25357, 26153, 26949, 27745, 28541, 29337, 30133, 30929, 31725, 32521, 33317, 34113, 34909, 35705, 36501, 37297, 38093, 38889, 39685, 40481, 41277, 42073, 42869, 43665, 44461, 45257, 46053, 46849, 47645, 48441, 49236, 50032, 50828, 51624, 52420, 53216, 54012, 54808, 55604, 56400, 57196, 57992, 58788, 59584, 60380, 61176, 61972, 62768]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [次元边界效果]
    # 次元边界能量条增加量 : {value2}
    # REMOVE: data2 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 一般状态下突进距离比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 次元 : 跃迁
# mage_male/dimension_walker/2ba299855fc22192cba4f73db75e9d0e
# a5ccbaf5538981c6ef99b236c0a60b73/2ba299855fc22192cba4f73db75e9d0e
class Skill23(ActiveSkill):
    """
    开启异次元裂缝， 引发次元场攻击敌人并使敌人进入强制控制状态后， 向后方瞬移。\n
    被击状态下也可以施放该技能， 但是消耗1个次元石。\n
    在决斗场中， 不会强控敌人， 被击时可以施放的次数固定为1次。
    """
    name = "次元 : 跃迁"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 3
    cds = [0, 15, 14.9, 14.9, 14.8, 14.7, 14.7, 14.6, 14.5, 14.5, 14.4, 14.3, 14.3, 14.2, 14.2, 14.1, 14, 14, 13.9, 13.8, 13.8, 13.7, 13.6, 13.6, 13.5, 13.4, 13.4, 13.3, 13.2, 13.2, 13.1, 13, 13, 12.9, 12.8, 12.8, 12.7, 12.7, 12.6, 12.5, 12.5, 12.4, 12.3, 12.3, 12.2, 12.1, 12.1, 12, 11.9, 11.9, 11.8, 11.7, 11.7, 11.6, 11.5, 11.5, 11.4, 11.3, 11.3, 11.2, 11.2, 11.1, 11, 11, 10.9, 10.8, 10.8, 10.7, 10.6, 10.6, 10.5]
    mp = [20, 70]
    uuid = "2ba299855fc22192cba4f73db75e9d0e"
    hasVP = False
    hasUP = True

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 后方瞬移距离 : {value1}px
    # REMOVE: data1 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 次元场攻击力 : {value2}
    # REMOVE: data2 = [0, 8772, 10170, 11569, 12967, 14366, 15764, 17163, 18561, 19959, 21358, 22756, 24155, 25553, 26952, 28350, 29749, 31147, 32545, 33944, 35342, 36741, 38139, 39538, 40936, 42334, 43733, 45131, 46530, 47928, 49327, 50725, 52123, 53522, 54920, 56319, 57717, 59116, 60514, 61913, 63311, 64709, 66108, 67506, 68905, 70303, 71702, 73100, 74498, 75897, 77295, 78694, 80092, 81491, 82889, 84287, 85686, 87084, 88483, 89881, 91280, 92678, 94077, 95475, 96873, 98272, 99670, 101069, 102467, 103866, 105264]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 控制时间 : {value3}秒
    # REMOVE: data3 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 冲击波大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def getSkillCD(self, mode=None):
        self.cd = self.cds[self.lv]
        return super().getSkillCD(mode)

# 乖离 : 禁忌之奈雅丽
# mage_male/dimension_walker/7f80b887a09e88e2c4728c898bd73654
# a5ccbaf5538981c6ef99b236c0a60b73/7f80b887a09e88e2c4728c898bd73654
class Skill24(ActiveSkill):
    """
    消耗自身生命值， 从异界召唤奈雅丽。\n
    奈雅丽可以提升次元行者的独立攻击力； 奈雅丽可以自由移动， 并且可以代替自身施放部分技能。\n
    召唤奈雅丽的状态下， 次元行者施放转职技能命中敌人时， 减少奈雅丽的攻击冷却时间、 增加移动速度， 效果持续一定时间。\n
    该效果可以重叠， 达到重叠上限时， 奈雅丽的身上会出现红心效果。\n
    奈雅丽的攻击力与次元行者同步， 受[基础精通]和[乖离 : 虚无]的影响； 召唤奈雅丽的状态下， 若按下技能键， 则会解除召唤。
    """
    name = "乖离 : 禁忌之奈雅丽"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 7 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 90]
    uuid = "7f80b887a09e88e2c4728c898bd73654"
    hasVP = False
    hasUP = True

    # 召唤时生命值消耗 : {value0}
    # REMOVE: data0 = [0, 488, 547, 607, 666, 725, 784, 844, 903, 962, 1022, 1081]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 召唤持续时间 : {value1}秒
    # REMOVE: data1 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 近距离攻击力 : {value2}
    # REMOVE: data2 = [0, 720, 720, 720, 720, 720, 720, 720, 720, 720, 720, 720]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 远程攻击力 : {value3}
    # REMOVE: data3 = [0, 648, 648, 648, 648, 648, 648, 648, 648, 648, 648, 648]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 独立攻击力增加率 : {value4}%
    # REMOVE: data4 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # - [转职技能命中时附加效果] -
    # 奈雅丽攻击冷却时间减少率 : {value5}%
    # REMOVE: data5 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 奈雅丽移动速度增加率 : {value6}%
    # REMOVE: data6 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 持续时间 : {value7}秒
    # REMOVE: data7 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 重叠次数上限 : {value8}次
    # REMOVE: data8 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

    associate = [{"data":data4,"type":"$*PAtkI"}]

    def getSkillCD(self, mode=None):
        return 0.75

# 奈雅丽的茶歇时间
# mage_male/dimension_walker/e5c09f9132a48dc1d695968592cc5878
# a5ccbaf5538981c6ef99b236c0a60b73/e5c09f9132a48dc1d695968592cc5878
class Skill25(ActiveSkill):
    """
    奈雅丽停止攻击动作。 停止攻击动作的状态下可以施放技能。\n
    茶歇时间持续到再次施放为止。 持续期间， 增加次元行者的魔法值恢复量。\n
    决斗场中， 茶歇时间持续期间， 奈雅丽会逐渐恢复生命值。\n
    [我非常惊讶。 从异界来过来的人， 居然能泡出一杯这么好喝的茶……起码在这一点上， 我的研究是有价值的。 对了， 这是什么茶呢？]
    """
    name = "奈雅丽的茶歇时间"
    learnLv = 20
    masterLv = 1
    maxLv = 1
    position = 8 #TODO
    rangeLv = 2
    cd = 1
    uuid = "e5c09f9132a48dc1d695968592cc5878"
    hasVP = False
    hasUP = False

    # 角色每10秒魔法值恢复量增加 : 1%

# 次元 : 离子束
# mage_male/dimension_walker/d89f26862e348a801b30bb9fd7125db5
# a5ccbaf5538981c6ef99b236c0a60b73/d89f26862e348a801b30bb9fd7125db5
class Skill27(ActiveSkill):
    """
    开启次元之门， 从里面连续发射激光。\n
    [次元边界效果]\n
    压缩能量， 发射强力的激光。\n
    [选择或集中， 在任何情况下都适用。]
    """
    name = "次元 : 离子束"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 7
    mp = [35, 350]
    uuid = "d89f26862e348a801b30bb9fd7125db5"
    hasVP = False
    hasUP = True

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35, 35]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 激光攻击力 : {value1}
    # REMOVE: data1 = [0, 1756, 1934, 2112, 2290, 2469, 2647, 2825, 3003, 3181, 3359, 3537, 3716, 3894, 4072, 4250, 4428, 4606, 4784, 4963, 5141, 5319, 5497, 5675, 5853, 6031, 6210, 6388, 6566, 6744, 6922, 7100, 7278, 7457, 7635, 7813, 7991, 8169, 8347, 8526, 8704, 8882, 9060, 9238, 9416, 9594, 9773, 9951, 10129, 10307, 10485, 10663, 10841, 11020, 11198, 11376, 11554, 11732, 11910, 12088, 12267, 12445, 12623, 12801, 12979, 13157, 13335, 13514, 13692, 13870, 14048]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 6
    # [次元边界效果]
    # 边界能量增加量 : {value2}
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 压缩能量后的激光攻击力 : {value3}
    # REMOVE: data3 = [0, 13641, 15025, 16409, 17793, 19176, 20560, 21944, 23328, 24712, 26096, 27480, 28863, 30247, 31631, 33015, 34399, 35783, 37167, 38551, 39934, 41318, 42702, 44086, 45470, 46854, 48238, 49621, 51005, 52389, 53773, 55157, 56541, 57925, 59309, 60692, 62076, 63460, 64844, 66228, 67612, 68996, 70379, 71763, 73147, 74531, 75915, 77299, 78683, 80066, 81450, 82834, 84218, 85602, 86986, 88370, 89754, 91137, 92521, 93905, 95289, 96673, 98057, 99441, 100824, 102208, 103592, 104976, 106360, 107744, 109128]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 0
    # [范围信息]
    # 激光大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    mode = ["强化","普通"]

    def setMode(self, mode):
        if mode == "强化":
            self.hit1 = 6
            self.hit3 = 0
        elif mode == "普通":
            self.hit1 = 0
            self.hit3 = 1
# 时空壁障
# mage_male/dimension_walker/2c9d9a36c8401bddff6cdb80fab8dc24
# a5ccbaf5538981c6ef99b236c0a60b73/2c9d9a36c8401bddff6cdb80fab8dc24
class Skill28(ActiveSkill):
    """
    打破时空边界， 将异界的气息环绕在自身周围。\n
    增加基本攻击力、  次元系列技能和乖离系列技能的攻击力。
    """
    name = "时空壁障"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 4 #TODO
    rangeLv = 3
    cd = 5
    uuid = "2c9d9a36c8401bddff6cdb80fab8dc24"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基本攻击和技能攻击增加率 : {value1}%
    # REMOVE: data1 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 虚妄之火
# mage_male/dimension_walker/dde3b443bd5e61d90c34e5ee771e2c28
# a5ccbaf5538981c6ef99b236c0a60b73/dde3b443bd5e61d90c34e5ee771e2c28
class Skill29(PassiveSkill):
    """
    将[幽冥火]变更为[虚妄之火]。 \n
    删除发射功能， 火球持续时间变更为无限制。 并且增加更多的防御力。\n
    变更后的防御力增加量遵循[幽冥火]的数值。\n
    [偶然中发明的东西， 但是用上去还可以。]
    """
    name = "虚妄之火"
    learnLv = 25
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 2
    uuid = "dde3b443bd5e61d90c34e5ee771e2c28"
    hasVP = False
    hasUP = False


# 乖离 : 迷雾
# mage_male/dimension_walker/5892d1fa4462e561ac8f8d2c74892b0a
# a5ccbaf5538981c6ef99b236c0a60b73/5892d1fa4462e561ac8f8d2c74892b0a
class Skill30(ActiveSkill):
    """
    虚无变换为迷雾之怪向前方发射。\n
    迷雾之怪碰到敌人或障碍物时， 会附身到周围级别最高的敌人身上。\n
    [乖离 : 虚无]的基本攻击和次元系列技能对迷雾附身的敌人具有更高的伤害增幅效果。 (维持对周围其他敌人的基础伤害增幅效果)\n
    此外， 部分技能施放后会优先追踪并攻击被附着的敌人。\n
    附身到敌人身上时， 边界能量条上方会标记敌人。 若再次按技能键， 可以召回附身的迷雾之怪。\n
    学习[古史记忆]后， 一定距离内存在敌人时可以使用， 会飞向敌人并附着。\n
    在决斗场中， 附身时间有上限。\n
    [用起来还不错， 但是对健康不太好……尤其是装备信条装置的情况下。]
    """
    name = "乖离 : 迷雾"
    learnLv = 30
    masterLv = 1
    maxLv = 1
    position = 7 #TODO
    rangeLv = 2
    cd = 1
    uuid = "5892d1fa4462e561ac8f8d2c74892b0a"
    hasVP = False
    hasUP = False

    # 生命值消耗 : {value0}
    # REMOVE: data0 = [0, 93]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 在决斗场内， 迷雾附身时间上限 : 5秒
    # [范围信息]
    # 索敌范围 : {value1}px
    # REMOVE: data1 = [0, 250]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [学习古史记忆后]
    # 索敌距离 : {value2}px
    # REMOVE: data2 = [0, 600]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 索敌宽度 : {value3}px
    # REMOVE: data3 = [0, 125]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 索敌高度 : {value4}px
    # REMOVE: data4 = [0, 200]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 召回等待时间 : {value5}秒
    # REMOVE: data5 = [0, 0.3]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 次元 : 万花镜
# mage_male/dimension_walker/b89c9ab317bc0a443f6497b7cca2f6a8
# a5ccbaf5538981c6ef99b236c0a60b73/b89c9ab317bc0a443f6497b7cca2f6a8
class Skill31(ActiveSkill):
    """
    将次元的能量聚集到自身后， 冲刺到前方， 并给命中的敌人施展瞬间移动攻击。\n
    攻击过程中进入无敌状态， 被攻击的敌人会进入强制控制状态。\n
    可以利用上/下方向键改变冲刺方向。\n
    若有敌人被[乖离 : 迷雾]所附身， 则施放技能时， 无视距离直接瞬移到敌人身旁并展开攻击。\n
    [次元边界效果]\n
    攻击方式变更为， 投射自身的分身， 让分身代替本人攻击敌人。\n
    分身的攻击力比角色本身低。\n
    [将次元之力直接投射到人体……只有疯子才会这么做， 这样做实在是太疲惫了。]
    """
    name = "次元 : 万花镜"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 10
    mp = [180, 1512]
    uuid = "b89c9ab317bc0a443f6497b7cca2f6a8"
    hasVP = False
    hasUP = True

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 乱打攻击力 : {value1}
    # REMOVE: data1 = [0, 4889, 5385, 5881, 6377, 6873, 7369, 7865, 8361, 8857, 9353, 9849, 10345, 10841, 11337, 11833, 12329, 12825, 13321, 13817, 14313, 14809, 15305, 15801, 16297, 16793, 17289, 17785, 18281, 18777, 19273, 19768, 20264, 20760, 21256, 21752, 22248, 22744, 23240, 23736, 24232, 24728, 25224, 25720, 26216, 26712, 27208, 27704, 28200, 28696, 29192, 29688, 30184, 30680, 31176, 31672, 32168, 32664, 33160, 33656, 34152, 34648, 35144, 35640, 36136, 36632, 37128, 37624, 38120, 38616, 39112]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 4
    # [次元边界效果]
    # 边界能量增加量 : {value2}
    # REMOVE: data2 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 下乱打攻击力 : {value3}
    # REMOVE: data3 = [0, 3925, 4323, 4721, 5120, 5518, 5916, 6314, 6712, 7111, 7509, 7907, 8305, 8703, 9101, 9500, 9898, 10296, 10694, 11092, 11491, 11889, 12287, 12685, 13083, 13482, 13880, 14278, 14676, 15074, 15472, 15871, 16269, 16667, 17065, 17463, 17862, 18260, 18658, 19056, 19454, 19853, 20251, 20649, 21047, 21445, 21843, 22242, 22640, 23038, 23436, 23834, 24233, 24631, 25029, 25427, 25825, 26224, 26622, 27020, 27418, 27816, 28214, 28613, 29011, 29409, 29807, 30205, 30604, 31002, 31400]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 4
    # [范围信息]
    # 冲击波大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    mode = ["普通","强化"]

    def setMode(self, mode):
        if mode == "强化":
            self.hit1 = 0
            self.hit3 = 4
        elif mode == "普通":
            self.hit1 = 4
            self.hit3 = 0


# 乖离 : 魅魔之舞
# mage_male/dimension_walker/0fbb8de70002ad34f046c94c2cb3e863
# a5ccbaf5538981c6ef99b236c0a60b73/0fbb8de70002ad34f046c94c2cb3e863
class Skill32(ActiveSkill):
    """
    奈雅丽瞬间移动到角色位置， 然后向前方突进并鞭笞遇到的敌人。\n
    若按向下方向键， 则会在原地攻击敌人。\n
    若有敌人被[乖离 : 迷雾]所附身， 则瞬移到敌人身旁并展开攻击。(决斗场中不适用)\n
    [看到她鞭笞别人时那欢快的样子， 我再忙也要抽出时间陪她玩。]
    """
    name = "乖离 : 魅魔之舞"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 10
    mp = [185, 1526]
    uuid = "0fbb8de70002ad34f046c94c2cb3e863"
    hasVP = False
    hasUP = True

    # 乱打攻击次数 : {value0}次
    # REMOVE: data0 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 乱打攻击力 : {value1}
    # REMOVE: data1 = [0, 559, 616, 672, 729, 786, 843, 899, 956, 1013, 1069, 1126, 1183, 1240, 1296, 1353, 1410, 1466, 1523, 1580, 1637, 1693, 1750, 1807, 1864, 1920, 1977, 2034, 2090, 2147, 2204, 2261, 2317, 2374, 2431, 2487, 2544, 2601, 2658, 2714, 2771, 2828, 2884, 2941, 2998, 3055, 3111, 3168, 3225, 3281, 3338, 3395, 3452, 3508, 3565, 3622, 3678, 3735, 3792, 3849, 3905, 3962, 4019, 4075, 4132, 4189, 4246, 4302, 4359, 4416, 4472]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 15
    # 最终一击攻击力 : {value2}
    # REMOVE: data2 = [0, 9563, 10533, 11504, 12474, 13444, 14414, 15384, 16355, 17325, 18295, 19265, 20235, 21205, 22176, 23146, 24116, 25086, 26056, 27027, 27997, 28967, 29937, 30907, 31877, 32848, 33818, 34788, 35758, 36728, 37699, 38669, 39639, 40609, 41579, 42549, 43520, 44490, 45460, 46430, 47400, 48371, 49341, 50311, 51281, 52251, 53221, 54192, 55162, 56132, 57102, 58072, 59043, 60013, 60983, 61953, 62923, 63893, 64864, 65834, 66804, 67774, 68744, 69715, 70685, 71655, 72625, 73595, 74565, 75536, 76506]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1

# 次元 : 粒子风暴
# mage_male/dimension_walker/7cf17936a039b418660424125dc968d7
# a5ccbaf5538981c6ef99b236c0a60b73/7cf17936a039b418660424125dc968d7
class Skill33(ActiveSkill):
    """
    扭曲空间引发多次爆炸。 \n
    施放时， 利用方向键可以在前方更远处引发爆炸。\n
    [次元边界效果]\n
    增加爆炸倒计时， 但威力更高。 该魔法球无法增加边界能量条。\n
    [稍微调整了数值， 但结果完全不同啊。]
    """
    name = "次元 : 粒子风暴"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 16
    mp = [185, 1526]
    uuid = "7cf17936a039b418660424125dc968d7"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 边界能量增加量 : {value0}
    # REMOVE: data0 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 基础施放距离 : {value1}px
    # REMOVE: data1 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 使用方向键时施放距离 : {value2}px
    # REMOVE: data2 = [0, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300, 300]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 攻击力 : {value3}
    # REMOVE: data3 = [0, 7160, 7887, 8613, 9339, 10066, 10792, 11518, 12245, 12971, 13698, 14424, 15150, 15877, 16603, 17330, 18056, 18782, 19509, 20235, 20962, 21688, 22414, 23141, 23867, 24594, 25320, 26046, 26773, 27499, 28226, 28952, 29678, 30405, 31131, 31857, 32584, 33310, 34037, 34763, 35489, 36216, 36942, 37669, 38395, 39121, 39848, 40574, 41301, 42027, 42753, 43480, 44206, 44933, 45659, 46385, 47112, 47838, 48564, 49291, 50017, 50744, 51470, 52196, 52923, 53649, 54376, 55102, 55828, 56555, 57281]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 3
    # [次元边界效果]
    # 边界能量条增加量 : {value4}
    # REMOVE: data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 爆炸倒计时 : {value5}秒
    # REMOVE: data5 = [0, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5, 0.5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 攻击力 : {value6}
    # REMOVE: data6 = [0, 27416, 30197, 32979, 35760, 38541, 41323, 44104, 46885, 49667, 52448, 55229, 58011, 60792, 63573, 66355, 69136, 71917, 74699, 77480, 80261, 83043, 85824, 88605, 91387, 94168, 96949, 99731, 102512, 105293, 108075, 110856, 113637, 116419, 119200, 121981, 124763, 127544, 130325, 133107, 135888, 138669, 141451, 144232, 147013, 149795, 152576, 155357, 158139, 160920, 163701, 166483, 169264, 172045, 174827, 177608, 180389, 183171, 185952, 188733, 191515, 194296, 197077, 199859, 202640, 205421, 208203, 210984, 213765, 216547, 219328]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    hit6 = 1
    # [范围信息]
    # 冲击波大小比率 : {value7}%
    # REMOVE: data7 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)

    mode = ["普通","强化"]

    def setMode(self, mode):
        if mode == "强化":
            self.hit3 = 0
            self.hit6 = 1
        elif mode == "普通":
            self.hit3 = 3
            self.hit6 = 0

    def vp_1(self):
        """
        [次元 : 粒子风暴]\n
        在前方连续快速生成多个次元爆炸\n
        - 不消耗次元石， 固定以次元边界效果发动\n
        - 对领域内的敌人造成相同的连锁伤害\n
        - 爆炸速度增加\n
        - 总攻击力相同\n
        [分散， 反而能发挥更大的威力。]
        """
        self.setMode("强化")
        ...

    def vp_2(self):
        """
        [次元 : 粒子风暴]\n
        使用次元系列技能时可以施放\n
        若存在被[乖离 : 迷雾]附身的敌人， 则扭曲该位置\n
        [可以说是省略了坐标系。]
        """
        ...

# 次元 : 时空磁场
# mage_male/dimension_walker/3fb8395ae3b81bd608e0c4223a8eb534
# a5ccbaf5538981c6ef99b236c0a60b73/3fb8395ae3b81bd608e0c4223a8eb534
class Skill34(ActiveSkill):
    """
    以自身为中心展开次元场。\n
    被命中的敌人会受到次元扭曲效果， 此时若按下技能键， 则可以将所有处于次元扭曲效果的敌人聚集到一点并额外造成伤害。\n
    使用次元系技能攻击次元扭曲状态下的敌人时， 可以恢复更多的边界能量条； 次元扭曲造成额外伤害后， 次元扭曲依然持续一段时间。\n
    [次元边界效果]\n
    次元扭曲造成额外伤害后， 使敌人进入束缚状态。\n
    [很多人觉得瞬移很方便， 我这是专门为那些人研发的魔法术式……请你们不要骂我……]
    """
    name = "次元 : 时空磁场"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 14
    mp = [160, 1344]
    uuid = "3fb8395ae3b81bd608e0c4223a8eb534"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击力 : {value1}
    # REMOVE: data1 = [0, 9240, 10177, 11115, 12052, 12990, 13927, 14864, 15802, 16739, 17677, 18614, 19551, 20489, 21426, 22363, 23301, 24238, 25176, 26113, 27050, 27988, 28925, 29863, 30800, 31737, 32675, 33612, 34550, 35487, 36424, 37362, 38299, 39237, 40174, 41111, 42049, 42986, 43923, 44861, 45798, 46736, 47673, 48610, 49548, 50485, 51423, 52360, 53297, 54235, 55172, 56110, 57047, 57984, 58922, 59859, 60797, 61734, 62671, 63609, 64546, 65483, 66421, 67358, 68296, 69233, 70170, 71108, 72045, 72983, 73920]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 2
    # 次元扭曲持续时间 : {value2}秒
    # REMOVE: data2 = [0, 5, 5.1, 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9, 6, 6.1, 6.2, 6.3, 6.4, 6.5, 6.6, 6.7, 6.8, 6.9, 7, 7.1, 7.2, 7.3, 7.4, 7.5, 7.6, 7.7, 7.8, 7.9, 8, 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7, 8.8, 8.9, 9, 9.1, 9.2, 9.3, 9.4, 9.5, 9.6, 9.7, 9.8, 9.9, 10, 10.1, 10.2, 10.3, 10.4, 10.5, 10.6, 10.7, 10.8, 10.9, 11, 11.1, 11.2, 11.3, 11.4, 11.5, 11.6, 11.7, 11.8, 11.9]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 边界能量条额外增加率 : {value3}%
    # REMOVE: data3 = [0, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35, 35.5, 36, 36.5, 37, 37.5, 38, 38.5, 39, 39.5, 40, 40.5, 41, 41.5, 42]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [次元边界效果]
    # 次元边界能量条增加量 : {value4}
    # REMOVE: data4 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 束缚持续时间 : {value5}秒
    # REMOVE: data5 = [0, 2.5, 2.6, 2.7, 2.8, 2.9, 3, 3.1, 3.2, 3.3, 3.4, 3.5, 3.6, 3.7, 3.8, 3.9, 4, 4.1, 4.2, 4.3, 4.4, 4.5, 4.6, 4.7, 4.8, 4.9, 5, 5.1, 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9, 6, 6.1, 6.2, 6.3, 6.4, 6.5, 6.6, 6.7, 6.8, 6.9, 7, 7.1, 7.2, 7.3, 7.4, 7.5, 7.6, 7.7, 7.8, 7.9, 8, 8.1, 8.2, 8.3, 8.4, 8.5, 8.6, 8.7, 8.8, 8.9, 9, 9.1, 9.2, 9.3, 9.4]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value6}%
    # REMOVE: data6 = [0, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108, 108]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [次元 : 时空磁场]\n
        若奈雅丽已经被召唤出来， 则以奈雅丽的位置为中心展开次元场\n
        再次按技能键时， 与奈雅丽调换位置并回收次元场\n
        - 不会移动敌人\n
        - 移动后3秒内所受伤害 -90%\n
        [替换坐标， 就是调换位置。 不过， 想要换谁， 也得先问问奈雅丽同不同意。]
        """
        ...

    def vp_2(self):
        """
        [次元 : 时空磁场]\n
        无法再次按技能键\n
        生成次元场时， 以被击中的敌人为中心， 次元场会再次展开， 造成相同伤害\n
        发动[次元边界]时的效果变更\n
        - 范围 +15%\n
        - 次元场命中时， 使敌人进入束缚状态\n
        [要是不躲开， 那就等着再挨一次吧。]
        """
        ...

# 乖离 : 异界蜂群
# mage_male/dimension_walker/c5a2956d8ed3af1746ed2f76ca971a09
# a5ccbaf5538981c6ef99b236c0a60b73/c5a2956d8ed3af1746ed2f76ca971a09
class Skill35(ActiveSkill):
    """
    消耗自身生命值， 从异次元裂缝召唤异界蜂群攻击敌人。 受到攻击的敌人进入减速状态， 以及受到持续的伤害， 效果持续一定时间。\n
    给敌人造成持续伤害的同时， 恢复角色生命值。\n
    在决斗场中， 减速效果不生效。\n
    [我不是很乐意将奈雅丽的朋友们介绍给别人， 但也要看具体情况。]
    """
    name = "乖离 : 异界蜂群"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [350, 3080]
    uuid = "c5a2956d8ed3af1746ed2f76ca971a09"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 生命值消耗 : {value0}
    # REMOVE: data0 = [0, 100, 130, 160, 190, 220, 250, 280, 310, 340, 370, 400, 430, 460, 490, 520, 550, 580, 610, 640, 670, 700, 730, 760, 790, 820, 850, 880, 910, 940, 970, 1000, 1030, 1060, 1090, 1120, 1150, 1180, 1210, 1240, 1270, 1300, 1330, 1360, 1390, 1420, 1450, 1480, 1510, 1540, 1570, 1600, 1630, 1660, 1690, 1720, 1750, 1780, 1810, 1840, 1870, 1900, 1930, 1960, 1990, 2020, 2050, 2080, 2110, 2140, 2170]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 召唤数量 : {value1}只
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 打击攻击力 : {value2}
    # REMOVE: data2 = [0, 1707, 1880, 2053, 2226, 2399, 2572, 2746, 2919, 3092, 3265, 3438, 3611, 3784, 3957, 4131, 4304, 4477, 4650, 4823, 4996, 5169, 5343, 5516, 5689, 5862, 6035, 6208, 6381, 6555, 6728, 6901, 7074, 7247, 7420, 7593, 7767, 7940, 8113, 8286, 8459, 8632, 8805, 8979, 9152, 9325, 9498, 9671, 9844, 10017, 10191, 10364, 10537, 10710, 10883, 11056, 11229, 11402, 11576, 11749, 11922, 12095, 12268, 12441, 12614, 12788, 12961, 13134, 13307, 13480, 13653]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 20
    # 每秒持续攻击力 : {value3}
    # REMOVE: data3 = [0, 363, 400, 437, 474, 510, 547, 584, 621, 658, 695, 732, 768, 805, 842, 879, 916, 953, 989, 1026, 1063, 1100, 1137, 1174, 1210, 1247, 1284, 1321, 1358, 1395, 1431, 1468, 1505, 1542, 1579, 1616, 1652, 1689, 1726, 1763, 1800, 1837, 1873, 1910, 1947, 1984, 2021, 2058, 2095, 2131, 2168, 2205, 2242, 2279, 2316, 2352, 2389, 2426, 2463, 2500, 2537, 2573, 2610, 2647, 2684, 2721, 2758, 2794, 2831, 2868, 2905]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 6
    # 持续攻击时间 : {value4}秒
    # REMOVE: data4 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 减速持续时间 : {value5}秒
    # REMOVE: data5 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 生命值恢复量 : {value6}
    # REMOVE: data6 = [0, 90, 95, 100, 105, 110, 115, 120, 125, 130, 135, 140, 145, 150, 155, 160, 165, 170, 175, 180, 185, 190, 195, 200, 205, 210, 215, 220, 225, 230, 235, 240, 245, 250, 255, 260, 265, 270, 275, 280, 285, 290, 295, 300, 305, 310, 315, 320, 325, 330, 335, 340, 345, 350, 355, 360, 365, 370, 375, 380, 385, 390, 395, 400, 405, 410, 415, 420, 425, 430, 435]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # [范围信息]
    # 突进距离 : {value7}px
    # REMOVE: data7 = [0, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000, 1000]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    # 蜂群大小比率 : {value8}%
    # REMOVE: data8 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)

    def vp_1(self):
        """
        [乖离 : 异界蜂群]\n
        奈雅丽在地图上时， 奈雅丽代替施放者发动技能 (不消耗生命值)\n
        蜂群最初登场时间 -0.5秒\n
        每次生命值恢复时， 额外恢复当前生命值的2%\n
        [偶尔交给奈雅丽来处理， 也不错呢。]
        """
        ...

    def vp_2(self):
        """
        [乖离 : 异界蜂群]\n
        若不存在被[乖离 : 迷雾]附身的敌人， 则无法施放\n
        被[乖离 : 迷雾]附身的敌人被撕裂， 异界蜂群从中出现\n
        - 蜂群登场间隔 -50%\n
        - 蜂群突进距离 -50%\n
        - 蜂群大小 -25%\n
        [既然奈雅丽坚持要它们来， 那就改变召唤术， 按照它们的方式来邀请吧……我好像听到远方传来了欢呼声。]
        """
        ...

# 次元 : 粒子波
# mage_male/dimension_walker/e0a072e8cef2d77893aad5f68aeed56a
# a5ccbaf5538981c6ef99b236c0a60b73/e0a072e8cef2d77893aad5f68aeed56a
class Skill36(ActiveSkill):
    """
    开启异次元裂缝， 发射强力的粒子炮。\n
    [次元边界效果]\n
    在角色前方设置异次元裂缝， 替自身发射粒子炮。\n
    [开启3个裂缝比起2个裂缝有本质上的区别， 所以万一开启失败也不要嘲笑我， 尤其是你， 奈雅丽。]
    """
    name = "次元 : 粒子波"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [350, 3080]
    uuid = "e0a072e8cef2d77893aad5f68aeed56a"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 粒子炮攻击力 : {value1}  x {value2}
    # REMOVE: data1 = [0, 5968, 6573, 7179, 7784, 8390, 8995, 9601, 10206, 10812, 11417, 12022, 12628, 13233, 13839, 14444, 15050, 15655, 16261, 16866, 17472, 18077, 18682, 19288, 19893, 20499, 21104, 21710, 22315, 22921, 23526, 24131, 24737, 25342, 25948, 26553, 27159, 27764, 28370, 28975, 29581, 30186, 30791, 31397, 32002, 32608, 33213, 33819, 34424, 35030, 35635, 36240, 36846, 37451, 38057, 38662, 39268, 39873, 40479, 41084, 41690, 42295, 42900, 43506, 44111, 44717, 45322, 45928, 46533, 47139, 47744]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 10
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [次元边界效果]
    # 边界能量增加量 : {value3}
    # REMOVE: data3 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 粒子炮攻击力 : {value4}  x {value5}
    # REMOVE: data4 = [0, 5242, 5774, 6306, 6838, 7370, 7901, 8433, 8965, 9497, 10029, 10561, 11092, 11624, 12156, 12688, 13220, 13752, 14283, 14815, 15347, 15879, 16411, 16942, 17474, 18006, 18538, 19070, 19602, 20133, 20665, 21197, 21729, 22261, 22793, 23324, 23856, 24388, 24920, 25452, 25984, 26515, 27047, 27579, 28111, 28643, 29174, 29706, 30238, 30770, 31302, 31834, 32365, 32897, 33429, 33961, 34493, 35025, 35556, 36088, 36620, 37152, 37684, 38216, 38747, 39279, 39811, 40343, 40875, 41407, 41938]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 20
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 中心范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    mode = ["强化","普通"]

    def setMode(self, mode):
        if mode == "强化":
            self.hit1 = 10
            self.hit4 = 0
        elif mode == "普通":
            self.hit1 = 0
            self.hit4 = 1


    def vp_1(self):
        """
        [次元 : 粒子波]\n
        施放时， 生成重力场， 将敌人吸附到中心位置\n
        若[次元 : 粒子风暴]为可施放的状态， 则维持重力场\n
        - 同时消耗[次元 : 粒子风暴]的冷却时间 (不额外消耗次元石)\n
        - 粒子炮结束时爆炸\n
        - 攻击力 : [次元 : 粒子风暴]次元边界效果攻击力的100%\n
        [开启多个次元之缝时， 中心位置容易出现强大的扭曲现象。 只要利用那一点点缝隙……]
        """
        ...

    def vp_2(self):
        """
        [次元 : 粒子波]\n
        分身化形出实体， 从各个次元裂缝中发射压缩的粒子炮\n
        - 多段攻击次数 -50%\n
        - 多段攻击结束后， 在中心发生强力爆炸\n
        - 总攻击力相同\n
        - 普通施放时， 可强制中断施放后僵直并施放次元系列技能\n
        以次元边界效果发动时， 边界能量恢复量变为100\n
        [如果大家都各自只开启一个次元裂缝呢？ 前提是， 其他次元的我也点头同意。]
        """
        ...

# 虚空之力
# mage_male/dimension_walker/2a0a39184de92acf1c1375e00b77404c
# a5ccbaf5538981c6ef99b236c0a60b73/2a0a39184de92acf1c1375e00b77404c
class Skill37(PassiveSkill):
    """
    边界能量条的波动数变更为最少1个、 最多3个。\n
    魔法暴击率和暴击伤害按波动数成比例增加。\n
    施放[次元边界]时， 有一定几率不消耗次元石， 此时角色上方会出现紫色图标。\n
    - [次元之乖离扫把精通]附加效果 -\n
    在装备扫把的状态下进入地下城或死亡后复活时， 增加1个波动数。\n
    [没有任何事情比不确定更加确定。]
    """
    name = "虚空之力"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 1 #TODO
    rangeLv = 3
    uuid = "2a0a39184de92acf1c1375e00b77404c"
    hasVP = False
    hasUP = False

    # 不消耗次元石的几率 : {value0}%
    # REMOVE: data0 = [0, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [1个波动次数]
    # 魔法暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 3.6, 3.8, 4, 4.2, 4.4, 4.6, 4.8, 5, 5.2, 5.4, 5.6, 5.8, 6, 6.2, 6.4, 6.6, 6.8, 7, 7.2, 7.4, 7.6, 7.8, 8, 8.2, 8.4, 8.6, 8.8, 9, 9.2, 9.4, 9.6, 9.8, 10, 10.2, 10.4, 10.6, 10.8, 11, 11.2, 11.4, 11.6, 11.8, 12, 12.2, 12.4, 12.6, 12.8, 13, 13.2, 13.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 暴击伤害增加率 : {value2}%
    # REMOVE: data2 = [0, 1.5, 2.8, 4.1, 5.4, 6.7, 8, 9.3, 10.6, 11.9, 13.2, 14.5, 15.8, 17.1, 18.4, 19.7, 21, 22.3, 23.6, 24.9, 26.2, 27.5, 28.8, 30.1, 31.4, 32.7, 34, 35.3, 36.6, 37.9, 39.2, 40.5, 41.8, 43.1, 44.4, 45.7, 47, 48.3, 49.6, 50.9, 52.2, 53.5, 54.8, 56.1, 57.4, 58.7, 60, 61.3, 62.6, 63.9, 65.2]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [2个波动次数]
    # 魔法暴击率增加 : {value3}%
    # REMOVE: data3 = [0, 4.8, 5.2, 5.5, 5.9, 6.2, 6.6, 6.9, 7.3, 7.6, 8, 8.3, 8.7, 9, 9.4, 9.7, 10.1, 10.4, 10.8, 11.1, 11.5, 11.8, 12.2, 12.5, 12.9, 13.2, 13.6, 13.9, 14.3, 14.6, 15, 15.3, 15.7, 16, 16.4, 16.7, 17.1, 17.4, 17.8, 18.1, 18.5, 18.8, 19.2, 19.5, 19.9, 20.2, 20.6, 20.9, 21.3, 21.6, 22]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 暴击伤害增加率 : {value4}%
    # REMOVE: data4 = [0, 3, 4.7, 6.3, 8, 9.6, 11.3, 12.9, 14.6, 16.2, 17.9, 19.5, 21.2, 22.8, 24.5, 26.1, 27.8, 29.4, 31.1, 32.7, 34.4, 36, 37.7, 39.3, 41, 42.6, 44.3, 45.9, 47.6, 49.2, 50.9, 52.5, 54.2, 55.8, 57.5, 59.1, 60.8, 62.4, 64.1, 65.7, 67.4, 69, 70.7, 72.3, 74, 75.6, 77.3, 78.9, 80.6, 82.2, 83.9]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [3个波动次数]
    # 魔法暴击率增加 : {value5}%
    # REMOVE: data5 = [0, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # 暴击伤害增加率 : {value6}%
    # REMOVE: data6 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    associate = [{"data":data6}]

# 乖离 : 扭曲之恐惧
# mage_male/dimension_walker/9dc8438e4572d39243c97da31c113acc
# a5ccbaf5538981c6ef99b236c0a60b73/9dc8438e4572d39243c97da31c113acc
class Skill38(ActiveSkill):
    """
    开启异次元裂缝， 强制召唤某不知名怪物的片鳞只甲。\n
    怪物利用触手攻击后引发次元爆炸。\n
    召唤时会增加2个边界能量条的波动次数。\n
    [经常与怪物战斗的人， 需要警惕自己也变成怪物。 如果你长时间关注深渊， 你会发现深渊也有东西在关注你……]
    """
    name = "乖离 : 扭曲之恐惧"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [1200, 10080]
    uuid = "9dc8438e4572d39243c97da31c113acc"
    hasVP = False
    hasUP = False

    # 怪物出现时攻击力 : {value0}
    # REMOVE: data0 = [0, 10303, 12692, 15081, 17470, 19860, 22249, 24638, 27027, 29416, 31805, 34194, 36583, 38973, 41362, 43751, 46140, 48529, 50918, 53307, 55696, 58086, 60475, 62864, 65253, 67642, 70031, 72420, 74809, 77199, 79588, 81977, 84366, 86755, 89144, 91533, 93922, 96312, 98701, 101090, 103479, 105868, 108257, 110646, 113035, 115425, 117814, 120203, 122592, 124981, 127370]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    hit0 = 1
    # 触须攻击力 : {value1}
    # REMOVE: data1 = [0, 2240, 2759, 3279, 3798, 4317, 4837, 5356, 5875, 6395, 6914, 7434, 7953, 8472, 8992, 9511, 10030, 10550, 11069, 11589, 12108, 12627, 13147, 13666, 14185, 14705, 15224, 15744, 16263, 16782, 17302, 17821, 18340, 18860, 19379, 19899, 20418, 20937, 21457, 21976, 22495, 23015, 23534, 24054, 24573, 25092, 25612, 26131, 26650, 27170, 27689]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 23
    # 爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 45334, 55846, 66358, 76870, 87382, 97894, 108407, 118919, 129431, 139943, 150455, 160967, 171479, 181992, 192504, 203016, 213528, 224040, 234552, 245064, 255577, 266089, 276601, 287113, 297625, 308137, 318649, 329162, 339674, 350186, 360698, 371210, 381722, 392235, 402747, 413259, 423771, 434283, 444795, 455307, 465820, 476332, 486844, 497356, 507868, 518380, 528892, 539405, 549917, 560429]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 次元石获得量 : {value3}个
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 次元 : 思维聚爆
# mage_male/dimension_walker/e0daa922b19cdc35de879e938361464e
# a5ccbaf5538981c6ef99b236c0a60b73/e0daa922b19cdc35de879e938361464e
class Skill39(ActiveSkill):
    """
    在被[乖离 : 迷雾]附身的敌人身边引发强力的异次元崩塌， 造成持续的伤害后爆炸。\n
    - [次元边界效果] -\n
    被击中的敌人会进入强制控制状态。 攻击过程中次元行者进入无敌状态。\n
    [说白了就是一直重复开关非常脆弱的玻璃门。]
    """
    name = "次元 : 思维聚爆"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [400, 1120]
    uuid = "e0daa922b19cdc35de879e938361464e"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 边界能量增加量 : {value0}
    # REMOVE: data0 = [0, 100, 103, 106, 109, 112, 115, 118, 121, 124, 127, 130, 133, 136, 139, 142, 145, 148, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 持续攻击力 : {value1}
    # REMOVE: data1 = [0, 1342, 1478, 1614, 1751, 1887, 2023, 2159, 2295, 2431, 2568, 2704, 2840, 2976, 3112, 3248, 3384, 3521, 3657, 3793, 3929, 4065, 4201, 4338, 4474, 4610, 4746, 4882, 5018, 5155, 5291, 5427, 5563, 5699, 5835, 5971, 6108, 6244, 6380, 6516, 6652, 6788, 6925, 7061, 7197, 7333, 7469, 7605, 7742, 7878, 8014]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 12
    # 最后爆炸攻击力 : {value2}
    # REMOVE: data2 = [0, 43324, 47720, 52115, 56510, 60905, 65301, 69696, 74091, 78486, 82882, 87277, 91672, 96067, 100463, 104858, 109253, 113648, 118043, 122439, 126834, 131229, 135624, 140020, 144415, 148810, 153205, 157601, 161996, 166391, 170786, 175182, 179577, 183972, 188367, 192762, 197158, 201553, 205948, 210343, 214739, 219134, 223529, 227924, 232320, 236715, 241110, 245505, 249901, 254296, 258691]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # [次元边界效果]
    # 边界能量增加量 : {value3}
    # REMOVE: data3 = [0, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 最后爆炸大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    mode = ["瞬爆","打满"]

    def setMode(self, mode):
        if mode == "瞬爆":
            self.hit1 = 1

    def vp_1(self):
        """
        [次元 : 思维聚爆]\n
        没有敌人被[乖离 : 迷雾]附身的状态下也可以施放该技能 (在前方250px处发动)\n
        施放过程中可以发动[次元边界]效果， 且不消耗次元石\n
        异次元崩塌的最后阶段变得更加强烈\n
        - 总攻击力相同\n
        - 最后爆炸范围 +40%\n
        [只要稍微碰一下， 它马上就会碎掉。]
        """
        ...

    def vp_2(self):
        """
        [次元 : 思维聚爆]\n
        异次元崩塌， 持续吸附次元附近的敌人\n
        - 普通施放时， 大幅增加吸附范围， 施放过程中所受伤害减少90%\n
        发动[次元边界]效果时， 异次元崩塌开始后角色可以行动\n
        - 异次元崩塌自行维持一段时间后爆炸\n
        - 无法通过跳跃键延迟发动终结攻击\n
        [要是想让它发挥威力， 就别急着关上。 不过， 要是差不多了， 就该赶紧收手。]
        """
        ...

# 乖离 : 禁锢
# mage_male/dimension_walker/5806440d21e7546d50007a5ba11f8024
# a5ccbaf5538981c6ef99b236c0a60b73/5806440d21e7546d50007a5ba11f8024
class Skill40(ActiveSkill):
    """
    奈雅丽瞬移到角色后方后， 将魔力聚集到鞭子上向前刺击。\n
    成功命中时， 奈雅丽抓取敌人并持续一段时间。\n
    [能把敌人彻底击穿这一点倒是不错， 但为什么他们第二天会对我露出笑容？]
    """
    name = "乖离 : 禁锢"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 2
    cube = 3
    cd = 50
    mp = [900, 1820]
    uuid = "5806440d21e7546d50007a5ba11f8024"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 束缚时间 : {value0}秒
    # REMOVE: data0 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 刺击攻击力 : {value1}
    # REMOVE: data1 = [0, 87126, 95965, 104804, 113643, 122481, 131320, 140159, 148998, 157837, 166676, 175515, 184354, 193192, 202031, 210870, 219709, 228548, 237387, 246226, 255065, 263903, 272742, 281581, 290420, 299259, 308098, 316937, 325775, 334614, 343453, 352292, 361131, 369970, 378809, 387648, 396486, 405325, 414164, 423003, 431842, 440681, 449520, 458359, 467197, 476036, 484875, 493714, 502553, 511392, 520231]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # [范围信息]
    # 刺击距离比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def effect(self, old, new):
        if self.vp == 1:
            self.associate = [{"type":"*skillRation","data":[0] + [-14]*self.maxLv,"skills":["乖离 : 魅魔之舞"]}]
        return super().effect(old, new)

    def vp_1(self):
        """
        [乖离 : 禁锢]\n
        [乖离 : 禁锢]命中时， 初始化[乖离 : 魅魔之舞]的冷却时间\n
        [乖离 : 禁锢]命中后， 强制中断并施放其他奈雅丽技能时， 束缚效果不消失\n
        [乖离 : 魅魔之舞]\n
        攻击力 -14%\n
        分身代替奈雅丽施放[乖离 : 魅魔之舞]\n
        [光是本尊就够难应付了， 连分身都一起捣乱……这种场面， 实在令人百感交集。]
        """
        ...

    def vp_2(self):
        """
        [乖离 : 禁锢]\n
        奈雅丽瞬间显现自身的部分力量攻击敌人\n
        施放后， 奈雅丽将回收的力量变换为不规则多面体送给次元行者\n
        - 次元石 +1个\n
        - 边界能量条的波动数变更为最大值\n
        [曾经问过奈雅丽关于她真身的事情……但她只是一直笑着， 没有回答。]
        """
        ...

# 混沌源能石
# mage_male/dimension_walker/5c45f69c9ebc7a784e994369d2cc3c66
# a5ccbaf5538981c6ef99b236c0a60b73/5c45f69c9ebc7a784e994369d2cc3c66
class Skill41(PassiveSkill):
    """
    奈雅丽给的神秘宝石， 部分技能的效果会增加或变更。\n
     [超然感知]\n
    -增加次元石持有量上限\n
    -进入地下城或复活时， 可以获得一定数量的次元石\n
    -根据边界能量条的波动次数增加技能攻击力。\n
    [乖离 : 迷雾]\n
    -不消耗生命值\n
    -无需发动动作即可施放\n
    -除了跳跃和被击状态， 其他状态下都可以发射迷雾。\n
    [乖离 : 禁忌之奈雅丽]\n
    转职系列技能命中敌人时， 增加奈雅丽的攻击速度。\n
       [冒着死亡的危险接收了这块异界宝石。 奈雅丽说为了方便我使用， 只提取了原宝石的一部分， 并进行了改进。 如果这只是一部分， 那原始的宝石该有多强大？]
    """
    name = "混沌源能石"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 1 #TODO
    rangeLv = 3
    uuid = "5c45f69c9ebc7a784e994369d2cc3c66"
    hasVP = False
    hasUP = False

    # 进入地下城时获得的次元石数量 : {value0}
    # REMOVE: data0 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 次元石持有量上限增加 : {value1}
    # REMOVE: data1 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 1个波动次数时攻击力增加量 : {value2}%
    # REMOVE: data2 = [0, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 2个波动次数时攻击力增加量 : {value3}%
    # REMOVE: data3 = [0, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 3个波动次数时攻击力增加量 : {value4}%
    # REMOVE: data4 = [0, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 转职技能命中敌人时， 奈雅丽攻击速度增加量 : {value5}%
    # REMOVE: data5 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    associate = [{"data":data4}]

# 次元 : 奇点
# mage_male/dimension_walker/4402c6977bf5c9b0d2febe14dc81de6c
# a5ccbaf5538981c6ef99b236c0a60b73/4402c6977bf5c9b0d2febe14dc81de6c
class Skill42(ActiveSkill):
    """
    操纵异次元领域， 生成特殊的能量地带， 然后将敌人吸附到能量地带并连续抛出。\n
    撞到地面冲击波对不可抓取的敌人造成更大伤害。\n
    若能量地带只存在无法抓取的敌人时， 则将异次元之力汇聚到能量地带中， 生成异次元水晶并攻击周围的敌人。\n
    对无法抓取的敌人不适用控制效果。\n
    [次元边界效果]\n
    在自身周围较大的范围内生成水晶地带攻击敌人。\n
    [根据奈雅丽提点的公式勉强完成了这个魔法术式， 但是过于复杂， 好像没法应用到其他术式中。 稍有不慎， 自己就有可能被吸进能量地带， 或者变成水晶……奈雅丽应该不会是想让我变成那样吧？] 
    """
    name = "次元 : 奇点"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "4402c6977bf5c9b0d2febe14dc81de6c"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被抓取敌人撞击墙壁时冲击波攻击力 : {value1}
    # REMOVE: data1 = [0, 14298, 15748, 17199, 18649, 20100, 21550, 23001, 24451, 25902, 27352, 28803, 30253, 31704, 33154, 34605, 36055, 37506, 38956, 40407, 41857, 43308, 44758, 46208, 47659, 49109, 50560, 52010, 53461, 54911, 56362, 57812, 59263, 60713, 62164, 63614, 65065, 66515, 67966, 69416, 70867, 72317, 73768, 75218, 76669, 78119, 79570, 81020, 82471, 83921, 85372]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 被抓取敌人撞击地面时的冲击波攻击力 : {value2}
    # REMOVE: data2 = [0, 49549, 54576, 59602, 64629, 69656, 74682, 79709, 84736, 89763, 94789, 99816, 104843, 109869, 114896, 119923, 124949, 129976, 135003, 140030, 145056, 150083, 155110, 160136, 165163, 170190, 175216, 180243, 185270, 190297, 195323, 200350, 205377, 210403, 215430, 220457, 225483, 230510, 235537, 240564, 245590, 250617, 255644, 260670, 265697, 270724, 275750, 280777, 285804, 290831, 295857]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 撞击地面时冲击波对不可抓取敌人的攻击力 : {value3}
    # REMOVE: data3 = [0, 71411, 78656, 85901, 93145, 100390, 107635, 114879, 122124, 129369, 136613, 143858, 151102, 158347, 165592, 172836, 180081, 187326, 194570, 201815, 209060, 216304, 223549, 230794, 238038, 245283, 252527, 259772, 267017, 274261, 281506, 288751, 295995, 303240, 310485, 317729, 324974, 332218, 339463, 346708, 353952, 361197, 368442, 375686, 382931, 390176, 397420, 404665, 411909, 419154, 426399]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 异次元水晶对不可抓取敌人的攻击力 : {value4}
    # REMOVE: data4 = [0, 42893, 47245, 51596, 55948, 60299, 64650, 69002, 73353, 77705, 82056, 86408, 90759, 95111, 99462, 103814, 108165, 112517, 116868, 121220, 125571, 129923, 134274, 138625, 142977, 147328, 151680, 156031, 160383, 164734, 169086, 173437, 177789, 182140, 186492, 190843, 195195, 199546, 203898, 208249, 212601, 216952, 221303, 225655, 230006, 234358, 238709, 243061, 247412, 251764, 256115]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 1
    # 异次元水晶对不可抓取敌人的爆炸攻击力 : {value5}
    # REMOVE: data5 = [0, 49549, 54576, 59602, 64629, 69656, 74682, 79709, 84736, 89763, 94789, 99816, 104843, 109869, 114896, 119923, 124949, 129976, 135003, 140030, 145056, 150083, 155110, 160136, 165163, 170190, 175216, 180243, 185270, 190297, 195323, 200350, 205377, 210403, 215430, 220457, 225483, 230510, 235537, 240564, 245590, 250617, 255644, 260670, 265697, 270724, 275750, 280777, 285804, 290831, 295857]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    hit5 = 1
    # [次元边界效果]
    # 次元边界能量条增加量 : {value6}
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    # 水晶地带单次攻击力 : {value7}
    # REMOVE: data7 = [0, 8354, 9202, 10050, 10897, 11745, 12592, 13440, 14287, 15135, 15982, 16830, 17678, 18525, 19373, 20220, 21068, 21915, 22763, 23610, 24458, 25305, 26153, 27001, 27848, 28696, 29543, 30391, 31238, 32086, 32933, 33781, 34629, 35476, 36324, 37171, 38019, 38866, 39714, 40561, 41409, 42257, 43104, 43952, 44799, 45647, 46494, 47342, 48189, 49037, 49885]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    hit7 = 0
    # 水晶地带每次爆炸攻击力 : {value8}
    # REMOVE: data8 = [0, 12528, 13799, 15070, 16341, 17612, 18883, 20154, 21425, 22696, 23967, 25238, 26509, 27780, 29051, 30322, 31593, 32864, 34135, 35406, 36677, 37948, 39219, 40490, 41761, 43032, 44303, 45574, 46845, 48116, 49387, 50658, 51928, 53199, 54470, 55741, 57012, 58283, 59554, 60825, 62096, 63367, 64638, 65909, 67180, 68451, 69722, 70993, 72264, 73535, 74806]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    hit8 = 0
    # [范围信息]
    # 攻击范围比率 : {value9}%
    # REMOVE: data9 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data9 = get_data(f'{prefix}/{uuid}', 9, lambda x = None: x)

    mode = ["强化","普通"]

    def setMode(self, mode):
        if mode == "强化":
            self.hit7 = self.hit8 = 1
            self.hit4 = self.hit5 = 0
        elif mode == "普通":
            self.hit7 = self.hit8 = 0
            self.hit4 = self.hit5 = 1

    def vp_1(self):
        """
        [次元 : 奇点]\n
        无施放动作， 立即施放\n
        普通施放时， 即使不存在敌人， 也会在能量领域生成次元水晶\n
        - 控制范围内无法抓取的敌人2秒\n
        技能范围 +30%\n
        [好不容易改良了部分术式。 虽然奈雅丽有点失望， 但这个程度已经是最好的办法了……不会吧， 你们不会还期待着别的结果吧？]
        """
        ...

    def vp_2(self):
        """
        [次元 : 奇点]\n
        普通施放时， 对无法抓取的敌人也进行相同的流程\n
        - 第1击和第2击变更为不会移动敌人， 而是通过次元力进行打击\n
        首次能量地带范围 +40%\n
        发动[次元边界]效果时， 效果变更如下\n
        - 不生成水晶地带， 而是生成能量地带\n
        - 生成能量地带时进入无敌状态\n
        - 即使能量地带范围内没有敌人， 仍继续进行流程\n
        [看起来复杂的东西， 其实答案可能简单得惊人。 不过看奈雅丽的表情， 她好像不太认同……]
        """
        ...

# 乖离 : 沉沦
# mage_male/dimension_walker/96bd070daacc6c1b81d9f24e6d77f48a
# a5ccbaf5538981c6ef99b236c0a60b73/96bd070daacc6c1b81d9f24e6d77f48a
class Skill43(ActiveSkill):
    """
    奈雅丽将异次元彼端的怪物召唤到角色前方。\n
    被召唤的怪物发出悲鸣攻击敌人， 同时敌人被吸附到怪物身边。\n
    若有敌人被[乖离 : 迷雾]所附身， 则将该敌人作为媒介召唤。 此时， 悲鸣的攻击力有所降低， 但召唤瞬间会给敌人造成巨大伤害。\n
    [有什么可以代表“永远的睡眠相当于死亡”这一说法？ 毫无疑问是摇篮曲。 至少在异次元彼端， 摇篮曲真的是用在战斗中。 当然， 我不想知道那个摇篮曲是唱给谁听的。]
    """
    name = "乖离 : 沉沦"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 8 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [800, 6000]
    uuid = "96bd070daacc6c1b81d9f24e6d77f48a"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 彼端怪物每次悲鸣时攻击力 : {value0}
    # REMOVE: data0 = [0, 4314, 4752, 5189, 5627, 6065, 6502, 6940, 7378, 7815, 8253, 8691, 9128, 9566, 10003, 10441, 10879, 11316, 11754, 12192, 12629, 13067, 13505, 13942, 14380, 14818, 15255, 15693, 16131, 16568, 17006, 17444, 17881, 18319, 18757, 19194, 19632, 20069, 20507, 20945, 21382, 21820, 22258, 22695, 23133, 23571, 24008, 24446, 24884, 25321, 25759]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 彼端怪物悲鸣次数 : {value1}次
    # REMOVE: data1 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [媒介召唤]
    # 媒介对象受到的伤害 : {value2}
    # REMOVE: data2 = [0, 64710, 71275, 77840, 84404, 90969, 97534, 104099, 110663, 117228, 123793, 130358, 136923, 143487, 150052, 156617, 163182, 169747, 176311, 182876, 189441, 196006, 202570, 209135, 215700, 222265, 228830, 235394, 241959, 248524, 255089, 261653, 268218, 274783, 281348, 287913, 294477, 301042, 307607, 314172, 320737, 327301, 333866, 340431, 346996, 353560, 360125, 366690, 373255, 379820, 386384]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 彼端怪物每次悲鸣时攻击力 : {value3}
    # REMOVE: data3 = [0, 2157, 2376, 2595, 2813, 3032, 3251, 3470, 3689, 3908, 4126, 4345, 4564, 4783, 5002, 5221, 5439, 5658, 5877, 6096, 6315, 6534, 6752, 6971, 7190, 7409, 7628, 7846, 8065, 8284, 8503, 8722, 8941, 9159, 9378, 9597, 9816, 10035, 10254, 10472, 10691, 10910, 11129, 11348, 11567, 11785, 12004, 12223, 12442, 12661, 12879]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 25
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90, 90]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [乖离 : 沉沦]\n
        变更为彼端的存在爆炸后， 一次性造成伤害\n
        - 总攻击力相同\n
        召唤媒介时， 向媒介对象刻下印章， 使其即使脱离爆炸范围， 也会受到伤害\n
        攻击范围 +50%\n
        [在异次元彼端， 他们居然把这种爆炸声当成摇篮曲……实在搞不懂。]
        """
        ...

    def vp_2(self):
        """
        [乖离 : 沉沦]\n
        与以往不同外形的彼端的存在登场\n
        - 无法召唤媒介\n
        - 登场的同时悲鸣， 造成相当于变更前媒介召唤总攻击力100%的伤害\n
        - 奈雅丽看到出乎意料的存在后有些慌张， 移动到附近后通过有效方法压制对方\n
        压制过程中， 异次元彼端的怪物拼命挣扎\n
        - 对周围敌人造成相当于奈雅丽近身攻击力100%的伤害 (最多攻击10次)\n
        - 若存在被[乖离 : 迷雾]附身的敌人， 则攻击该敌人\n
        [这家伙从来没见过啊……怎么感觉越来越困……还有奈雅丽为什么慌成那样？]
        """
        ...

# 禁断之盛宴
# mage_male/dimension_walker/c9a29f5c3509b90a96d5ca9b70dc9c85
# a5ccbaf5538981c6ef99b236c0a60b73/c9a29f5c3509b90a96d5ca9b70dc9c85
class Skill44(ActiveSkill):
    """
    次元行者与奈雅丽的合击技。\n
    次元行者在天空中开启巨大的异次元之门， 攻击地面的敌人， 奈雅丽化身为泥土和迷雾笼罩地面。\n
    此时敌人会被吸附到角色身边并进入束缚状态， 同时被强制控制。\n
    - [次元边界效果] -\n
    奈雅丽不再化身为泥土和迷雾， 直接进入异次元魔法阵， 将魔法术式发动为极限状态。 \n
    开始发动瞬间按跳跃键， 可以省略次元炮击和奈雅丽落下动作， 发动简化版技能。\n
    在没有召唤奈雅丽的状态下也可以施放该技能， 但若召唤奈雅丽时， 次元边界效果下的最终一击威力将会更大。\n
    [乖离 : 禁锢]状态下施放该技能时， 会保留[乖离 : 禁锢]的强制控制效果。\n
    [恐惧缘于无知， 真实发光于谎言之中。 所以不管你喜不喜欢， 我们会一直在一起的……哈哈哈……]
    """
    name = "禁断之盛宴"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "c9a29f5c3509b90a96d5ca9b70dc9c85"
    hasVP = False
    hasUP = False

    # 边界能量条增加量 : {value0}
    # REMOVE: data0 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 奈雅丽迷雾每一击攻击力 : {value1}
    # REMOVE: data1 = [0, 10659, 13131, 15602, 18074, 20546, 23017, 25489, 27961, 30432, 32904, 35376, 37848, 40319, 42791, 45263, 47734, 50206, 52678, 55149, 57621, 60093, 62564, 65036, 67508, 69979, 72451, 74923, 77394, 79866, 82338, 84809, 87281, 89753, 92224, 94696, 97168, 99639, 102111, 104583, 107054, 109526, 111998, 114469, 116941, 119413, 121884, 124356, 126828, 129299, 131771]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 10
    # 奈雅丽迷雾束缚时间 : {value2}秒
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 次元炮击每一击攻击力 : {value3}
    # REMOVE: data3 = [0, 8883, 10942, 13002, 15062, 17121, 19181, 21241, 23301, 25360, 27420, 29480, 31540, 33599, 35659, 37719, 39779, 41838, 43898, 45958, 48017, 50077, 52137, 54197, 56256, 58316, 60376, 62436, 64495, 66555, 68615, 70674, 72734, 74794, 76854, 78913, 80973, 83033, 85093, 87152, 89212, 91272, 93331, 95391, 97451, 99511, 101570, 103630, 105690, 107750, 109809]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 12
    # [次元边界效果]
    # 边界能量增加量 : {value4}
    # REMOVE: data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 次元炮击每一击攻击力 : {value5}
    # REMOVE: data5 = [0, 5300, 6529, 7758, 8987, 10216, 11445, 12674, 13903, 15132, 16361, 17590, 18819, 20048, 21277, 22506, 23735, 24963, 26192, 27421, 28650, 29879, 31108, 32337, 33566, 34795, 36024, 37253, 38482, 39711, 40940, 42169, 43398, 44627, 45856, 47085, 48314, 49543, 50772, 52001, 53230, 54459, 55688, 56917, 58146, 59375, 60604, 61833, 63062, 64291, 65520]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    hit5 = 18
    # 强化的次元炮击每一击攻击力 : {value6}
    # REMOVE: data6 = [0, 4981, 6136, 7291, 8446, 9601, 10757, 11912, 13067, 14222, 15377, 16532, 17687, 18842, 19997, 21152, 22307, 23462, 24617, 25772, 26927, 28082, 29238, 30393, 31548, 32703, 33858, 35013, 36168, 37323, 38478, 39633, 40788, 41943, 43098, 44253, 45408, 46563, 47719, 48874, 50029, 51184, 52339, 53494, 54649, 55804, 56959, 58114, 59269, 60424, 61579]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)
    hit6 = 18
    # 最终一击攻击力 : {value7}
    # REMOVE: data7 = [0, 158406, 195138, 231870, 268601, 305333, 342065, 378797, 415529, 452261, 488992, 525724, 562456, 599188, 635920, 672652, 709383, 746115, 782847, 819579, 856311, 893043, 929774, 966506, 1003238, 1039970, 1076702, 1113434, 1150165, 1186897, 1223629, 1260361, 1297093, 1333825, 1370556, 1407288, 1444020, 1480752, 1517484, 1554215, 1590947, 1627679, 1664411, 1701143, 1737875, 1774606, 1811338, 1848070, 1884802, 1921534, 1958266]# noqa: E501
    data7 = get_data(f'{prefix}/{uuid}', 7, lambda x = None: x)
    hit7 = 0
    # 召唤奈雅丽时最终一击攻击力 : {value8}
    # REMOVE: data8 = [0, 174247, 214652, 255057, 295462, 335867, 376272, 416677, 457082, 497487, 537892, 578297, 618702, 659107, 699512, 739917, 780322, 820727, 861132, 901537, 941942, 982347, 1022752, 1063157, 1103562, 1143967, 1184372, 1224777, 1265182, 1305587, 1345992, 1386397, 1426802, 1467207, 1507612, 1548017, 1588422, 1628827, 1669232, 1709637, 1750042, 1790447, 1830852, 1871257, 1911662, 1952067, 1992472, 2032877, 2073282, 2113687, 2154092]# noqa: E501
    data8 = get_data(f'{prefix}/{uuid}', 8, lambda x = None: x)
    hit8 = 1

    mode = ["强化全","强化简","普通"]

    def setMode(self, mode):
        if mode == "强化全":
            self.hit1 = 0
            self.hit3 = 0
            self.hit5 = 10
            self.hit6 = 17
            self.hit7 = 0
            self.hit8 = 1
        elif mode == "强化简":
            self.hit1 = 0
            self.hit3 = 0
            self.hit5 = 0
            self.hit6 = 17
            self.hit7 = 0
            self.hit8 = 1
        elif mode == "普通":
            self.hit1 = 10
            self.hit3 = 12
            self.hit5 = 0
            self.hit6 = 0
            self.hit7 = 0
            self.hit8 = 0

# 古史记忆
# mage_male/dimension_walker/ae7608b87b6e965c6bdd0b3ef4e6d63e
# a5ccbaf5538981c6ef99b236c0a60b73/ae7608b87b6e965c6bdd0b3ef4e6d63e
class Skill45(PassiveSkill):
    """
    连接乖离世界边界的古书， 记载着一些无法解析的文字。\n
    首次施放[时空壁障]时， 增加边界能量条的波动数； 未召唤奈雅丽的状态下， 召唤奈雅丽。 (若已发动[时空壁障]， 则不增加波动数)\n
    通过On/Off功能， 可以设置是否召唤奈雅丽。 增加基本攻击力和转职技能攻击力， 变更部分技能效果。\n
    [乖离 : 迷雾]\n
    变更为前方一定范围内存在敌人时可以施放。\n
    范围内存在敌人时， 追加释放黄色雾气， 附着在范围内最强的敌人身上。 (再次按技能键可以召回； 存在召回等待时间)\n
    [乖离 : 魅魔之舞]\n
    乱打或终结攻击过程中， 中断魅魔之舞发动其他奈雅丽技能时， 利用古史记忆的力量生成奈雅丽分身继续攻击。\n
    [无数与我的意志无关的“某种东西”传到脑海里， 回过神来， 竟发现这些已经转移到了纸上。 究竟想从我的身上得到什么？] 
    """
    name = "古史记忆"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "ae7608b87b6e965c6bdd0b3ef4e6d63e"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 首次施放[时空壁障]时，波动数增加量 : {value1}
    # REMOVE: data1 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    associate = [{"data":data0}]

# 乖离 : 边缘之兽
# mage_male/dimension_walker/626cfc24770b72b5d7a24c24cda3768b
# a5ccbaf5538981c6ef99b236c0a60b73/626cfc24770b72b5d7a24c24cda3768b
class Skill46(ActiveSkill):
    """
    前方一定范围内存在敌人时， 可以施放该技能。\n
    部分解除古史记忆的封印， 使[乖离 : 迷雾]附身范围内最强大的敌人， 召唤边缘之兽。\n
    跳到现界的野兽形成完整的形态后， 向目标位置突袭， 吞噬一切。\n
    前方一定范围内存在敌人时， 可以施放该技能。\n
    若已存在被[乖离 : 迷雾]附身敌人， 则无视距离向该目标发动技能。\n
    [不要靠近角落……永远……永远……]
    """
    name = "乖离 : 边缘之兽"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [1067, 8000]
    uuid = "626cfc24770b72b5d7a24c24cda3768b"
    hasVP = False
    hasUP = False

    # 索敌距离 : {value0}px
    # REMOVE: data0 = [0, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600, 600]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 索敌宽度 : {value1}px
    # REMOVE: data1 = [0, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125, 125]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 索敌高度 : {value2}px
    # REMOVE: data2 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 生命值消耗 : {value3}
    # REMOVE: data3 = [0, 400, 520, 640, 760, 880, 1000, 1120, 1240, 1360, 1480, 1600, 1720, 1840, 1960, 2080, 2200, 2320, 2440, 2560, 2680, 2800, 2920, 3040, 3160, 3280, 3400, 3520, 3640, 3760, 3880, 4000, 4120, 4240, 4360, 4480, 4600, 4720, 4840, 4960, 5080, 5200, 5320, 5440, 5560, 5680, 5800, 5920, 6040, 6160, 6280]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 突袭攻击力 : {value4}
    # REMOVE: data4 = [0, 234726, 258539, 282352, 306164, 329977, 353790, 377603, 401415, 425228, 449041, 472854, 496667, 520479, 544292, 568105, 591918, 615731, 639543, 663356, 687169, 710982, 734794, 758607, 782420, 806233, 830046, 853858, 877671, 901484, 925297, 949109, 972922, 996735, 1020548, 1044361, 1068173, 1091986, 1115799, 1139612, 1163425, 1187237, 1211050, 1234863, 1258676, 1282488, 1306301, 1330114, 1353927, 1377740, 1401552]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    hit4 = 1

# 未明·次元崩坏
# mage_male/dimension_walker/7a96c262533919beee21b5a666062880
# a5ccbaf5538981c6ef99b236c0a60b73/7a96c262533919beee21b5a666062880
class Skill47(ActiveSkill):
    """
    次元行者越过理性的红线， 完全解除古史记忆的封印。 世界逆转， 现世与异界发生不完整地交缠， 次元行者被拉入异界。 \n
    奈雅丽跳入异界， 从未知存在的手中拯救次元行者， 在逃跑的瞬间， 未知存在因受到奈雅丽阻碍而暴怒， 继续攻击， 使不完整的世界崩坏。\n
    未召唤奈雅丽的状态下， 也可以施放该技能； 可以在[禁断之盛宴]普通模式中施放该技能。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。\n
    [“虽然这一天总会到来， 但不是现在。”奈雅丽说的这句话无法从脑海中消失。 ……总有一天必须去往那里吗？]
    """
    name = "未明·次元崩坏"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "7a96c262533919beee21b5a666062880"
    hasVP = False
    hasUP = False

    # 边界能量增加量 : {value0}
    # REMOVE: data0 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 奈雅丽光线攻击力 : {value1}
    # REMOVE: data1 = [0, 98093, 120839, 143586, 166332, 189078, 211824, 234570, 257317, 280063, 302809, 325555, 348302, 371048, 393794, 416540, 439286, 462033, 484779, 507525, 530271, 553018, 575764, 598510, 621256, 644003, 666749, 689495, 712241, 734987, 757734, 780480, 803226, 825972, 848719, 871465, 894211, 916957, 939703, 962450, 985196, 1007942, 1030688, 1053435, 1076181, 1098927, 1121673, 1144419, 1167166, 1189912, 1212658]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    hit1 = 1
    # 未知存在攻击力 : {value2}
    # REMOVE: data2 = [0, 326977, 402798, 478619, 554439, 630260, 706081, 781902, 857722, 933543, 1009364, 1085185, 1161005, 1236826, 1312647, 1388468, 1464288, 1540109, 1615930, 1691751, 1767571, 1843392, 1919213, 1995034, 2070854, 2146675, 2222496, 2298317, 2374137, 2449958, 2525779, 2601600, 2677420, 2753241, 2829062, 2904883, 2980703, 3056524, 3132345, 3208166, 3283986, 3359807, 3435628, 3511449, 3587269, 3663090, 3738911, 3814732, 3890552, 3966373, 4042194]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    hit2 = 1
    # 不完整的世界崩坏攻击力 : {value3} x {value4}
    # REMOVE: data3 = [0, 57221, 70490, 83758, 97027, 110296, 123564, 136833, 150101, 163370, 176639, 189907, 203176, 216445, 229713, 242982, 256250, 269519, 282788, 296056, 309325, 322594, 335862, 349131, 362400, 375668, 388937, 402205, 415474, 428743, 442011, 455280, 468549, 481817, 495086, 508354, 521623, 534892, 548160, 561429, 574698, 587966, 601235, 614504, 627772, 641041, 654309, 667578, 680847, 694115, 707384]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    hit3 = 4
    # REMOVE: data4 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'dimension_walker'
        self.nameCN = '知源·次元行者'
        self.role = 'mage_male'
        self.角色 = '魔法师(男)'
        self.职业 = '次元行者'
        self.jobId = 'a5ccbaf5538981c6ef99b236c0a60b73'
        self.jobGrowId = '92da05ec93fb43406e193ffb9a2a629b'

        self.武器选项 = ['扫把', '矛', '魔杖', '法杖', '棍棒']
        self.输出类型选项 = ['魔法固伤']
        self.输出类型 = '魔法固伤'
        self.防具精通属性 = ['智力']
        self.防具类型 = '扫把'
        self.buff = 1.922

        self.武器选项 = ['魔杖', '法杖', '矛', '棍棒']
        self.输出类型选项 = ['魔法百分比']
        self.输出类型 = '魔法百分比'
        self.防具精通属性 = ['智力']
        self.防具类型 = '皮甲'
        self.buff = 1.872

        super().__init__(equVersion, __name__)
