#a5ccbaf5538981c6ef99b236c0a60b73
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "mage_male/elemental_bomber/cn/skillDetail"

# 魔法旋风
# mage_male/elemental_bomber/3c5604bdbb0240b8f130f59ab40509c3
# a5ccbaf5538981c6ef99b236c0a60b73/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
    向敌人发出无属性旋风并使其浮空。\n
    转职为次元行者后， 技能类型变为独立攻击力。\n
    - [转职为猩红法师时附加效果] -\n
    外形发生变化， 可以吸收猩红气息。\n
    - [转职为逐风者时附加效果] -\n
    增加攻击力， 可以按<X>键进行追加操作。
    """
    name = "魔法旋风"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 118, 137, 156, 174, 193, 212, 231, 250, 268, 287, 306, 325, 344, 363, 381, 400, 419, 438, 457, 475]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 131.4, 132.8, 134, 135.4, 136.5, 138, 139.1, 140.5, 141.7, 143.1, 147.7, 152.2, 157.1, 162, 166.5, 171.4, 176.2, 180.8, 185.7, 190.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [转职为猩红法师后] -
    # 猩红气息吸收率 : {value2}%
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # - [转职为逐风者后] -
    # 攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 魔法冰球
# mage_male/elemental_bomber/5dc7008b12a459325b548b0715c6b73c
# a5ccbaf5538981c6ef99b236c0a60b73/5dc7008b12a459325b548b0715c6b73c
class Skill1(ActiveSkill):
    """
    向前方发射魔法冰球。\n
    在决斗场内， 冰球大小随技能等级增加而增大。
    """
    name = "魔法冰球"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 2
    mp = [10, 84]
    uuid = "5dc7008b12a459325b548b0715c6b73c"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 695, 766, 836, 907, 977, 1048, 1118, 1189, 1259, 1330, 1400, 1471, 1541, 1612, 1682, 1753, 1823, 1894, 1964, 2035, 2105, 2176, 2246, 2317, 2387, 2458, 2528, 2599, 2669, 2740, 2810, 2881, 2951, 3022, 3092, 3163, 3233, 3304, 3374, 3445, 3515, 3586, 3656, 3727, 3797, 3868, 3938, 4009, 4079, 4150, 4220, 4291, 4361, 4432, 4502, 4573, 4643, 4714, 4784, 4855, 4925, 4996, 5066, 5137, 5207, 5278, 5348, 5419, 5489, 5560]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冰球大小 : {value1}%
    # REMOVE: data1 = [0, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 不死之身
# mage_male/elemental_bomber/bb34e8854a93fd250347a1c64119f7ab
# a5ccbaf5538981c6ef99b236c0a60b73/bb34e8854a93fd250347a1c64119f7ab
class Skill2(PassiveSkill):
    """
    角色死亡后带着少量生命值原地复活， 并且进入自动恢复生命值模式。\n
    自动恢复生命值模式下， 角色的生命值值可以在一定时间内自动恢复至100%， 但无法借用任何道具或其它途径恢复生命值， 且所受到的伤害还会加剧。\n
    若在恢复模式下死亡， 则无法再次通过该技能复活。
    """
    name = "不死之身"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 1 #TODO
    rangeLv = 3
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = False
    hasUP = False

    # 恢复模式下所受伤害增加 : {value0}%
    # REMOVE: data0 = [0, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 死亡时立即恢复的生命值量 : {value1}%
    # REMOVE: data1 = [0, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 恢复模式持续时间(普通地下城) : {value2}秒
    # REMOVE: data2 = [0, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 恢复模式持续时间(亡者峡谷) : {value3}秒
    # REMOVE: data3 = [0, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 黑暗之眼
# mage_male/elemental_bomber/6e33d47e6622ce03b6defdd912140270
# a5ccbaf5538981c6ef99b236c0a60b73/6e33d47e6622ce03b6defdd912140270
class Skill3(PassiveSkill):
    """
    增加魔法师的魔法值最大值； 若魔法值低于一定比率时， 还可增加魔法值恢复速度。
    """
    name = "黑暗之眼"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 1
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 魔法值最大值增加 : {value0}%
    # REMOVE: data0 = [0, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 可触发恢复效果时的魔法值比率 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值恢复速度增加 : {value2}倍
    # REMOVE: data2 = [0, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 后跳
# mage_male/elemental_bomber/7822d6d52e10964a6755f142c666b494
# a5ccbaf5538981c6ef99b236c0a60b73/7822d6d52e10964a6755f142c666b494
class Skill4(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 基础精通
# mage_male/elemental_bomber/5a56514f35cf0270ae8d6c65f8fefd78
# a5ccbaf5538981c6ef99b236c0a60b73/5a56514f35cf0270ae8d6c65f8fefd78
class Skill5(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [魔法旋风]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 受身蹲伏
# mage_male/elemental_bomber/ce26c6b69d02a440a81b552bec94f03b
# a5ccbaf5538981c6ef99b236c0a60b73/ce26c6b69d02a440a81b552bec94f03b
class Skill6(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# mage_male/elemental_bomber/892ef624d8bf3d7fc045f84825fd6104
# a5ccbaf5538981c6ef99b236c0a60b73/892ef624d8bf3d7fc045f84825fd6104
class Skill7(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 擒拿掌
# mage_male/elemental_bomber/78bd107acd474518b606be1e4fd38239
# a5ccbaf5538981c6ef99b236c0a60b73/78bd107acd474518b606be1e4fd38239
class Skill8(ActiveSkill):
    """
    抓取前方1名敌人后用力扔开， 被掷出的敌人落地时会生成冲击波并对周围的敌人造成伤害。\n
    对无法抓取的敌人不适用控制效果。\n
    转职为次元行者时， 技能类型变为独立攻击力。
    """
    name = "擒拿掌"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 4
    mp = [14, 168]
    uuid = "78bd107acd474518b606be1e4fd38239"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 765, 843, 921, 998, 1076, 1154, 1231, 1309, 1387, 1464, 1542, 1619, 1697, 1775, 1852, 1930, 2008, 2085, 2163, 2241, 2318, 2396, 2474, 2551, 2629, 2706, 2784, 2862, 2939, 3017, 3095, 3172, 3250, 3328, 3405, 3483, 3561, 3638, 3716, 3793, 3871, 3949, 4026, 4104, 4182, 4259, 4337, 4415, 4492, 4570, 4648, 4725, 4803, 4881, 4958, 5036, 5113, 5191, 5269, 5346, 5424, 5502, 5579, 5657, 5735, 5812, 5890, 5968, 6045, 6123]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冲击波攻击力 : {value1}%
    # REMOVE: data1 = [0, 458, 504, 551, 597, 643, 690, 736, 783, 829, 875, 922, 968, 1015, 1061, 1108, 1154, 1200, 1247, 1293, 1340, 1386, 1433, 1479, 1525, 1572, 1618, 1665, 1711, 1758, 1804, 1850, 1897, 1943, 1990, 2036, 2083, 2129, 2175, 2222, 2268, 2315, 2361, 2408, 2454, 2500, 2547, 2593, 2640, 2686, 2733, 2779, 2825, 2872, 2918, 2965, 3011, 3058, 3104, 3150, 3197, 3243, 3290, 3336, 3383, 3429, 3475, 3522, 3568, 3615, 3661]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 魔球连射
# mage_male/elemental_bomber/a5fa08f5d509e6ff2ebc68856a470b5a
# a5ccbaf5538981c6ef99b236c0a60b73/a5fa08f5d509e6ff2ebc68856a470b5a
class Skill9(ActiveSkill):
    """
    快速生成多个魔法球并向前连续发射。\n
    转职为元素爆破师后， 减少技能冷却时间， 发射[属性变换]中所选属性的魔法球。
    """
    name = "魔球连射"
    learnLv = 5
    masterLv = 1
    maxLv = 11
    position = 6 #TODO
    rangeLv = 2
    cd = 3
    mp = [22, 183]
    uuid = "a5fa08f5d509e6ff2ebc68856a470b5a"
    hasVP = False
    hasUP = False

    # 魔法球数量 : {value0}个
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # -  [转职为元素爆破师后附加效果]  -
    # 冷却时间减少 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 幽冥火
# mage_male/elemental_bomber/cfacda0647b9a0f595df2c2aad30c18d
# a5ccbaf5538981c6ef99b236c0a60b73/cfacda0647b9a0f595df2c2aad30c18d
class Skill10(ActiveSkill):
    """
    生成两团幽冥火， 可以增加自身的物理和魔法防御力， 且造成一定伤害， 效果持续一定时间。\n
    转职成次元行者时， 可以学习[虚妄之火]技能。\n
    学习[虚妄之火]后， 持续时间变更为无限， 且无法发动攻击。
    """
    name = "幽冥火"
    learnLv = 10
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 3
    cd = 10
    mp = [30, 345]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 每个火球增加物理防御力 : {value1}
    # REMOVE: data1 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每个火球增加魔法防御力 : {value2}
    # REMOVE: data2 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每个火球的攻击力 : {value3}%
    # REMOVE: data3 = [0, 814, 944, 1074, 1203, 1333, 1463, 1593, 1722, 1852, 1982, 2112, 2241, 2371, 2501, 2631, 2761, 2890, 3020, 3150, 3280]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [虚妄之火效果] -
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法防御力增加 : {value5}
    # REMOVE: data5 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 瞬移
# mage_male/elemental_bomber/3d8f3d438405d79f8d3ed68072674d1e
# a5ccbaf5538981c6ef99b236c0a60b73/3d8f3d438405d79f8d3ed68072674d1e
class Skill11(ActiveSkill):
    """
    向指定方向快速移动一定距离。
    """
    name = "瞬移"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 5 #TODO
    rangeLv = 2
    cd = 1.5
    mp = [40, 40]
    uuid = "3d8f3d438405d79f8d3ed68072674d1e"
    hasVP = False
    hasUP = False

    # X轴移动距离 : {value0}px
    # REMOVE: data0 = [0, 400]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # Y轴移动距离 : {value1}px
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 旋火盾
# mage_male/elemental_bomber/8ee0099656df08a0b39225f8a21d514b
# a5ccbaf5538981c6ef99b236c0a60b73/8ee0099656df08a0b39225f8a21d514b
class Skill12(ActiveSkill):
    """
    生成火焰盾牌并向前发射， 使其攻击敌人。 \n
    持续输入按键可维持持盾状态， 减少敌人远程攻击的伤害。
    """
    name = "旋火盾"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 4
    mp = [31, 259]
    uuid = "8ee0099656df08a0b39225f8a21d514b"
    hasVP = False
    hasUP = False

    # 盾牌攻击力 : {value0}%
    # REMOVE: data0 = [0, 2765, 3046, 3326, 3607, 3887, 4168, 4448, 4729, 5009, 5290, 5570, 5851, 6131, 6412, 6692, 6973, 7253, 7534, 7814, 8095, 8375, 8656, 8936, 9217, 9497, 9778, 10058, 10339, 10619, 10900, 11180, 11461, 11741, 12022, 12302, 12583, 12863, 13144, 13424, 13705, 13985, 14266, 14546, 14827, 15107, 15388, 15668, 15949, 16229, 16510, 16790, 17071, 17351, 17632, 17912, 18193, 18473, 18754, 19034, 19315, 19595, 19876, 20156, 20437, 20717, 20998, 21278, 21559, 21839, 22120]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 所受伤害减少率 (远程) : {value1}%
    # REMOVE: data1 = [0, 22, 23, 23, 24, 24, 24, 25, 25, 26, 26, 26, 27, 27, 28, 28, 28, 29, 29, 30, 30, 30, 31, 31, 32, 32, 32, 33, 33, 34, 34, 34, 35, 35, 36, 36, 36, 37, 37, 38, 38, 38, 39, 39, 40, 40, 40, 41, 41, 42, 42, 42, 43, 43, 44, 44, 44, 45, 45, 46, 46, 46, 47, 47, 48, 48, 48, 49, 49, 50, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 盾牌前进距离 : {value2}px
    # REMOVE: data2 = [0, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 强化 - 后跳
# mage_male/elemental_bomber/2b340542e776818b78f3212af184bd6b
# a5ccbaf5538981c6ef99b236c0a60b73/2b340542e776818b78f3212af184bd6b
class Skill13(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# mage_male/elemental_bomber/1fea5a626f15230237946a11a9d11582
# a5ccbaf5538981c6ef99b236c0a60b73/1fea5a626f15230237946a11a9d11582
class Skill14(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 属性变换
# mage_male/elemental_bomber/eb71e1d82d92c7e1d40500a0dcd77aa6
# a5ccbaf5538981c6ef99b236c0a60b73/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill15(ActiveSkill):
    """
    可以变换魔法球的属性。 从四种属性中任意选择一种作为魔法球的属性。 一定时间后， 魔法球恢复无属性。
    """
    name = "属性变换"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 5
    cd = 5
    mp = [181, 3134]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 火属性攻击力 : {value1}%
    # REMOVE: data1 = [0, 694, 855, 1016, 1177, 1338, 1499, 1660, 1820, 1981, 2142, 2303, 2464, 2625, 2786, 2947, 3108, 3269, 3430, 3591, 3752, 3913, 4073, 4234, 4395, 4556, 4717, 4878, 5039, 5200, 5361, 5522, 5683, 5844, 6005, 6166, 6326, 6487, 6648, 6809, 6970, 7131, 7292, 7453, 7614, 7775, 7936, 8097, 8258, 8419, 8579, 8740, 8901, 9062, 9223, 9384, 9545, 9706, 9867, 10028, 10189, 10350, 10511, 10672, 10832, 10993, 11154, 11315, 11476, 11637, 11798]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 冰属性攻击力 : {value2}%
    # REMOVE: data2 = [0, 694, 855, 1016, 1177, 1338, 1499, 1660, 1820, 1981, 2142, 2303, 2464, 2625, 2786, 2947, 3108, 3269, 3430, 3591, 3752, 3913, 4073, 4234, 4395, 4556, 4717, 4878, 5039, 5200, 5361, 5522, 5683, 5844, 6005, 6166, 6326, 6487, 6648, 6809, 6970, 7131, 7292, 7453, 7614, 7775, 7936, 8097, 8258, 8419, 8579, 8740, 8901, 9062, 9223, 9384, 9545, 9706, 9867, 10028, 10189, 10350, 10511, 10672, 10832, 10993, 11154, 11315, 11476, 11637, 11798]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 暗属性攻击力 : {value3}%
    # REMOVE: data3 = [0, 694, 855, 1016, 1177, 1338, 1499, 1660, 1820, 1981, 2142, 2303, 2464, 2625, 2786, 2947, 3108, 3269, 3430, 3591, 3752, 3913, 4073, 4234, 4395, 4556, 4717, 4878, 5039, 5200, 5361, 5522, 5683, 5844, 6005, 6166, 6326, 6487, 6648, 6809, 6970, 7131, 7292, 7453, 7614, 7775, 7936, 8097, 8258, 8419, 8579, 8740, 8901, 9062, 9223, 9384, 9545, 9706, 9867, 10028, 10189, 10350, 10511, 10672, 10832, 10993, 11154, 11315, 11476, 11637, 11798]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 光属性攻击力 : {value4}%
    # REMOVE: data4 = [0, 694, 855, 1016, 1177, 1338, 1499, 1660, 1820, 1981, 2142, 2303, 2464, 2625, 2786, 2947, 3108, 3269, 3430, 3591, 3752, 3913, 4073, 4234, 4395, 4556, 4717, 4878, 5039, 5200, 5361, 5522, 5683, 5844, 6005, 6166, 6326, 6487, 6648, 6809, 6970, 7131, 7292, 7453, 7614, 7775, 7936, 8097, 8258, 8419, 8579, 8740, 8901, 9062, 9223, 9384, 9545, 9706, 9867, 10028, 10189, 10350, 10511, 10672, 10832, 10993, 11154, 11315, 11476, 11637, 11798]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 冰魄剑
# mage_male/elemental_bomber/f2fb27162beb0b87a7cb9af7900e95f2
# a5ccbaf5538981c6ef99b236c0a60b73/f2fb27162beb0b87a7cb9af7900e95f2
class Skill16(ActiveSkill):
    """
    生成冰魄剑连续攻击敌人。 第1击和第2击使敌人进入僵直状态， 第3击则可以击退敌人， 并有一定几率使敌人进入减速状态。\n
    转职成为冰结师时， 才可以强制中断基本攻击动作， 并立即施放该技能。
    """
    name = "冰魄剑"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 10 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 280]
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"
    hasVP = False
    hasUP = True

    # 第1击和第2击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1846, 2034, 2221, 2408, 2595, 2783, 2970, 3157, 3345, 3532, 3719, 3907, 4094, 4281, 4468, 4656, 4843, 5030, 5218, 5405, 5592, 5780, 5967, 6154, 6341, 6529, 6716, 6903, 7091, 7278, 7465, 7653, 7840, 8027, 8214, 8402, 8589, 8776, 8964, 9151, 9338, 9526, 9713, 9900, 10087, 10275, 10462, 10649, 10837, 11024, 11211, 11399, 11586, 11773, 11960, 12148, 12335, 12522, 12710, 12897, 13084, 13272, 13459, 13646, 13833, 14021, 14208, 14395, 14583, 14770]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第3击攻击力 : {value1}%
    # REMOVE: data1 = [0, 2216, 2440, 2665, 2890, 3115, 3339, 3564, 3789, 4014, 4238, 4463, 4688, 4913, 5137, 5362, 5587, 5812, 6036, 6261, 6486, 6711, 6935, 7160, 7385, 7610, 7835, 8059, 8284, 8509, 8734, 8958, 9183, 9408, 9633, 9857, 10082, 10307, 10532, 10756, 10981, 11206, 11431, 11655, 11880, 12105, 12330, 12555, 12779, 13004, 13229, 13454, 13678, 13903, 14128, 14353, 14577, 14802, 15027, 15252, 15476, 15701, 15926, 16151, 16375, 16600, 16825, 17050, 17274, 17499, 17724]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [减速效果]
    # 减速几率 : {value2}%
    # REMOVE: data2 = [0, 20, 21, 23, 24, 26, 27, 28, 30, 31, 32, 34, 35, 37, 38, 39, 41, 42, 43, 45, 46, 48, 49, 50, 52, 53, 54, 56, 57, 59, 60, 61, 63, 64, 66, 67, 68, 70, 71, 72, 74, 75, 77, 78, 79, 81, 82, 83, 85, 86, 88, 89, 90, 92, 93, 94, 96, 97, 99, 100, 101, 103, 104, 106, 107, 108, 110, 111, 112, 114, 115]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 减速持续时间 : {value3}秒
    # REMOVE: data3 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 元素炮
# mage_male/elemental_bomber/d085127b0edd719782bd618d5688f4a1
# a5ccbaf5538981c6ef99b236c0a60b73/d085127b0edd719782bd618d5688f4a1
class Skill17(ActiveSkill):
    """
    生成强力的元素炮给予敌人伤害。\n
    元素炮的攻击力、 属性以及附加效果受[属性变换]的影响。\n
    该技能可以在空中使用， 在空中攻击时可以利用方向键调整发射方向以及发射后自身反弹的方向。\n
    可以强制中断当前进行的普通攻击动作或[魔球连射]， 并立即施放该技能。
    """
    name = "元素炮"
    learnLv = 15
    masterLv = 1
    maxLv = 11
    position = 9 #TODO
    rangeLv = 2
    cd = 5
    mp = [31, 259]
    uuid = "d085127b0edd719782bd618d5688f4a1"
    hasVP = False
    hasUP = False

    # [属性变换]魔法球攻击力变换率 : {value0}%
    # REMOVE: data0 = [0, 500, 510, 520, 530, 540, 550, 560, 570, 580, 590, 600]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [范围信息]
    # 爆炸大小比率 : {value1}%
    # REMOVE: data1 = [0, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60, 60]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 元素融合
# mage_male/elemental_bomber/1dad88963abdc96b091fcab185a8820d
# a5ccbaf5538981c6ef99b236c0a60b73/1dad88963abdc96b091fcab185a8820d
class Skill18(PassiveSkill):
    """
    施放[属性变换]后， 可增加所选属性外的其它3种属性的抗性， 并增加属性攻击力。\n
    在决斗场中， 不增加属性攻击力。
    """
    name = "元素融合"
    learnLv = 15
    masterLv = 1
    maxLv = 11
    position = 2 #TODO
    rangeLv = 3
    uuid = "1dad88963abdc96b091fcab185a8820d"
    hasVP = False
    hasUP = False

    # 属性抗性增加 : {value0}
    # REMOVE: data0 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 属性攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 冰晶坠
# mage_male/elemental_bomber/0969cd4054d93da07708108c0cc1c4b5
# a5ccbaf5538981c6ef99b236c0a60b73/0969cd4054d93da07708108c0cc1c4b5
class Skill19(ActiveSkill):
    """
    在角色上方生成冰柱直线攻击下方敌人。\n
    被冰柱命中的敌人， 会受到冰属性魔法伤害。
    """
    name = "冰晶坠"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 8
    mp = [60, 616]
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = True

    # 冰柱攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 1226, 1350, 1475, 1599, 1724, 1848, 1972, 2097, 2221, 2345, 2470, 2594, 2719, 2843, 2967, 3092, 3216, 3340, 3465, 3589, 3714, 3838, 3962, 4087, 4211, 4335, 4460, 4584, 4709, 4833, 4957, 5082, 5206, 5330, 5455, 5579, 5704, 5828, 5952, 6077, 6201, 6325, 6450, 6574, 6699, 6823, 6947, 7072, 7196, 7320, 7445, 7569, 7694, 7818, 7942, 8067, 8191, 8315, 8440, 8564, 8689, 8813, 8937, 9062, 9186, 9310, 9435, 9559, 9684, 9808]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 水晶大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 元素之力
# mage_male/elemental_bomber/b163d099c8cc27fdb6fd3639c2ee6df9
# a5ccbaf5538981c6ef99b236c0a60b73/b163d099c8cc27fdb6fd3639c2ee6df9
class Skill20(PassiveSkill):
    """
    使用元素技能成功进行攻击时， [元素之力]将会蓄力。\n
    [元素之力]蓄好力的状态下使用[元素炮]， 则会消耗蓄好的[元素之力]增加[元素炮]的攻击力和爆炸大小， 消耗的[元素之力]越多， 增加的也越多。\n
    [元素之力蓄力技能目录]\n
    基本攻击第4下、 [魔球连射]、 [冰晶坠]、 [地炎]、 [雷光链]、 [暗域扩张]、 [冰晶之浴]、 [旋炎破]、 [雷光屏障]、 [黑暗禁域]、 [元素轰炸]、 [幻魔四重奏]、 [元素浓缩球]、 [元素幻灭]、 [元素禁域]、 [聚能魔炮]、 [末日湮灭]、 [聚魔轰击]、 [启源·微观宇宙]
    """
    name = "元素之力"
    learnLv = 20
    masterLv = 1
    maxLv = 11
    position = 9 #TODO
    rangeLv = 5
    uuid = "b163d099c8cc27fdb6fd3639c2ee6df9"
    hasVP = False
    hasUP = False

    # [元素之力]最大蓄力数量 : {value0}个
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 每个[元素之力]增加的[元素炮]攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 7, 8, 10, 11, 13, 14, 15, 17, 18, 20, 21]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每个[元素之力]增加的[元素炮]大小增加 : {value2}% 
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暴击
# mage_male/elemental_bomber/fc1262c19f3d0477ee8eda47b8db8696
# a5ccbaf5538981c6ef99b236c0a60b73/fc1262c19f3d0477ee8eda47b8db8696
class Skill21(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 地炎
# mage_male/elemental_bomber/4655101518604f874721b3cc249aae10
# a5ccbaf5538981c6ef99b236c0a60b73/4655101518604f874721b3cc249aae10
class Skill22(ActiveSkill):
    """
    在前方地面生成多个火柱攻击敌人。
    """
    name = "地炎"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 5
    mp = [45, 476]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = True

    # 火焰攻击力 : {value0}%
    # REMOVE: data0 = [0, 704, 775, 847, 918, 990, 1061, 1133, 1204, 1275, 1347, 1418, 1490, 1561, 1632, 1704, 1775, 1847, 1918, 1990, 2061, 2132, 2204, 2275, 2347, 2418, 2490, 2561, 2632, 2704, 2775, 2847, 2918, 2989, 3061, 3132, 3204, 3275, 3347, 3418, 3489, 3561, 3632, 3704, 3775, 3846, 3918, 3989, 4061, 4132, 4204, 4275, 4346, 4418, 4489, 4561, 4632, 4704, 4775, 4846, 4918, 4989, 5061, 5132, 5203, 5275, 5346, 5418, 5489, 5561, 5632]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 火焰攻击次数 : {value1}次 x2
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 元素环绕
# mage_male/elemental_bomber/42c82812f86ff6704ae9952a2e6093a4
# a5ccbaf5538981c6ef99b236c0a60b73/42c82812f86ff6704ae9952a2e6093a4
class Skill23(ActiveSkill):
    """
    生成各种元素护盾环绕在自身周围。\n
    元素保护持续时间内， 增加元素爆破师的物理/魔法防御力和属性攻击力 。\n
    在[元素环绕]激活的状态下， 若再次按技能键， 则护盾和保护效果消失。
    """
    name = "元素环绕"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 8 #TODO
    rangeLv = 2
    cd = 5
    mp = [60, 546]
    uuid = "42c82812f86ff6704ae9952a2e6093a4"
    hasVP = False
    hasUP = False

    # 护盾持续时间 : {value0}秒
    # REMOVE: data0 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 物理防御力增加 : {value1}
    # REMOVE: data1 = [0, 14081, 15646, 17210, 18775, 20339, 21904, 23468, 25033, 26598, 28162, 29727, 31291, 32856, 34420, 35985, 37550, 39114, 40679, 42243, 43808]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法防御力增加 : {value2}
    # REMOVE: data2 = [0, 14081, 15646, 17210, 18775, 20339, 21904, 23468, 25033, 26598, 28162, 29727, 31291, 32856, 34420, 35985, 37550, 39114, 40679, 42243, 43808]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 属性攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 魔力燃烧
# mage_male/elemental_bomber/9bff7f2559e003766fee2853dca00631
# a5ccbaf5538981c6ef99b236c0a60b73/9bff7f2559e003766fee2853dca00631
class Skill24(ActiveSkill):
    """
    使魔力的流动加速， 增加元素爆破师的基本攻击力、 技能攻击力和施放技能时的魔法值消耗量。
    """
    name = "魔力燃烧"
    learnLv = 25
    masterLv = 20
    maxLv = 30
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    uuid = "9bff7f2559e003766fee2853dca00631"
    hasVP = False
    hasUP = False

    # 攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法值消耗增加 : {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 持续时间 : {value2}秒
    # REMOVE: data2 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 元素禁断
# mage_male/elemental_bomber/ca75c965f20a150f99f54155a37400df
# a5ccbaf5538981c6ef99b236c0a60b73/ca75c965f20a150f99f54155a37400df
class Skill25(PassiveSkill):
    """
    可以强制中断元素爆破师的部分转职技能， 并增加施放速度、 减少转职技能的冷却时间。\n
    可强制中断的技能种类随[元素禁断]技能等级的增加而增加。\n
    强制中断[雷光链]施放其他技能时， 电流连接将会中断。\n
    无法强制中断[元素轰炸]， 并施放其他技能。\n
    [幻魔四重奏]、 [末日湮灭]、 [启源·微观宇宙]不适用[元素禁断]减少冷却时间的效果。
    """
    name = "元素禁断"
    learnLv = 25
    masterLv = 1
    maxLv = 5
    position = 7 #TODO
    rangeLv = 5
    uuid = "ca75c965f20a150f99f54155a37400df"
    hasVP = False
    hasUP = False

    # 施放速度增加 : {value0}%
    # REMOVE: data0 = [0, 20, 20, 20, 20, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 转职技能冷却时间减少率 : {value1}%
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [可强制中断的技能列表]
    # 掌握技能等级1时 : [元素炮]、 [冰晶坠]、 [地炎]
    # 掌握技能等级2时 : [暗域扩张]、 [雷光链]
    # 掌握技能等级3时 : [旋炎破]、 [冰晶之浴]
    # 掌握技能等级4时 : [黑暗禁域]、 [雷光屏障]、 [元素轰炸]
    # 掌握技能等级5时 : [元素浓缩球]、 [元素幻灭]

# 雷光链
# mage_male/elemental_bomber/9dda3f4a849dba1a288dd65e116860f2
# a5ccbaf5538981c6ef99b236c0a60b73/9dda3f4a849dba1a288dd65e116860f2
class Skill26(ActiveSkill):
    """
    向前方发射光属性电流， 使敌人受到4次电流伤害。 电流在攻击敌人的同时， 会随机传导给周围的其他敌人， 并使其受到伤害。
    """
    name = "雷光链"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 12
    mp = [100, 1050]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = True

    # 电流攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 4342, 4782, 5223, 5663, 6104, 6544, 6985, 7425, 7866, 8306, 8747, 9187, 9628, 10068, 10509, 10949, 11390, 11830, 12271, 12711, 13152, 13592, 14033, 14473, 14914, 15354, 15795, 16235, 16676, 17116, 17557, 17997, 18438, 18878, 19319, 19759, 20200, 20640, 21081, 21521, 21962, 22402, 22843, 23283, 23724, 24164, 24605, 25045, 25486, 25926, 26367, 26807, 27248, 27688, 28129, 28569, 29010, 29450, 29891, 30331, 30772, 31212, 31653, 32093, 32534, 32974, 33415, 33855, 34296, 34736]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 电流传导次数 : {value2}次
    # REMOVE: data2 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [学习异瞳后]
    # 闪电球体爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 17368, 19130, 20892, 22654, 24416, 26178, 27940, 29702, 31464, 33226, 34988, 36750, 38512, 40274, 42036, 43798, 45560, 47322, 49083, 50845, 52607, 54369, 56131, 57893, 59655, 61417, 63179, 64941, 66703, 68465, 70227, 71989, 73751, 75513, 77275, 79037, 80799, 82561, 84323, 86085, 87847, 89609, 91371, 93133, 94895, 96657, 98419, 100181, 101943, 103705, 105467, 107229, 108990, 110752, 112514, 114276, 116038, 117800, 119562, 121324, 123086, 124848, 126610, 128372, 130134, 131896, 133658, 135420, 137182, 138944]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 暗域扩张
# mage_male/elemental_bomber/717f1e2104fe4b796f800352fa143ecc
# a5ccbaf5538981c6ef99b236c0a60b73/717f1e2104fe4b796f800352fa143ecc
class Skill27(ActiveSkill):
    """
    在前方释放黑暗能量， 对一定范围内的敌人造成伤害， 并使画面内角色面对方向的所有敌人进入失明状态。\n
    施放技能时按向下方向键， 在以自身为中心的圆圈范围内释放黑暗能量， 并使画面内的所有敌人进入失明状态。\n
    在决斗场中， 不受方向键影响， 在以自身为中心的圆圈范围内释放黑暗能量。
    """
    name = "暗域扩张"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cd = 15
    mp = [80, 980]
    uuid = "717f1e2104fe4b796f800352fa143ecc"
    hasVP = False
    hasUP = True

    # 暗黑能量攻击力 : {value0}%
    # REMOVE: data0 = [0, 17451, 19221, 20992, 22762, 24533, 26303, 28073, 29844, 31614, 33385, 35155, 36925, 38696, 40466, 42236, 44007, 45777, 47548, 49318, 51088, 52859, 54629, 56400, 58170, 59940, 61711, 63481, 65252, 67022, 68792, 70563, 72333, 74104, 75874, 77644, 79415, 81185, 82955, 84726, 86496, 88267, 90037, 91807, 93578, 95348, 97119, 98889, 100659, 102430, 104200, 105971, 107741, 109511, 111282, 113052, 114823, 116593, 118363, 120134, 121904, 123674, 125445, 127215, 128986, 130756, 132526, 134297, 136067, 137838, 139608]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 失明几率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 失明持续时间 : {value2}秒
    # REMOVE: data2 = [0, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5, 3.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # [暗域扩张]范围 : {value3}%
    # REMOVE: data3 = [0, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200, 200]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 元素循环
# mage_male/elemental_bomber/573723c8c0614f5b1218ca9ff992115b
# a5ccbaf5538981c6ef99b236c0a60b73/573723c8c0614f5b1218ca9ff992115b
class Skill28(PassiveSkill):
    """
    对元素本质有了更深入的理解， 领悟了高效的元素循环， 增加基本攻击力、 转职技能攻击力和命中率。
    """
    name = "元素循环"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 8 #TODO
    rangeLv = 3
    uuid = "573723c8c0614f5b1218ca9ff992115b"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加量 : {value1}%
    # REMOVE: data1 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 旋炎破
# mage_male/elemental_bomber/45442bbbe33540b4deeec29437dae70c
# a5ccbaf5538981c6ef99b236c0a60b73/45442bbbe33540b4deeec29437dae70c
class Skill29(ActiveSkill):
    """
    在前方生成高速旋转的火环， 攻击敌人。\n
    施放技能时按向下方向键， 生成以自身为中心旋转的火环， 使周围敌人受到伤害， 然后引爆火环将其击飞。 在该情况下， 如果在旋转时连续按X键或技能键， 可以加快火环旋转速度。\n
    普通施放时不适用连按加速效果。\n
    在决斗场中， 不受方向键影响， 生成以自身为中心旋转的火环。
    """
    name = "旋炎破"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [150, 1148]
    uuid = "45442bbbe33540b4deeec29437dae70c"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 前方火环攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 1896, 2088, 2281, 2473, 2665, 2858, 3050, 3242, 3435, 3627, 3819, 4012, 4204, 4397, 4589, 4781, 4974, 5166, 5358, 5551, 5743, 5935, 6128, 6320, 6512, 6705, 6897, 7089, 7282, 7474, 7666, 7859, 8051, 8243, 8436, 8628, 8821, 9013, 9205, 9398, 9590, 9782, 9975, 10167, 10359, 10552, 10744, 10936, 11129, 11321, 11513, 11706, 11898, 12090, 12283, 12475, 12667, 12860, 13052, 13245, 13437, 13629, 13822, 14014, 14206, 14399, 14591, 14783, 14976, 15168]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 自身中心火环攻击力 : {value2}% x{value3}
    # REMOVE: data2 = [0, 1896, 2088, 2281, 2473, 2665, 2858, 3050, 3242, 3435, 3627, 3819, 4012, 4204, 4397, 4589, 4781, 4974, 5166, 5358, 5551, 5743, 5935, 6128, 6320, 6512, 6705, 6897, 7089, 7282, 7474, 7666, 7859, 8051, 8243, 8436, 8628, 8821, 9013, 9205, 9398, 9590, 9782, 9975, 10167, 10359, 10552, 10744, 10936, 11129, 11321, 11513, 11706, 11898, 12090, 12283, 12475, 12667, 12860, 13052, 13245, 13437, 13629, 13822, 14014, 14206, 14399, 14591, 14783, 14976, 15168]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # REMOVE: data3 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 自身中心火环爆炸攻击力 : {value4}%
    # REMOVE: data4 = [0, 7584, 8353, 9123, 9892, 10662, 11431, 12200, 12970, 13739, 14509, 15278, 16047, 16817, 17586, 18355, 19125, 19894, 20664, 21433, 22202, 22972, 23741, 24511, 25280, 26049, 26819, 27588, 28358, 29127, 29896, 30666, 31435, 32205, 32974, 33743, 34513, 35282, 36051, 36821, 37590, 38360, 39129, 39898, 40668, 41437, 42207, 42976, 43745, 44515, 45284, 46054, 46823, 47592, 48362, 49131, 49901, 50670, 51439, 52209, 52978, 53747, 54517, 55286, 56056, 56825, 57594, 58364, 59133, 59903, 60672]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140, 140]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [旋炎破]\n
        对周围一定范围内最强的敌人生成旋炎破\n
         - 对敌人生成的旋炎破会跟随敌人旋转并爆炸\n
         - 不受方向键的影响， 以相同方式施放\n
         - 若寻敌范围内没有敌人， 则无法施放\n
        旋转速度 +30%
        """
        ...

    def vp_2(self):
        """
        [旋炎破]\n
        向前方发射旋转的旋炎破\n
         - 多段攻击次数减少为3次\n
         - 删除爆炸攻击\n
         - 总攻击力相同\n
        旋转半径 +50%
        """
        ...

# 冰晶之浴
# mage_male/elemental_bomber/8c2379737c5acc935c1731f67f607655
# a5ccbaf5538981c6ef99b236c0a60b73/8c2379737c5acc935c1731f67f607655
class Skill30(ActiveSkill):
    """
    在前方生成魔法阵， 并召唤出大量冰柱， 使其下落攻击敌人。\n
    在决斗场中， 武器的攻击属性不影响技能的攻击属性。
    """
    name = "冰晶之浴"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 9
    mp = [150, 1148]
    uuid = "8c2379737c5acc935c1731f67f607655"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 冰柱攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 775, 854, 932, 1011, 1089, 1168, 1247, 1325, 1404, 1483, 1561, 1640, 1718, 1797, 1876, 1954, 2033, 2112, 2190, 2269, 2347, 2426, 2505, 2583, 2662, 2741, 2819, 2898, 2976, 3055, 3134, 3212, 3291, 3370, 3448, 3527, 3605, 3684, 3763, 3841, 3920, 3999, 4077, 4156, 4234, 4313, 4392, 4470, 4549, 4628, 4706, 4785, 4863, 4942, 5021, 5099, 5178, 5257, 5335, 5414, 5492, 5571, 5650, 5728, 5807, 5886, 5964, 6043, 6121, 6200]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 持续时间 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 冰冻几率 : {value3}%
    # REMOVE: data3 = [0, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55, 55]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冰冻持续时间 : {value4}秒
    # REMOVE: data4 = [0, 0.5, 0.5, 0.6, 0.6, 0.7, 0.7, 0.8, 0.9, 0.9, 1, 1, 1.1, 1.2, 1.2, 1.3, 1.3, 1.4, 1.5, 1.5, 1.6, 1.6, 1.7, 1.7, 1.8, 1.9, 1.9, 2, 2, 2.1, 2.2, 2.2, 2.3, 2.3, 2.4, 2.5, 2.5, 2.6, 2.6, 2.7, 2.7, 2.8, 2.9, 2.9, 3, 3, 3.1, 3.2, 3.2, 3.3, 3.3, 3.4, 3.5, 3.5, 3.6, 3.6, 3.7, 3.7, 3.8, 3.9, 3.9, 4, 4, 4.1, 4.2, 4.2, 4.3, 4.3, 4.4, 4.5, 4.5]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [范围信息]
    # 魔法阵大小比率 : {value5}%
    # REMOVE: data5 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

    def vp_1(self):
        """
        [冰晶之浴]\n
        在前方空中生成巨大的冰块并使其坠落\n
         - 删除魔法阵\n
         - 坠落期间， 周围敌人会被吸附至落点\n
        冰块碰撞地面后破碎， 并对周围造成1次伤害\n
         - 删除对敌人附加冰冻的功能\n
         - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [冰晶之浴]\n
        变更为可填充2次的技能\n
         - 每次填充冷却时间 : 4.5秒\n
         - 魔法阵持续时间 -50%\n
         - 冰柱多段攻击次数 -50%\n
        魔法阵大小 +20%
        """
        ...

# 黑暗禁域
# mage_male/elemental_bomber/506e7ed77d517419a6e1c437a2cedb17
# a5ccbaf5538981c6ef99b236c0a60b73/506e7ed77d517419a6e1c437a2cedb17
class Skill31(ActiveSkill):
    """
    在前方生成黑暗气息地带， 黑暗气息会凝聚成球体将周围的敌人吸附进来， 并使敌人进入减速状态。 将敌人聚到一处后， 使敌人进入强制控制状态， 最后球体发生爆破， 使敌人受到巨大伤害。\n
    在决斗场中不会吸附敌人， 球体内部的僵直不会强制控制敌人， 但会使敌人浮空。
    """
    name = "黑暗禁域"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [300, 2520]
    uuid = "506e7ed77d517419a6e1c437a2cedb17"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 暗黑球体爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 19932, 21954, 23976, 25998, 28020, 30042, 32065, 34087, 36109, 38131, 40153, 42175, 44197, 46219, 48241, 50263, 52285, 54307, 56330, 58352, 60374, 62396, 64418, 66440, 68462, 70484, 72506, 74528, 76550, 78573, 80595, 82617, 84639, 86661, 88683, 90705, 92727, 94749, 96771, 98793, 100815, 102838, 104860, 106882, 108904, 110926, 112948, 114970, 116992, 119014, 121036, 123058, 125081, 127103, 129125, 131147, 133169, 135191, 137213, 139235, 141257, 143279, 145301, 147323, 149346, 151368, 153390, 155412, 157434, 159456]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 减速持续时间 : {value1}秒
    # REMOVE: data1 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 吸附范围比率 : {value2}%
    # REMOVE: data2 = [0, 115, 115, 116, 116, 117, 117, 118, 118, 120, 120, 120, 121, 121, 122, 122, 123, 123, 124, 124, 125, 125, 125, 127, 127, 128, 128, 129, 129, 130, 130, 131, 131, 131, 132, 132, 133, 133, 135, 135, 136, 136, 137, 137, 138, 138, 138, 139, 139, 140, 140, 141, 141, 143, 143, 144, 144, 144, 145, 145, 146, 146, 147, 147, 148, 148, 150, 150, 150, 151, 151]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 爆炸范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [黑暗禁域]\n
        球体吸附敌人后立即爆炸\n
         - 不会强制控制敌人\n
        吸附敌人的范围 +40%
        """
        ...

    def vp_2(self):
        """
        [黑暗禁域]\n
        以自身为中心展开黑暗气息， 随后在黑暗气息范围内的所有敌人身上生成黑暗球体\n
         - 球体不再吸附敌人\n
         - 黑暗气息范围 +50%\n
         - 暗黑球体爆炸攻击变更为1:1攻击\n
        暗黑球体生成速度 +100%
        """
        ...

# 雷光屏障
# mage_male/elemental_bomber/da6e37c1e3f0e8867f70007d89c239ff
# a5ccbaf5538981c6ef99b236c0a60b73/da6e37c1e3f0e8867f70007d89c239ff
class Skill32(ActiveSkill):
    """
    生成雷光屏障， 并向前快速推移攻击敌人， 对敌人造成光属性伤害。
    """
    name = "雷光屏障"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [350, 3080]
    uuid = "da6e37c1e3f0e8867f70007d89c239ff"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 雷光屏障攻击力 : {value0}%
    # REMOVE: data0 = [0, 21101, 23242, 25382, 27523, 29664, 31804, 33945, 36086, 38226, 40367, 42508, 44648, 46789, 48930, 51071, 53211, 55352, 57493, 59633, 61774, 63915, 66055, 68196, 70337, 72477, 74618, 76759, 78899, 81040, 83181, 85321, 87462, 89603, 91743, 93884, 96025, 98166, 100306, 102447, 104588, 106728, 108869, 111010, 113150, 115291, 117432, 119572, 121713, 123854, 125994, 128135, 130276, 132416, 134557, 136698, 138838, 140979, 143120, 145261, 147401, 149542, 151683, 153823, 155964, 158105, 160245, 162386, 164527, 166667, 168808]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [范围信息]
    # [雷光屏障]大小比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [雷光屏障]\n
        在两侧额外生成2道屏障并发射\n
         - 最多仅造成1次攻击\n
        屏障生成速度 +50%\n
        屏障移动速度 +30%
        """
        ...

    def vp_2(self):
        """
        [雷光屏障]\n
        在前方一定范围内生成方形的屏障围栏\n
        生成的围栏会在短暂延迟后向中心收缩， 聚集敌人并爆炸
        """
        ...

# 元素轰炸
# mage_male/elemental_bomber/a6c8f69107f8c4f5d1a0c7a57d000290
# a5ccbaf5538981c6ef99b236c0a60b73/a6c8f69107f8c4f5d1a0c7a57d000290
class Skill33(ActiveSkill):
    """
    瞬间移动到空中， 在空中向敌人连续抛出各种属性的小魔法球， 最后生成大型魔法球砸向地面并引发爆炸。 魔法球的属性为所有属性。\n
    施放技能途中若按下Z键， 则直接施放大型魔法球； 若按下跳跃键， 则中断技能。
    """
    name = "元素轰炸"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 2
    cd = 40
    mp = [360, 3149]
    uuid = "a6c8f69107f8c4f5d1a0c7a57d000290"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 小魔法球攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 636, 700, 765, 829, 894, 958, 1023, 1087, 1152, 1217, 1281, 1346, 1410, 1475, 1539, 1604, 1668, 1733, 1797, 1862, 1926, 1991, 2055, 2120, 2184, 2249, 2313, 2378, 2442, 2507, 2571, 2636, 2700, 2765, 2829, 2894, 2958, 3023, 3087, 3152, 3216, 3281, 3345, 3410, 3474, 3539, 3603, 3668, 3733, 3797, 3862, 3926, 3991, 4055, 4120, 4184, 4249, 4313, 4378, 4442, 4507, 4571, 4636, 4700, 4765, 4829, 4894, 4958, 5023, 5087]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40, 40]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后大魔法球碰撞攻击力 : {value2}%
    # REMOVE: data2 = [0, 6958, 7664, 8370, 9075, 9781, 10487, 11193, 11899, 12605, 13311, 14017, 14722, 15428, 16134, 16840, 17546, 18252, 18958, 19664, 20369, 21075, 21781, 22487, 23193, 23899, 24605, 25311, 26016, 26722, 27428, 28134, 28840, 29546, 30252, 30957, 31663, 32369, 33075, 33781, 34487, 35193, 35899, 36604, 37310, 38016, 38722, 39428, 40134, 40840, 41546, 42251, 42957, 43663, 44369, 45075, 45781, 46487, 47193, 47898, 48604, 49310, 50016, 50722, 51428, 52134, 52839, 53545, 54251, 54957, 55663]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后大魔法球爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 13911, 15322, 16733, 18145, 19556, 20967, 22378, 23789, 25201, 26612, 28023, 29434, 30846, 32257, 33668, 35079, 36491, 37902, 39313, 40724, 42136, 43547, 44958, 46369, 47781, 49192, 50603, 52014, 53426, 54837, 56248, 57659, 59070, 60482, 61893, 63304, 64715, 66127, 67538, 68949, 70360, 71772, 73183, 74594, 76005, 77417, 78828, 80239, 81650, 83062, 84473, 85884, 87295, 88707, 90118, 91529, 92940, 94351, 95763, 97174, 98585, 99996, 101408, 102819, 104230, 105641, 107053, 108464, 109875, 111286]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 最后小魔法球攻击力 : {value4}% x{value5}
    # REMOVE: data4 = [0, 636, 701, 766, 830, 895, 959, 1024, 1088, 1153, 1217, 1282, 1347, 1411, 1476, 1540, 1605, 1669, 1734, 1799, 1863, 1928, 1992, 2057, 2121, 2186, 2250, 2315, 2380, 2444, 2509, 2573, 2638, 2702, 2767, 2832, 2896, 2961, 3025, 3090, 3154, 3219, 3283, 3348, 3413, 3477, 3542, 3606, 3671, 3735, 3800, 3865, 3929, 3994, 4058, 4123, 4187, 4252, 4316, 4381, 4446, 4510, 4575, 4639, 4704, 4768, 4833, 4898, 4962, 5027, 5091]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # REMOVE: data5 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [范围信息]
    # 大爆炸范围比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

    def vp_1(self):
        """
        [元素轰炸]\n
        在空中生成魔法球后使其逐渐变大， 然后向地面发射后引爆\n
         - 删除小魔法球攻击\n
         - 总攻击力相同\n
        可以利用[元素禁断]强制中断
        """
        ...

    def vp_2(self):
        """
        [元素轰炸]\n
        使前方大范围的地面分裂， 从裂缝中涌出大量的元素球后爆炸\n
         - 总攻击力相同
        """
        ...

# 元素爆发
# mage_male/elemental_bomber/1fadde0eece18649caddbca7bd58cc2f
# a5ccbaf5538981c6ef99b236c0a60b73/1fadde0eece18649caddbca7bd58cc2f
class Skill34(PassiveSkill):
    """
    理解元素的流动、 能熟练控制其中不稳定部分， 将元素的效率发挥到极致， 对敌人造成更强力、 致命的伤害。\n
    掌握该技能后， 增加魔皇的魔法暴击伤害和魔法暴击率。
    """
    name = "元素爆发"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "1fadde0eece18649caddbca7bd58cc2f"
    hasVP = False
    hasUP = False

    # 暴击伤害增加率 : {value0}%
    # REMOVE: data0 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27.5, 29.5, 31.5, 33.5, 35.5, 37.5, 39.5, 41.5, 43.5, 45.5, 47.5, 49.5, 51.5, 53.5, 55.5, 57.5, 59.5, 61.5, 63.5, 65.5, 67.5, 69.5, 71.5, 73.5, 75.5, 77.5, 79.5, 81.5, 83.5, 85.5, 87.5, 89.5, 91.5, 93.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 魔法暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25, 25.5, 26, 26.5, 27, 27.5, 28, 28.5, 29, 29.5, 30, 30.5, 31, 31.5, 32, 32.5, 33, 33.5, 34, 34.5, 35]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 幻魔四重奏
# mage_male/elemental_bomber/c27418ae613c647527200a7ca17d97fd
# a5ccbaf5538981c6ef99b236c0a60b73/c27418ae613c647527200a7ca17d97fd
class Skill35(ActiveSkill):
    """
    凝聚带有属性的气息并引发爆炸； 4次爆炸效果分别带有4种不同属性。\n
    最后一次爆炸效果更强烈， 并且受最近一次施放[属性变换]中选择的属性影响。\n
    掌握[黑瞳]后， 适用[元素禁断]效果。 \n
    但施放[幻魔四重奏]时， 无法强制中断后使用其他技能， 并且不适用减少冷却时间的效果。
    """
    name = "幻魔四重奏"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [600, 5040]
    uuid = "c27418ae613c647527200a7ca17d97fd"
    hasVP = False
    hasUP = False

    # 爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 3264, 4021, 4778, 5535, 6292, 7049, 7806, 8563, 9319, 10076, 10833, 11590, 12347, 13104, 13861, 14618, 15375, 16132, 16889, 17646, 18402, 19159, 19916, 20673, 21430, 22187, 22944, 23701, 24458, 25215, 25972, 26728, 27485, 28242, 28999, 29756, 30513, 31270, 32027, 32784, 33541, 34298, 35054, 35811, 36568, 37325, 38082, 38839, 39596, 40353]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸次数 : 4次
    # 最后爆炸次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 元素浓缩球
# mage_male/elemental_bomber/faf9cd66281078b51be2ee0b0f6c5530
# a5ccbaf5538981c6ef99b236c0a60b73/faf9cd66281078b51be2ee0b0f6c5530
class Skill36(ActiveSkill):
    """
    凝聚属性力量， 生成魔法球并向前抛出。 抛出的魔法球在弹落一定次数后引起爆炸。 爆炸属性受[属性变换]的影响。
    """
    name = "元素浓缩球"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [450, 1260]
    uuid = "faf9cd66281078b51be2ee0b0f6c5530"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 弹落攻击力 : {value0}%
    # REMOVE: data0 = [0, 12245, 13488, 14730, 15972, 17215, 18457, 19699, 20941, 22184, 23426, 24668, 25911, 27153, 28395, 29637, 30880, 32122, 33364, 34607, 35849, 37091, 38333, 39576, 40818, 42060, 43303, 44545, 45787, 47029, 48272, 49514, 50756, 51999, 53241, 54483, 55725, 56968, 58210, 59452, 60695, 61937, 63179, 64421, 65664, 66906, 68148, 69391, 70633, 71875, 73117]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 弹落次数 : 1次
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 28573, 31471, 34370, 37269, 40167, 43066, 45965, 48863, 51762, 54661, 57559, 60458, 63357, 66255, 69154, 72053, 74951, 77850, 80749, 83647, 86546, 89445, 92343, 95242, 98141, 101039, 103938, 106837, 109735, 112634, 115533, 118431, 121330, 124229, 127127, 130026, 132925, 135823, 138722, 141621, 144519, 147418, 150317, 153215, 156114, 159013, 161911, 164810, 167709, 170607]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 爆炸范围比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [元素浓缩球]\n
        抛出的魔法球触碰地面时立即爆炸\n
         - 总攻击力相同\n
        爆炸攻击不会击飞敌人\n
        爆炸范围 +30%
        """
        ...

    def vp_2(self):
        """
        [元素浓缩球]\n
        魔法球可以弹跳7次\n
         - 对单个敌人最多造成2次攻击\n
         - 总攻击力相同\n
        弹跳攻击范围 +50%\n
        被攻击的敌人不会被击飞， 而是被聚集到魔法球弹跳的位置
        """
        ...

# 元素幻灭
# mage_male/elemental_bomber/1721e94897e9961d5c98130a13392f17
# a5ccbaf5538981c6ef99b236c0a60b73/1721e94897e9961d5c98130a13392f17
class Skill37(ActiveSkill):
    """
    在空中生成5个大魔法球并砸向地面。 魔法球落地时生成魔法阵并引发强烈爆炸。 魔法球的属性受最近一次施放[属性变换]中选择的属性影响。
    """
    name = "元素幻灭"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [935, 1960]
    uuid = "1721e94897e9961d5c98130a13392f17"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 魔法球攻击力 : {value0}%
    # REMOVE: data0 = [0, 3382, 3725, 4068, 4411, 4754, 5097, 5440, 5783, 6126, 6469, 6812, 7155, 7498, 7841, 8184, 8528, 8871, 9214, 9557, 9900, 10243, 10586, 10929, 11272, 11615, 11958, 12301, 12644, 12987, 13330, 13673, 14016, 14360, 14703, 15046, 15389, 15732, 16075, 16418, 16761, 17104, 17447, 17790, 18133, 18476, 18819, 19162, 19505, 19849, 20192]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 64250, 70769, 77287, 83805, 90323, 96841, 103359, 109877, 116396, 122914, 129432, 135950, 142468, 148986, 155505, 162023, 168541, 175059, 181577, 188095, 194614, 201132, 207650, 214168, 220686, 227204, 233722, 240241, 246759, 253277, 259795, 266313, 272831, 279350, 285868, 292386, 298904, 305422, 311940, 318459, 324977, 331495, 338013, 344531, 351049, 357567, 364086, 370604, 377122, 383640]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value2}%
    # REMOVE: data2 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [元素幻灭]\n
        魔法阵汇聚时将敌人向中心聚拢\n
        魔法球及魔法阵大小 +45%\n
        [元素幻灭]攻击速度 +30%
        """
        ...

    def vp_2(self):
        """
        [元素幻灭]\n
        删除魔法球生成过程， 立即发生爆炸\n
         - 总攻击力相同\n
        在其他技能施放过程中施放[元素幻灭]时， 无施放动作直接施放
        """
        ...

# 黑瞳
# mage_male/elemental_bomber/51a08fd0c90f0a5276cd552047fac93d
# a5ccbaf5538981c6ef99b236c0a60b73/51a08fd0c90f0a5276cd552047fac93d
class Skill38(PassiveSkill):
    """
    眼睛变黑的元素爆破师以更强大的魔力为基础进行转职后， [元素禁断]可以连接使用所有技能， 并增加基本攻击力和技能攻击力。\n
    进入地下城时， 自动施放[元素环绕]技能。 而且， [幻魔四重奏]的攻击属性将变更为全属性攻击。\n
    部分技能强制中断后施放时， 有附加效果。\n
    - [元素禁断可以额外强制中断的技能] -\n
    [魔球连射]、 [幻魔四重奏]、 [元素禁域]、 [聚能魔炮]、 [末日湮灭]\n
    - [攻击力增加的技能] -\n
    [属性变换]、 [冰晶坠]、 [雷光链]、 [暗域扩张]、 [旋炎破]、 [雷光屏障]、 [黑暗禁域]、 [元素轰炸]、 [幻魔四重奏]、 [元素浓缩球]、 [元素幻灭]、 [聚能魔炮]、 [元素禁域]、 [末日湮灭]、 [聚魔轰击]、 [启源·微观宇宙]\n
    - [有附加效果的技能] -\n
    [元素炮] - 增加魔法球体及爆炸大小\n
    [地炎] - 增加火柱施放速度\n
    [冰晶之浴] - 增加攻击范围及冰块大小\n
    [暗域扩张] - 增加攻击范围\n
    [旋炎破] - 增加攻击范围
    """
    name = "黑瞳"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 2 #TODO
    rangeLv = 3
    uuid = "51a08fd0c90f0a5276cd552047fac93d"
    hasVP = False
    hasUP = False

    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [技能连接附加效果]
    # 技能魔法值减少 : {value1}%
    # REMOVE: data1 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [元素炮]魔法球、 爆炸大小变化率 : {value2}%
    # REMOVE: data2 = [0, 118, 120, 123, 125, 128, 130, 133, 135, 138, 140, 143, 145, 148, 150, 153, 155, 158, 160, 163, 165, 168, 170, 173, 175, 178, 180, 183, 185, 188, 190, 193, 195, 198, 200, 203, 205, 208, 210, 213, 215, 218, 220, 223, 225, 228, 230, 233, 235, 238, 240]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [地炎]火柱速度变化率 : {value3}%
    # REMOVE: data3 = [0, 118, 120, 123, 125, 128, 130, 133, 135, 138, 140, 143, 145, 148, 150, 153, 155, 158, 160, 163, 165, 168, 170, 173, 175, 178, 180, 183, 185, 188, 190, 193, 195, 198, 200, 203, 205, 208, 210, 213, 215, 218, 220, 223, 225, 228, 230, 233, 235, 238, 240]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [冰晶之浴]范围、 冰块大小变化率 : {value4}%
    # REMOVE: data4 = [0, 118, 120, 123, 125, 128, 130, 133, 135, 138, 140, 143, 145, 148, 150, 153, 155, 158, 160, 163, 165, 168, 170, 173, 175, 178, 180, 183, 185, 188, 190, 193, 195, 198, 200, 203, 205, 208, 210, 213, 215, 218, 220, 223, 225, 228, 230, 233, 235, 238, 240]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # [暗域扩张]范围增加 : {value5}%
    # REMOVE: data5 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)
    # [旋炎破]范围增加 : {value6}%
    # REMOVE: data6 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6, lambda x = None: x)

# 元素禁域
# mage_male/elemental_bomber/f0cc2c950f3bdf4103c75fa496bcac34
# a5ccbaf5538981c6ef99b236c0a60b73/f0cc2c950f3bdf4103c75fa496bcac34
class Skill39(ActiveSkill):
    """
    让元素爆炸后， 展开[元素禁域]。\n
    [元素禁域]展开时， 领域内的敌人将会受到所有属性的魔法伤害。\n
    [元素禁域]持续一定时间， 且一定时间内使部分固定属性技能适用所有属性。\n
    学习[黑瞳]后会受到[元素禁断]的效果。\n
    - [适用所有属性的技能] -\n
    [冰晶坠]、 [冰晶之浴]、 [闪电链]、 [雷光屏障]、 [地炎]、 [旋炎破]、 [暗域扩张]、 [黑暗禁域]
    """
    name = "元素禁域"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [800, 6000]
    uuid = "f0cc2c950f3bdf4103c75fa496bcac34"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # [元素禁域]持续时间 : {value0}秒
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 适用所有属性效果持续时间 : {value1}秒
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [元素禁域]攻击力 : {value2}%
    # REMOVE: data2 = [0, 69396, 76436, 83476, 90517, 97557, 104597, 111637, 118677, 125717, 132758, 139798, 146838, 153878, 160918, 167958, 174999, 182039, 189079, 196119, 203159, 210199, 217240, 224280, 231320, 238360, 245400, 252441, 259481, 266521, 273561, 280601, 287641, 294682, 301722, 308762, 315802, 322842, 329882, 336923, 343963, 351003, 358043, 365083, 372123, 379164, 386204, 393244, 400284, 407324, 414365]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # [元素禁域]范围 : {value3}px
    # REMOVE: data3 = [0, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500, 500]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [元素禁域]\n
        施放其他技能过程中施放[元素禁域]时， 可以取消施放动作， 立即施放。\n
        禁域范围 +10%\n
        在禁域内赋予以下效果\n
         - 所有速度 +20%\n
         - 所受伤害 -50%
        """
        ...

    def vp_2(self):
        """
        [元素禁域]\n
        在禁域内使用瞬移技能可以连接元素禁断\n
         - 瞬移前后攻击技能可强制中断连接\n
         - 强制中断连接时可根据方向键输入调整技能使用方向\n
        禁域持续时间 +5秒\n
        禁域范围 +20%\n
        在禁域内进入霸体状态\n
        [瞬移]\n
        在元素禁域内移动距离 -30%\n
        在元素禁域内冷却时间 -50%
        """
        ...

# 聚能魔炮
# mage_male/elemental_bomber/28b583c75a49103a1d8aabf799c000a4
# a5ccbaf5538981c6ef99b236c0a60b73/28b583c75a49103a1d8aabf799c000a4
class Skill40(ActiveSkill):
    """
    融合火、 冰、 光、 暗四个属性后制造出强力的元素球体， 快速射向前方并引起爆炸。\n
    被球体碰到的敌人会被拖到爆炸地点， 达到一定距离后， 就会引起强烈的爆炸， 对敌人造成所有属性的伤害。\n
    按向前方向键， 可以减少后退距离； 到达最大射程前按下技能键可以立即引发爆炸。\n
    [聚能魔炮]命中敌人后， 5个[元素之力]将会充电。\n
    学习[黑瞳]后会受到[元素禁断]的效果， 可以强制中断其他技能的使用并立即施放[聚能魔炮]。 但是[聚能魔炮]施放过程中， 无法强制中断[聚能魔炮]并施放其他技能。
    """
    name = "聚能魔炮"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [580, 4500]
    uuid = "28b583c75a49103a1d8aabf799c000a4"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # [聚能魔炮]爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 88200, 97148, 106096, 115043, 123991, 132939, 141887, 150835, 159783, 168730, 177678, 186626, 195574, 204522, 213470, 222417, 231365, 240313, 249261, 258209, 267157, 276104, 285052, 294000, 302948, 311896, 320843, 329791, 338739, 347687, 356635, 365583, 374530, 383478, 392426, 401374, 410322, 419270, 428217, 437165, 446113, 455061, 464009, 472957, 481904, 490852, 499800, 508748, 517696, 526643]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [范围信息]
    # 范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [聚能魔炮]\n
        更加频繁的发射强大的浓缩元素球\n
        强化后的元素球体施放时不爆炸， 攻击范围内的敌人后贯穿敌人\n
        元素球体大小 +20%\n
        施放技能时进入无敌状态
        """
        ...

    def vp_2(self):
        """
        [聚能魔炮]\n
        不发射元素球， 在生成的位置引发爆炸\n
         - 角色不会因反作用力向后移动\n
        爆炸范围 +30%\n
        可以利用[元素禁断]强制中断
        """
        ...

# 末日湮灭
# mage_male/elemental_bomber/147d005ac868e0de52b1f255eea35d62
# a5ccbaf5538981c6ef99b236c0a60b73/147d005ac868e0de52b1f255eea35d62
class Skill41(ActiveSkill):
    """
    聚集元素气息射向天空后进行融合， 制造出巨大的元素行星。\n
    融合后的元素行星垂直降落， 使碰到的敌人进入束缚状态， 并对敌人造成多段攻击伤害。\n
    随后穿透进地面的行星引起巨大的爆炸， 对范围内的敌人造成全属性的伤害。\n
    掌握[黑瞳]后会受到[元素禁断]的效果。 但是[末日湮灭]使用过程中无法强制中断并施放其他技能。
    """
    name = "末日湮灭"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "147d005ac868e0de52b1f255eea35d62"
    hasVP = False
    hasUP = False

    # 元素行星冲撞攻击力 : {value0}%
    # REMOVE: data0 = [0, 10699, 13180, 15661, 18142, 20623, 23104, 25585, 28066, 30547, 33028, 35509, 37990, 40471, 42951, 45432, 47913, 50394, 52875, 55356, 57837, 60318, 62799, 65280, 67761, 70242, 72723, 75204, 77685, 80166, 82647, 85128, 87609, 90090, 92570, 95051, 97532, 100013, 102494, 104975, 107456, 109937, 112418, 114899, 117380, 119861, 122342, 124823, 127304, 129785, 132266]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 元素行星多段攻击攻击力 : {value1}% x{value2}
    # REMOVE: data1 = [0, 892, 1098, 1305, 1512, 1719, 1925, 2132, 2339, 2546, 2752, 2959, 3166, 3373, 3579, 3786, 3993, 4200, 4406, 4613, 4820, 5027, 5233, 5440, 5647, 5853, 6060, 6267, 6474, 6680, 6887, 7094, 7301, 7507, 7714, 7921, 8128, 8334, 8541, 8748, 8955, 9161, 9368, 9575, 9782, 9988, 10195, 10402, 10609, 10815, 11022]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 元素行星爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 192584, 237241, 281898, 326555, 371212, 415869, 460526, 505184, 549841, 594498, 639155, 683812, 728469, 773126, 817783, 862440, 907098, 951755, 996412, 1041069, 1085726, 1130383, 1175040, 1219697, 1264355, 1309012, 1353669, 1398326, 1442983, 1487640, 1532297, 1576954, 1621611, 1666269, 1710926, 1755583, 1800240, 1844897, 1889554, 1934211, 1978868, 2023525, 2068183, 2112840, 2157497, 2202154, 2246811, 2291468, 2336125, 2380782]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 异瞳
# mage_male/elemental_bomber/b8257acad8c7c379aba91ee63c0bd015
# a5ccbaf5538981c6ef99b236c0a60b73/b8257acad8c7c379aba91ee63c0bd015
class Skill42(PassiveSkill):
    """
    知源·元素爆破师掌握黑暗之眼的新力量， 在自己的内心融入小宇宙。\n
    因此而溢出的魔力， 使其中一只眼睛变为异色瞳。\n
    利用[元素禁断]可以连接使用所有转职技能， 并增加基本攻击力和除[雷光链]之外的转职技能攻击力。 同时， 部分技能附加特殊效果。\n
    [元素禁断新增可强制中断的技能]\n
    [聚魔轰击]、 [启源·微观宇宙]\n
    [冰晶坠]\n
    发射全属性的水晶， 将敌人击退至前方一定距离。\n
    [雷光链]\n
    施放时， 发光球在敌人之间快速弹射， 留下雷光球后消失。 \n
    发光球体消失后， 雷光球相互连接， 引发爆炸。
    """
    name = "异瞳"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "b8257acad8c7c379aba91ee63c0bd015"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [雷光链]雷光球爆炸攻击力 : 总攻击力的{value1}%
    # REMOVE: data1 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 聚魔轰击
# mage_male/elemental_bomber/9767a375672d9519f6c1c5dff19b7c15
# a5ccbaf5538981c6ef99b236c0a60b73/9767a375672d9519f6c1c5dff19b7c15
class Skill43(ActiveSkill):
    """
    在自身周围生成小宇宙的黑暗深渊珠。 然后， 向前方释放自身黑暗之眼的魔力和深渊珠的魔力， 攻击敌人。\n
    [聚魔轰击]命中时， 增加5个元素之力。\n
    学习[异瞳]后获得[元素禁断]效果， 可以强制中断其他技能并立即使用[聚魔轰击]， 但无法强制中断[聚魔轰击]后施放其他技能。
    """
    name = "聚魔轰击"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [800, 6667]
    uuid = "9767a375672d9519f6c1c5dff19b7c15"
    hasVP = False
    hasUP = False

    # 能量释放多段攻击力 : {value0}% x{value1}
    # REMOVE: data0 = [0, 8660, 9539, 10417, 11296, 12174, 13053, 13931, 14810, 15688, 16567, 17446, 18324, 19203, 20081, 20960, 21838, 22717, 23595, 24474, 25352, 26231, 27110, 27988, 28867, 29745, 30624, 31502, 32381, 33259, 34138, 35017, 35895, 36774, 37652, 38531, 39409, 40288, 41166, 42045, 42923, 43802, 44681, 45559, 46438, 47316, 48195, 49073, 49952, 50830, 51709]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 启源·微观宇宙
# mage_male/elemental_bomber/d58681f38f393dbfd22ffdb049d97002
# a5ccbaf5538981c6ef99b236c0a60b73/d58681f38f393dbfd22ffdb049d97002
class Skill44(ActiveSkill):
    """
    瞬间激活黑暗之眼， 吸收周围的元素能量后， 知源·元素爆破师引爆全身的能量， 引发宇宙的诞生——大爆炸。\n
    学习[异瞳]后获得[元素禁断]效果， 可以强制中断其他技能并立即使用[启源·微观宇宙]， 但无法强制中断[启源·微观宇宙]后施放其他技能。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "启源·微观宇宙"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "d58681f38f393dbfd22ffdb049d97002"
    hasVP = False
    hasUP = False

    # 黑暗之眼激活攻击力 : {value0}%
    # REMOVE: data0 = [0, 61456, 75707, 89958, 104208, 118459, 132710, 146960, 161211, 175462, 189713, 203963, 218214, 232465, 246715, 260966, 275217, 289468, 303718, 317969, 332220, 346470, 360721, 374972, 389223, 403473, 417724, 431975, 446225, 460476, 474727, 488978, 503228, 517479, 531730, 545980, 560231, 574482, 588733, 602983, 617234, 631485, 645735, 659986, 674237, 688488, 702738, 716989, 731240, 745490, 759741]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 元素能量吸收多段攻击力 : {value1}% x{value2}
    # REMOVE: data1 = [0, 10243, 12618, 14993, 17368, 19743, 22118, 24493, 26869, 29244, 31619, 33994, 36369, 38744, 41119, 43494, 45869, 48245, 50620, 52995, 55370, 57745, 60120, 62495, 64870, 67246, 69621, 71996, 74371, 76746, 79121, 81496, 83871, 86247, 88622, 90997, 93372, 95747, 98122, 100497, 102872, 105247, 107623, 109998, 112373, 114748, 117123, 119498, 121873, 124248, 126624]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 大爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 430193, 529948, 629703, 729458, 829213, 928968, 1028723, 1128478, 1228233, 1327988, 1427743, 1527498, 1627253, 1727008, 1826763, 1926518, 2026273, 2126028, 2225783, 2325538, 2425293, 2525048, 2624803, 2724558, 2824313, 2924068, 3023823, 3123578, 3223333, 3323088, 3422843, 3522598, 3622353, 3722108, 3821863, 3921618, 4021373, 4121128, 4220883, 4320638, 4420393, 4520148, 4619903, 4719658, 4819413, 4919168, 5018923, 5118678, 5218433, 5318188]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'elemental_bomber'
        self.nameCN = '知源·元素爆破师'
        self.role = 'mage_male'
        self.角色 = '魔法师(男)'
        self.职业 = '元素爆破师'
        self.jobId = 'a5ccbaf5538981c6ef99b236c0a60b73'
        self.jobGrowId = '37495b941da3b1661bc900e68ef3b2c6'

        self.武器选项 = [] # TODO
        self.输出类型选项 = [] # TODO
        self.输出类型 = '' # TODO
        self.防具精通属性 = [''] # TODO
        self.防具类型 = ''
        self.buff = ... # TODO

        super().__init__(equVersion, __name__)
