#a5ccbaf5538981c6ef99b236c0a60b73
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "mage_male/swift_master/cn/skillDetail"

# 魔法旋风
# mage_male/swift_master/3c5604bdbb0240b8f130f59ab40509c3
# a5ccbaf5538981c6ef99b236c0a60b73/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
    向敌人发出无属性旋风并使其浮空。\n
    转职为次元行者后， 技能类型变为独立攻击力。\n
    - [转职为猩红法师时附加效果] -\n
    外形发生变化， 可以吸收猩红气息。\n
    - [转职为逐风者时附加效果] -\n
    增加攻击力， 可以按<X>键进行追加操作。
    """
    name = "魔法旋风"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 4 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 118, 137, 156, 174, 193, 212, 231, 250, 268, 287, 306, 325, 344, 363, 381, 400, 419, 438, 457, 475]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 131.4, 132.8, 134, 135.4, 136.5, 138, 139.1, 140.5, 141.7, 143.1, 147.7, 152.2, 157.1, 162, 166.5, 171.4, 176.2, 180.8, 185.7, 190.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # - [转职为猩红法师后] -
    # 猩红气息吸收率 : {value2}%
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # - [转职为逐风者后] -
    # 攻击力增加率 : {value3}%
    # REMOVE: data3 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 魔法冰球
# mage_male/swift_master/5dc7008b12a459325b548b0715c6b73c
# a5ccbaf5538981c6ef99b236c0a60b73/5dc7008b12a459325b548b0715c6b73c
class Skill1(ActiveSkill):
    """
    向前方发射魔法冰球。\n
    在决斗场内， 冰球大小随技能等级增加而增大。
    """
    name = "魔法冰球"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 2
    mp = [10, 84]
    uuid = "5dc7008b12a459325b548b0715c6b73c"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 695, 766, 836, 907, 977, 1048, 1118, 1189, 1259, 1330, 1400, 1471, 1541, 1612, 1682, 1753, 1823, 1894, 1964, 2035, 2105, 2176, 2246, 2317, 2387, 2458, 2528, 2599, 2669, 2740, 2810, 2881, 2951, 3022, 3092, 3163, 3233, 3304, 3374, 3445, 3515, 3586, 3656, 3727, 3797, 3868, 3938, 4009, 4079, 4150, 4220, 4291, 4361, 4432, 4502, 4573, 4643, 4714, 4784, 4855, 4925, 4996, 5066, 5137, 5207, 5278, 5348, 5419, 5489, 5560]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冰球大小 : {value1}%
    # REMOVE: data1 = [0, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278, 278]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 不死之身
# mage_male/swift_master/bb34e8854a93fd250347a1c64119f7ab
# a5ccbaf5538981c6ef99b236c0a60b73/bb34e8854a93fd250347a1c64119f7ab
class Skill2(PassiveSkill):
    """
    角色死亡后带着少量生命值原地复活， 并且进入自动恢复生命值模式。\n
    自动恢复生命值模式下， 角色的生命值值可以在一定时间内自动恢复至100%， 但无法借用任何道具或其它途径恢复生命值， 且所受到的伤害还会加剧。\n
    若在恢复模式下死亡， 则无法再次通过该技能复活。
    """
    name = "不死之身"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 8 #TODO
    rangeLv = 3
    uuid = "bb34e8854a93fd250347a1c64119f7ab"
    hasVP = False
    hasUP = False

    # 恢复模式下所受伤害增加 : {value0}%
    # REMOVE: data0 = [0, 50]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 死亡时立即恢复的生命值量 : {value1}%
    # REMOVE: data1 = [0, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 恢复模式持续时间(普通地下城) : {value2}秒
    # REMOVE: data2 = [0, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 恢复模式持续时间(亡者峡谷) : {value3}秒
    # REMOVE: data3 = [0, 60]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 黑暗之眼
# mage_male/swift_master/6e33d47e6622ce03b6defdd912140270
# a5ccbaf5538981c6ef99b236c0a60b73/6e33d47e6622ce03b6defdd912140270
class Skill3(PassiveSkill):
    """
    增加魔法师的魔法值最大值； 若魔法值低于一定比率时， 还可增加魔法值恢复速度。
    """
    name = "黑暗之眼"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 1
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False

    # 魔法值最大值增加 : {value0}%
    # REMOVE: data0 = [0, 6]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 可触发恢复效果时的魔法值比率 : {value1}%
    # REMOVE: data1 = [0, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 魔法值恢复速度增加 : {value2}倍
    # REMOVE: data2 = [0, 6]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 后跳
# mage_male/swift_master/7822d6d52e10964a6755f142c666b494
# a5ccbaf5538981c6ef99b236c0a60b73/7822d6d52e10964a6755f142c666b494
class Skill4(ActiveSkill):
    """
    使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 基础精通
# mage_male/swift_master/5a56514f35cf0270ae8d6c65f8fefd78
# a5ccbaf5538981c6ef99b236c0a60b73/5a56514f35cf0270ae8d6c65f8fefd78
class Skill5(PassiveSkill):
    """
    增加基本攻击、 前冲攻击、 跳跃攻击、 [魔法旋风]的攻击力。\n
    在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 受身蹲伏
# mage_male/swift_master/ce26c6b69d02a440a81b552bec94f03b
# a5ccbaf5538981c6ef99b236c0a60b73/ce26c6b69d02a440a81b552bec94f03b
class Skill6(ActiveSkill):
    """
    使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 防具精通
# mage_male/swift_master/892ef624d8bf3d7fc045f84825fd6104
# a5ccbaf5538981c6ef99b236c0a60b73/892ef624d8bf3d7fc045f84825fd6104
class Skill7(PassiveSkill):
    """
    穿戴防具时， 可以增加各种属性。\n
    穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False


# 擒拿掌
# mage_male/swift_master/78bd107acd474518b606be1e4fd38239
# a5ccbaf5538981c6ef99b236c0a60b73/78bd107acd474518b606be1e4fd38239
class Skill8(ActiveSkill):
    """
    抓取前方1名敌人后用力扔开， 被掷出的敌人落地时会生成冲击波并对周围的敌人造成伤害。\n
    对无法抓取的敌人不适用控制效果。\n
    转职为次元行者时， 技能类型变为独立攻击力。
    """
    name = "擒拿掌"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 4
    mp = [14, 168]
    uuid = "78bd107acd474518b606be1e4fd38239"
    hasVP = False
    hasUP = False

    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 765, 843, 921, 998, 1076, 1154, 1231, 1309, 1387, 1464, 1542, 1619, 1697, 1775, 1852, 1930, 2008, 2085, 2163, 2241, 2318, 2396, 2474, 2551, 2629, 2706, 2784, 2862, 2939, 3017, 3095, 3172, 3250, 3328, 3405, 3483, 3561, 3638, 3716, 3793, 3871, 3949, 4026, 4104, 4182, 4259, 4337, 4415, 4492, 4570, 4648, 4725, 4803, 4881, 4958, 5036, 5113, 5191, 5269, 5346, 5424, 5502, 5579, 5657, 5735, 5812, 5890, 5968, 6045, 6123]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 冲击波攻击力 : {value1}%
    # REMOVE: data1 = [0, 458, 504, 551, 597, 643, 690, 736, 783, 829, 875, 922, 968, 1015, 1061, 1108, 1154, 1200, 1247, 1293, 1340, 1386, 1433, 1479, 1525, 1572, 1618, 1665, 1711, 1758, 1804, 1850, 1897, 1943, 1990, 2036, 2083, 2129, 2175, 2222, 2268, 2315, 2361, 2408, 2454, 2500, 2547, 2593, 2640, 2686, 2733, 2779, 2825, 2872, 2918, 2965, 3011, 3058, 3104, 3150, 3197, 3243, 3290, 3336, 3383, 3429, 3475, 3522, 3568, 3615, 3661]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 魔球连射
# mage_male/swift_master/a5fa08f5d509e6ff2ebc68856a470b5a
# a5ccbaf5538981c6ef99b236c0a60b73/a5fa08f5d509e6ff2ebc68856a470b5a
class Skill9(ActiveSkill):
    """
    快速生成多个魔法球并向前连续发射。\n
    转职为元素爆破师后， 减少技能冷却时间， 发射[属性变换]中所选属性的魔法球。
    """
    name = "魔球连射"
    learnLv = 5
    masterLv = 1
    maxLv = 11
    position = 0 #TODO
    rangeLv = 2
    cd = 3
    mp = [22, 183]
    uuid = "a5fa08f5d509e6ff2ebc68856a470b5a"
    hasVP = False
    hasUP = False

    # 魔法球数量 : {value0}个
    # REMOVE: data0 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # -  [转职为元素爆破师后附加效果]  -
    # 冷却时间减少 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 幽冥火
# mage_male/swift_master/cfacda0647b9a0f595df2c2aad30c18d
# a5ccbaf5538981c6ef99b236c0a60b73/cfacda0647b9a0f595df2c2aad30c18d
class Skill10(ActiveSkill):
    """
    生成两团幽冥火， 可以增加自身的物理和魔法防御力， 且造成一定伤害， 效果持续一定时间。\n
    转职成次元行者时， 可以学习[虚妄之火]技能。\n
    学习[虚妄之火]后， 持续时间变更为无限， 且无法发动攻击。
    """
    name = "幽冥火"
    learnLv = 10
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 3
    cd = 10
    mp = [30, 345]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4, 170.4]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 每个火球增加物理防御力 : {value1}
    # REMOVE: data1 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 每个火球增加魔法防御力 : {value2}
    # REMOVE: data2 = [0, 2136, 2394, 2664, 2951, 3246, 3560, 3887, 4230, 4587, 4956, 5343, 5740, 6153, 6582, 7022, 7481, 7948, 8433, 8936, 9449]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 每个火球的攻击力 : {value3}%
    # REMOVE: data3 = [0, 814, 944, 1074, 1203, 1333, 1463, 1593, 1722, 1852, 1982, 2112, 2241, 2371, 2501, 2631, 2761, 2890, 3020, 3150, 3280]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # - [虚妄之火效果] -
    # 物理防御力增加 : {value4}
    # REMOVE: data4 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)
    # 魔法防御力增加 : {value5}
    # REMOVE: data5 = [0, 16906, 18784, 20664, 22542, 24422, 26298, 28178, 30056, 31936, 33814, 35690, 37570, 39448, 41328, 43204, 45086, 46962, 48842, 50720, 52596]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5, lambda x = None: x)

# 瞬移
# mage_male/swift_master/3d8f3d438405d79f8d3ed68072674d1e
# a5ccbaf5538981c6ef99b236c0a60b73/3d8f3d438405d79f8d3ed68072674d1e
class Skill11(ActiveSkill):
    """
    向指定方向快速移动一定距离。
    """
    name = "瞬移"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 9 #TODO
    rangeLv = 2
    cd = 1.5
    mp = [40, 40]
    uuid = "3d8f3d438405d79f8d3ed68072674d1e"
    hasVP = False
    hasUP = False

    # X轴移动距离 : {value0}px
    # REMOVE: data0 = [0, 400]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # Y轴移动距离 : {value1}px
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 旋火盾
# mage_male/swift_master/8ee0099656df08a0b39225f8a21d514b
# a5ccbaf5538981c6ef99b236c0a60b73/8ee0099656df08a0b39225f8a21d514b
class Skill12(ActiveSkill):
    """
    生成火焰盾牌并向前发射， 使其攻击敌人。 \n
    持续输入按键可维持持盾状态， 减少敌人远程攻击的伤害。
    """
    name = "旋火盾"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 4
    mp = [31, 259]
    uuid = "8ee0099656df08a0b39225f8a21d514b"
    hasVP = False
    hasUP = False

    # 盾牌攻击力 : {value0}%
    # REMOVE: data0 = [0, 2765, 3046, 3326, 3607, 3887, 4168, 4448, 4729, 5009, 5290, 5570, 5851, 6131, 6412, 6692, 6973, 7253, 7534, 7814, 8095, 8375, 8656, 8936, 9217, 9497, 9778, 10058, 10339, 10619, 10900, 11180, 11461, 11741, 12022, 12302, 12583, 12863, 13144, 13424, 13705, 13985, 14266, 14546, 14827, 15107, 15388, 15668, 15949, 16229, 16510, 16790, 17071, 17351, 17632, 17912, 18193, 18473, 18754, 19034, 19315, 19595, 19876, 20156, 20437, 20717, 20998, 21278, 21559, 21839, 22120]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 所受伤害减少率 (远程) : {value1}%
    # REMOVE: data1 = [0, 22, 23, 23, 24, 24, 24, 25, 25, 26, 26, 26, 27, 27, 28, 28, 28, 29, 29, 30, 30, 30, 31, 31, 32, 32, 32, 33, 33, 34, 34, 34, 35, 35, 36, 36, 36, 37, 37, 38, 38, 38, 39, 39, 40, 40, 40, 41, 41, 42, 42, 42, 43, 43, 44, 44, 44, 45, 45, 46, 46, 46, 47, 47, 48, 48, 48, 49, 49, 50, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 盾牌前进距离 : {value2}px
    # REMOVE: data2 = [0, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450, 450]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 强化 - 后跳
# mage_male/swift_master/2b340542e776818b78f3212af184bd6b
# a5ccbaf5538981c6ef99b236c0a60b73/2b340542e776818b78f3212af184bd6b
class Skill13(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 跃翔
# mage_male/swift_master/1fea5a626f15230237946a11a9d11582
# a5ccbaf5538981c6ef99b236c0a60b73/1fea5a626f15230237946a11a9d11582
class Skill14(ActiveSkill):
    """
    增加自身20%的跳跃力， 效果持续一定时间。\n
    效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    icon = "$common/$uuid"
    hasVP = False
    hasUP = False

    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 冰魄剑
# mage_male/swift_master/f2fb27162beb0b87a7cb9af7900e95f2
# a5ccbaf5538981c6ef99b236c0a60b73/f2fb27162beb0b87a7cb9af7900e95f2
class Skill15(ActiveSkill):
    """
    生成冰魄剑连续攻击敌人。 第1击和第2击使敌人进入僵直状态， 第3击则可以击退敌人， 并有一定几率使敌人进入减速状态。\n
    转职成为冰结师时， 才可以强制中断基本攻击动作， 并立即施放该技能。
    """
    name = "冰魄剑"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 0 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 280]
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"
    hasVP = False
    hasUP = True

    # 第1击和第2击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1846, 2034, 2221, 2408, 2595, 2783, 2970, 3157, 3345, 3532, 3719, 3907, 4094, 4281, 4468, 4656, 4843, 5030, 5218, 5405, 5592, 5780, 5967, 6154, 6341, 6529, 6716, 6903, 7091, 7278, 7465, 7653, 7840, 8027, 8214, 8402, 8589, 8776, 8964, 9151, 9338, 9526, 9713, 9900, 10087, 10275, 10462, 10649, 10837, 11024, 11211, 11399, 11586, 11773, 11960, 12148, 12335, 12522, 12710, 12897, 13084, 13272, 13459, 13646, 13833, 14021, 14208, 14395, 14583, 14770]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 第3击攻击力 : {value1}%
    # REMOVE: data1 = [0, 2216, 2440, 2665, 2890, 3115, 3339, 3564, 3789, 4014, 4238, 4463, 4688, 4913, 5137, 5362, 5587, 5812, 6036, 6261, 6486, 6711, 6935, 7160, 7385, 7610, 7835, 8059, 8284, 8509, 8734, 8958, 9183, 9408, 9633, 9857, 10082, 10307, 10532, 10756, 10981, 11206, 11431, 11655, 11880, 12105, 12330, 12555, 12779, 13004, 13229, 13454, 13678, 13903, 14128, 14353, 14577, 14802, 15027, 15252, 15476, 15701, 15926, 16151, 16375, 16600, 16825, 17050, 17274, 17499, 17724]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [减速效果]
    # 减速几率 : {value2}%
    # REMOVE: data2 = [0, 20, 21, 23, 24, 26, 27, 28, 30, 31, 32, 34, 35, 37, 38, 39, 41, 42, 43, 45, 46, 48, 49, 50, 52, 53, 54, 56, 57, 59, 60, 61, 63, 64, 66, 67, 68, 70, 71, 72, 74, 75, 77, 78, 79, 81, 82, 83, 85, 86, 88, 89, 90, 92, 93, 94, 96, 97, 99, 100, 101, 103, 104, 106, 107, 108, 110, 111, 112, 114, 115]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 减速持续时间 : {value3}秒
    # REMOVE: data3 = [0, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5, 1.5]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 攻击范围比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 疾风掌控
# mage_male/swift_master/47bd4871f29defc2a0021ee9261d7a5b
# a5ccbaf5538981c6ef99b236c0a60b73/47bd4871f29defc2a0021ee9261d7a5b
class Skill16(PassiveSkill):
    """
    熟练使用风的力量， 掌握该技能后会增加移动速度， 施放[魔法旋风]后可以通过X键追加攻击， 还可以在空中进行冲刺攻击以及追加跳跃。\n
    使用追加跳跃后， 连续按下跳跃键可以缓慢降落。\n
    逐风者掌握了高机动性战斗技巧， 在进行基本攻击、 跳跃攻击、 冲刺攻击时， 在自身周围产生旋风。\n
    在决斗场内， 无法使用追加跳跃以及缓慢降落。
    """
    name = "疾风掌控"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 2 #TODO
    rangeLv = 1
    uuid = "47bd4871f29defc2a0021ee9261d7a5b"
    hasVP = False
    hasUP = False

    # 移动速度增加 : {value0}%
    # REMOVE: data0 = [0, 5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 空中冲刺冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 0.8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 可施放空中冲刺的最低高度 : {value2}px
    # REMOVE: data2 = [0, 50]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 狂风冲刺
# mage_male/swift_master/669f1428193f61f9d92c743b72438c4d
# a5ccbaf5538981c6ef99b236c0a60b73/669f1428193f61f9d92c743b72438c4d
class Skill17(ActiveSkill):
    """
    利用风的力量， 瞬间冲刺一段距离。 在空中也可以施放， 冲刺过程中， 将对碰到的敌人给予伤害和僵直效果， 并在一定时间内， 可通过追加操作再进行冲刺。 可强制中断当前施放中的技能， 并立即施放[狂风冲刺]。\n
    在决斗场中， 无法在空中施放。
    """
    name = "狂风冲刺"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    mp = [31, 185]
    uuid = "669f1428193f61f9d92c743b72438c4d"
    hasVP = False
    hasUP = True

    # 冲刺攻击力 : {value0}%
    # REMOVE: data0 = [0, 777, 856, 935, 1013, 1092, 1171, 1250, 1329, 1408, 1486, 1565, 1644, 1723, 1802, 1881, 1959, 2038, 2117, 2196, 2275, 2354, 2432, 2511, 2590, 2669, 2748, 2826, 2905, 2984, 3063, 3142, 3221, 3299, 3378, 3457, 3536, 3615, 3694, 3772, 3851, 3930, 4009, 4088, 4167, 4245, 4324, 4403, 4482, 4561, 4639, 4718, 4797, 4876, 4955, 5034, 5112, 5191, 5270, 5349, 5428, 5507, 5585, 5664, 5743, 5822, 5901, 5980, 6058, 6137, 6216]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 追加操作时间限制 : {value2}秒
    # REMOVE: data2 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 可追加操作次数 : {value3}次
    # REMOVE: data3 = [0, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 冲刺距离 : {value4}px
    # REMOVE: data4 = [0, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280, 280]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 回风斩
# mage_male/swift_master/8510294202d0e042dd29a2422fc6770d
# a5ccbaf5538981c6ef99b236c0a60b73/8510294202d0e042dd29a2422fc6770d
class Skill18(ActiveSkill):
    """
    引发锋利的寒风攻击周围的敌人。
    """
    name = "回风斩"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 5.5
    mp = [38, 227]
    uuid = "8510294202d0e042dd29a2422fc6770d"
    hasVP = False
    hasUP = True

    # 风击攻击力 : {value0}%
    # REMOVE: data0 = [0, 1744, 1921, 2098, 2275, 2452, 2629, 2806, 2982, 3159, 3336, 3513, 3690, 3867, 4044, 4221, 4398, 4575, 4752, 4929, 5106, 5283, 5459, 5636, 5813, 5990, 6167, 6344, 6521, 6698, 6875, 7052, 7229, 7406, 7583, 7760, 7936, 8113, 8290, 8467, 8644, 8821, 8998, 9175, 9352, 9529, 9706, 9883, 10060, 10237, 10413, 10590, 10767, 10944, 11121, 11298, 11475, 11652, 11829, 12006, 12183, 12360, 12537, 12714, 12890, 13067, 13244, 13421, 13598, 13775, 13952]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 疾风之棍棒精通
# mage_male/swift_master/087d1068ff506d090710566608a17760
# a5ccbaf5538981c6ef99b236c0a60b73/087d1068ff506d090710566608a17760
class Skill19(PassiveSkill):
    """
    增加武器的物理攻击力， 减少除[万象风龙阵]、 [无限风域]、 [风之极·永坠]之外技能的冷却时间。 使用棍棒系列武器攻击敌人时， 武器上凝聚风之力， 可以增加命中率、 攻击速度和物理暴击率
    """
    name = "疾风之棍棒精通"
    learnLv = 15
    masterLv = 20
    maxLv = 30
    position = 8 #TODO
    rangeLv = 3
    uuid = "087d1068ff506d090710566608a17760"
    hasVP = False
    hasUP = False

    # 物理攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 命中率增加 : {value1}%
    # REMOVE: data1 = [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 攻击速度增加 : {value2}%
    # REMOVE: data2 = [0, 0.5, 1, 1.5, 2, 2.5, 3, 3.5, 4, 4.5, 5, 5.5, 6, 6.5, 7, 7.5, 8, 8.5, 9, 9.5, 10, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 冷却时间减少率 : {value3}%
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 物理暴击率增加 : {value4}%
    # REMOVE: data4 = [0, 10.5, 11, 11.5, 12, 12.5, 13, 13.5, 14, 14.5, 15, 15.5, 16, 16.5, 17, 17.5, 18, 18.5, 19, 19.5, 20, 20.5, 21, 21.5, 22, 22.5, 23, 23.5, 24, 24.5, 25]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 流风诀
# mage_male/swift_master/38612d8f2561edc2eb68d5057a837bfa
# a5ccbaf5538981c6ef99b236c0a60b73/38612d8f2561edc2eb68d5057a837bfa
class Skill20(ActiveSkill):
    """
    在逐风者周围聚集风的力量， 增加攻击力以及防御能力。增加自身回避率， 并且增加物理/魔法防御力。
    """
    name = "流风诀"
    learnLv = 20
    masterLv = 20
    maxLv = 30
    position = 5 #TODO
    rangeLv = 3
    cd = 5
    uuid = "38612d8f2561edc2eb68d5057a837bfa"
    hasVP = False
    hasUP = False

    # 基本攻击和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 回避率增加 : {value1}%
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 物理防御力增加 : {value2}
    # REMOVE: data2 = [0, 10108, 10640, 11172, 11704, 12236, 12768, 13300, 13832, 14364, 14896, 15427, 15959, 16491, 17023, 17555, 18087, 18619, 19151, 19683, 20215, 20747, 21279, 21811, 22343, 22875, 23407, 23939, 24471, 25003, 25535]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 魔法防御力增加 : {value3}
    # REMOVE: data3 = [0, 10108, 10640, 11172, 11704, 12236, 12768, 13300, 13832, 14364, 14896, 15427, 15959, 16491, 17023, 17555, 18087, 18619, 19151, 19683, 20215, 20747, 21279, 21811, 22343, 22875, 23407, 23939, 24471, 25003, 25535]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 持续时间 : {value4}秒
    # REMOVE: data4 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 朔风牵引
# mage_male/swift_master/a2d943797daca862a6f321aca6ac9bfa
# a5ccbaf5538981c6ef99b236c0a60b73/a2d943797daca862a6f321aca6ac9bfa
class Skill21(ActiveSkill):
    """
    在前方产生逆风， 将敌人吸附到角色周围， 甚至可以将倒地状态的敌人吸附过来。 逆风效果只对地面上的敌人有效。 可以强制中断逆风并立即施放其他技能， 或反之也可以。\n
    在决斗场中， 无法拉起倒地状态的敌人。\n
    - [可强制中断的技能] -\n
    [狂风冲刺]、 [回风斩]、 [游离之风]、 [风鸣冲击]、 [双翼风刃]、 [风暴之眼]、 [真空旋风破]、 [风暴之拳]、 [疾风瞬影闪]、 [风卷残云]
    """
    name = "朔风牵引"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 10
    mp = [45, 268]
    uuid = "a2d943797daca862a6f321aca6ac9bfa"
    hasVP = False
    hasUP = True

    # 逆风攻击力 : {value0}%
    # REMOVE: data0 = [0, 1102, 1214, 1326, 1437, 1549, 1661, 1773, 1885, 1996, 2108, 2220, 2332, 2444, 2555, 2667, 2779, 2891, 3003, 3114, 3226, 3338, 3450, 3562, 3673, 3785, 3897, 4009, 4121, 4232, 4344, 4456, 4568, 4680, 4791, 4903, 5015, 5127, 5238, 5350, 5462, 5574, 5686, 5797, 5909, 6021, 6133, 6245, 6356, 6468, 6580, 6692, 6804, 6915, 7027, 7139, 7251, 7363, 7474, 7586, 7698, 7810, 7922, 8033, 8145, 8257, 8369, 8481, 8592, 8704, 8816]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 暴击
# mage_male/swift_master/fc1262c19f3d0477ee8eda47b8db8696
# a5ccbaf5538981c6ef99b236c0a60b73/fc1262c19f3d0477ee8eda47b8db8696
class Skill22(PassiveSkill):
    """
    集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False

    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 游离之风
# mage_male/swift_master/b3659936a9a74c4ed6f7faf07cca1f9e
# a5ccbaf5538981c6ef99b236c0a60b73/b3659936a9a74c4ed6f7faf07cca1f9e
class Skill23(ActiveSkill):
    """
    生成向前方移动的旋风攻击敌人。 旋风能将敌人旋转起来， 给敌人造成伤害后消失。
    """
    name = "游离之风"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 7
    mp = [45, 268]
    uuid = "b3659936a9a74c4ed6f7faf07cca1f9e"
    hasVP = False
    hasUP = True

    # 旋风攻击力 : {value0}%
    # REMOVE: data0 = [0, 2468, 2718, 2969, 3219, 3470, 3720, 3970, 4221, 4471, 4721, 4972, 5222, 5473, 5723, 5973, 6224, 6474, 6724, 6975, 7225, 7476, 7726, 7976, 8227, 8477, 8727, 8978, 9228, 9479, 9729, 9979, 10230, 10480, 10730, 10981, 11231, 11482, 11732, 11982, 12233, 12483, 12733, 12984, 13234, 13485, 13735, 13985, 14236, 14486, 14736, 14987, 15237, 15488, 15738, 15988, 16239, 16489, 16739, 16990, 17240, 17491, 17741, 17991, 18242, 18492, 18742, 18993, 19243, 19494, 19744]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋风攻击次数 : {value1}次
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 风鸣冲击
# mage_male/swift_master/6a1d1f08a6572be420bb3a256c44c015
# a5ccbaf5538981c6ef99b236c0a60b73/6a1d1f08a6572be420bb3a256c44c015
class Skill24(ActiveSkill):
    """
    将风聚集在手中向前方发射， 击退受到伤害的敌人。\n
    在决斗场中， 无法击退霸体状态的敌人。
    """
    name = "风鸣冲击"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 8.5
    mp = [61, 366]
    uuid = "6a1d1f08a6572be420bb3a256c44c015"
    hasVP = False
    hasUP = True

    # 爆炸攻击力 : {value0}%
    # REMOVE: data0 = [0, 13195, 14534, 15872, 17211, 18549, 19888, 21227, 22565, 23904, 25243, 26581, 27920, 29258, 30597, 31936, 33274, 34613, 35952, 37290, 38629, 39967, 41306, 42645, 43983, 45322, 46661, 47999, 49338, 50676, 52015, 53354, 54692, 56031, 57370, 58708, 60047, 61385, 62724, 64063, 65401, 66740, 68079, 69417, 70756, 72094, 73433, 74772, 76110, 77449, 78788, 80126, 81465, 82803, 84142, 85481, 86819, 88158, 89497, 90835, 92174, 93512, 94851, 96190, 97528, 98867, 100206, 101544, 102883, 104221, 105560]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 双翼风刃
# mage_male/swift_master/c7bf7ccab413009640e65ca6f2f0263a
# a5ccbaf5538981c6ef99b236c0a60b73/c7bf7ccab413009640e65ca6f2f0263a
class Skill25(ActiveSkill):
    """
    双手连续发射旋风。 敌人会被吸附到旋风中心。
    """
    name = "双翼风刃"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 14
    mp = [91, 545]
    uuid = "c7bf7ccab413009640e65ca6f2f0263a"
    hasVP = False
    hasUP = True

    # 旋风攻击力 : {value0}%
    # REMOVE: data0 = [0, 4889, 5385, 5881, 6377, 6873, 7369, 7865, 8361, 8857, 9353, 9849, 10345, 10841, 11337, 11833, 12329, 12825, 13321, 13817, 14313, 14809, 15305, 15801, 16297, 16793, 17289, 17785, 18281, 18777, 19273, 19769, 20265, 20761, 21257, 21753, 22248, 22744, 23240, 23736, 24232, 24728, 25224, 25720, 26216, 26712, 27208, 27704, 28200, 28696, 29192, 29688, 30184, 30680, 31176, 31672, 32168, 32664, 33160, 33656, 34152, 34648, 35144, 35640, 36136, 36632, 37128, 37624, 38120, 38616, 39112]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋风攻击次数 : {value1}次
    # REMOVE: data1 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value2}%
    # REMOVE: data2 = [0, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128, 128]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

# 风之意志
# mage_male/swift_master/5f4c55fe2ebdf0623bd76d4fda872ddc
# a5ccbaf5538981c6ef99b236c0a60b73/5f4c55fe2ebdf0623bd76d4fda872ddc
class Skill26(PassiveSkill):
    """
    逐风者运用风的力量， 增加基本攻击力和转职技能攻击力。
    """
    name = "风之意志"
    learnLv = 30
    masterLv = 5
    maxLv = 15
    position = 4 #TODO
    rangeLv = 3
    uuid = "5f4c55fe2ebdf0623bd76d4fda872ddc"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 4, 5.5, 7, 8.5, 10, 11.5, 13, 14.5, 16, 17.5, 19, 20.5, 22, 23.5, 25]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 刃风
# mage_male/swift_master/128b9ddef2262f40723deae4407bdb42
# a5ccbaf5538981c6ef99b236c0a60b73/128b9ddef2262f40723deae4407bdb42
class Skill27(ActiveSkill):
    """
    将风环绕在身体周围， 瞬间加速靠近附近一定范围内最强的敌人 (领主 > 稀有 > 普通) 的后方并攻击敌人。\n
    在敌人发现自己之前， 出现在另一边， 发动锋利的风刃攻击， 然后将移动路径上留下的风凝缩并引爆， 对周围敌人造成伤害。\n
    该技能可以在空中施放。\n
    风刃命中时， 可以强制中断当前动作并立即施放其他技能； 也可以强制中断其他技能并立即施放[刃风]。\n
    - [可强制中断的技能] -\n
    [狂风冲刺]、 [回风斩]、 [游离之风]、 [风鸣冲击]、 [朔风牵引]、 [双翼风刃]、 [风暴之眼]、 [真空旋风破]、 [风暴之拳]、 [疾风瞬影闪]、 [风卷残云]、 [怒风狂涌]
    """
    name = "刃风"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 18
    mp = [132, 1108]
    uuid = "128b9ddef2262f40723deae4407bdb42"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 近距离攻击力 : {value0}%
    # REMOVE: data0 = [0, 6555, 7220, 7886, 8551, 9216, 9881, 10546, 11211, 11876, 12541, 13206, 13871, 14536, 15201, 15866, 16531, 17196, 17861, 18526, 19191, 19856, 20521, 21186, 21851, 22516, 23182, 23847, 24512, 25177, 25842, 26507, 27172, 27837, 28502, 29167, 29832, 30497, 31162, 31827, 32492, 33157, 33822, 34487, 35152, 35817, 36482, 37147, 37813, 38478, 39143, 39808, 40473, 41138, 41803, 42468, 43133, 43798, 44463, 45128, 45793, 46458, 47123, 47788, 48453, 49118, 49783, 50448, 51113, 51778, 52443]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 空中切割攻击力 : {value1}%
    # REMOVE: data1 = [0, 3829, 4218, 4606, 4995, 5383, 5772, 6160, 6548, 6937, 7325, 7714, 8102, 8491, 8879, 9268, 9656, 10045, 10433, 10822, 11210, 11599, 11987, 12375, 12764, 13152, 13541, 13929, 14318, 14706, 15095, 15483, 15872, 16260, 16649, 17037, 17426, 17814, 18202, 18591, 18979, 19368, 19756, 20145, 20533, 20922, 21310, 21699, 22087, 22476, 22864, 23253, 23641, 24029, 24418, 24806, 25195, 25583, 25972, 26360, 26749, 27137, 27526, 27914, 28303, 28691, 29080, 29468, 29856, 30245, 30633]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 地上切割攻击力 : {value2}%
    # REMOVE: data2 = [0, 5191, 5718, 6244, 6771, 7297, 7824, 8351, 8877, 9404, 9931, 10457, 10984, 11510, 12037, 12564, 13090, 13617, 14143, 14670, 15197, 15723, 16250, 16777, 17303, 17830, 18356, 18883, 19410, 19936, 20463, 20990, 21516, 22043, 22569, 23096, 23623, 24149, 24676, 25202, 25729, 26256, 26782, 27309, 27836, 28362, 28889, 29415, 29942, 30469, 30995, 31522, 32049, 32575, 33102, 33628, 34155, 34682, 35208, 35735, 36261, 36788, 37315, 37841, 38368, 38895, 39421, 39948, 40474, 41001, 41528]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 凝缩爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 11388, 12543, 13698, 14854, 16009, 17164, 18319, 19475, 20630, 21785, 22941, 24096, 25251, 26406, 27562, 28717, 29872, 31027, 32183, 33338, 34493, 35649, 36804, 37959, 39114, 40270, 41425, 42580, 43736, 44891, 46046, 47201, 48357, 49512, 50667, 51822, 52978, 54133, 55288, 56444, 57599, 58754, 59909, 61065, 62220, 63375, 64531, 65686, 66841, 67996, 69152, 70307, 71462, 72617, 73773, 74928, 76083, 77239, 78394, 79549, 80704, 81860, 83015, 84170, 85326, 86481, 87636, 88791, 89947, 91102]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # [范围信息]
    # 风刃大小比率 : {value4}%
    # REMOVE: data4 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

    def vp_1(self):
        """
        [刃风]\n
        抓取过程中进入无敌状态\n
        追踪范围 +20%
        """
        ...

    def vp_2(self):
        """
        [刃风]\n
        施放后命中敌人时， 对目标发动刃风剑气\n
         - 可以在其他动作中施放\n
         - 发动刃风剑气后， 可以再次施放\n
         - 发动刃风剑气时， 初始化[狂风冲刺]冷却时间\n
         - 总攻击力相同\n
        变更为可填充3次的技能\n
         - 攻击力 -67%
        """
        ...

# 风暴之眼
# mage_male/swift_master/ecc23c980ea71450c0ad0c3fd232f329
# a5ccbaf5538981c6ef99b236c0a60b73/ecc23c980ea71450c0ad0c3fd232f329
class Skill28(ActiveSkill):
    """
    在自身周围生成小型风暴吸附敌人， 然后爆发出风暴的力量， 给敌人造成伤害并浮空。
    """
    name = "风暴之眼"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cube = 1
    cd = 16
    mp = [128, 766]
    uuid = "ecc23c980ea71450c0ad0c3fd232f329"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 风暴攻击力 : {value0}%
    # REMOVE: data0 = [0, 18568, 20452, 22335, 24219, 26103, 27987, 29870, 31754, 33638, 35521, 37405, 39289, 41173, 43056, 44940, 46824, 48707, 50591, 52475, 54358, 56242, 58126, 60010, 61893, 63777, 65661, 67544, 69428, 71312, 73196, 75079, 76963, 78847, 80730, 82614, 84498, 86382, 88265, 90149, 92033, 93916, 95800, 97684, 99568, 101451, 103335, 105219, 107102, 108986, 110870, 112754, 114637, 116521, 118405, 120288, 122172, 124056, 125939, 127823, 129707, 131591, 133474, 135358, 137242, 139125, 141009, 142893, 144777, 146660, 148544]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

    def vp_1(self):
        """
        [风暴之眼]\n
        直接爆发风暴的力量\n
        冷却时间及攻击力 +100%
        """
        ...

    def vp_2(self):
        """
        [风暴之眼]\n
        大小 +50%\n
        结束后生成持续吸附敌人的风暴
        """
        ...

# 真空旋风破
# mage_male/swift_master/1b1cfab062e0768bcc889e33e1f30dbf
# a5ccbaf5538981c6ef99b236c0a60b73/1b1cfab062e0768bcc889e33e1f30dbf
class Skill29(ActiveSkill):
    """
    生成龙卷风制压敌人。 施放后先将敌人吸附到龙卷风中心， 然后引发爆炸并给敌人造成伤害。
    """
    name = "真空旋风破"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [164, 983]
    uuid = "1b1cfab062e0768bcc889e33e1f30dbf"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 龙卷风攻击力 : {value0}%
    # REMOVE: data0 = [0, 1664, 1833, 2002, 2170, 2339, 2508, 2677, 2846, 3014, 3183, 3352, 3521, 3690, 3858, 4027, 4196, 4365, 4534, 4702, 4871, 5040, 5209, 5378, 5546, 5715, 5884, 6053, 6222, 6390, 6559, 6728, 6897, 7066, 7234, 7403, 7572, 7741, 7910, 8078, 8247, 8416, 8585, 8754, 8922, 9091, 9260, 9429, 9598, 9766, 9935, 10104, 10273, 10442, 10610, 10779, 10948, 11117, 11286, 11455, 11623, 11792, 11961, 12130, 12299, 12467, 12636, 12805, 12974, 13143, 13311]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 13333, 14685, 16038, 17390, 18743, 20096, 21448, 22801, 24153, 25506, 26859, 28211, 29564, 30916, 32269, 33621, 34974, 36327, 37679, 39032, 40384, 41737, 43090, 44442, 45795, 47147, 48500, 49853, 51205, 52558, 53910, 55263, 56615, 57968, 59321, 60673, 62026, 63378, 64731, 66084, 67436, 68789, 70141, 71494, 72847, 74199, 75552, 76904, 78257, 79609, 80962, 82315, 83667, 85020, 86372, 87725, 89078, 90430, 91783, 93135, 94488, 95841, 97193, 98546, 99898, 101251, 102603, 103956, 105309, 106661]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 龙卷风多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [真空旋风破]\n
        施放技能后可以移动\n
        攻击时间 -30%\n
        大小 +30%
        """
        ...

    def vp_2(self):
        """
        [휘몰아치는 바람]\n
        일정 범위 내 가장 강한 적의 위치에서 회오리 생성\n
         - 회오리가 적을 지속적으로 추적\n
         - 홀드 및 적 모으기 기능 삭제
        """
        ...

# 风暴之拳
# mage_male/swift_master/c77a417c43de80c4ce32c1ed405d174a
# a5ccbaf5538981c6ef99b236c0a60b73/c77a417c43de80c4ce32c1ed405d174a
class Skill30(ActiveSkill):
    """
    聚集风的力量， 施展致命的重拳。 若被重拳命中， 则会引发风暴并给予多段伤害。 若使用方向键， 可以向前突进并施展重拳。
    """
    name = "风暴之拳"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [311, 1866]
    uuid = "c77a417c43de80c4ce32c1ed405d174a"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 重拳攻击力 : {value0}%
    # REMOVE: data0 = [0, 41088, 45257, 49425, 53593, 57762, 61930, 66099, 70267, 74435, 78604, 82772, 86941, 91109, 95277, 99446, 103614, 107782, 111951, 116119, 120288, 124456, 128624, 132793, 136961, 141129, 145298, 149466, 153635, 157803, 161971, 166140, 170308, 174477, 178645, 182813, 186982, 191150, 195318, 199487, 203655, 207824, 211992, 216160, 220329, 224497, 228665, 232834, 237002, 241171, 245339, 249507, 253676, 257844, 262013, 266181, 270349, 274518, 278686, 282854, 287023, 291191, 295360, 299528, 303696, 307865, 312033, 316201, 320370, 324538, 328707]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 风暴多段攻击力 : {value1}%
    # REMOVE: data1 = [0, 3524, 3881, 4238, 4596, 4953, 5311, 5668, 6026, 6383, 6741, 7098, 7456, 7813, 8171, 8528, 8885, 9243, 9600, 9958, 10315, 10673, 11030, 11388, 11745, 12103, 12460, 12817, 13175, 13532, 13890, 14247, 14605, 14962, 15320, 15677, 16035, 16392, 16750, 17107, 17464, 17822, 18179, 18537, 18894, 19252, 19609, 19967, 20324, 20682, 21039, 21397, 21754, 22111, 22469, 22826, 23184, 23541, 23899, 24256, 24614, 24971, 25329, 25686, 26044, 26401, 26758, 27116, 27473, 27831, 28188]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 风暴多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [风暴之拳]\n
        聚集前方的敌人后施展重拳\n
        删除风暴攻击\n
         - 总攻击力相同\n
        大小 +30%
        """
        ...

    def vp_2(self):
        """
        [风暴之拳]\n
        在原地施放\n
        删除重拳攻击伤害\n
         - 总攻击力相同\n
        在准备重拳时再次按部分技能键， 将生成强化风暴\n
         - 目标技能 : [风卷残云]、 [游龙惊风破]、 [九霄风雷]\n
         - 并入再次按下的技能伤害量
        """
        ...

# 御风之力
# mage_male/swift_master/852f8ad797db4dca1405cb3e77198401
# a5ccbaf5538981c6ef99b236c0a60b73/852f8ad797db4dca1405cb3e77198401
class Skill31(PassiveSkill):
    """
    接受风神的力量， 变得更加锐利和敏捷。\n
    增加暴击伤害和移动速度。
    """
    name = "御风之力"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "852f8ad797db4dca1405cb3e77198401"
    hasVP = False
    hasUP = False

    # 暴击攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 4.5, 6.5, 8.5, 10.5, 12.5, 14.5, 16.5, 18.5, 20.5, 22.5, 24.5, 26.5, 28.5, 30.5, 32.5, 34.5, 36.5, 38.5, 40.5, 42.5, 44.5, 46.5, 48.5, 50.5, 52.5, 54.5, 56.5, 58.5, 60.5, 62.5, 64.5, 66.5, 68.5, 70.5, 72.5, 74.5, 76.5, 78.5, 80.5, 82.5, 84.5, 86.5, 88.5, 90.5, 92.5, 94.5, 96.5, 98.5, 100.5, 102.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 移动速度增加 : {value1}%
    # REMOVE: data1 = [0, 5, 5.3, 5.6, 5.9, 6.2, 6.5, 6.8, 7.1, 7.4, 7.7, 8, 8.3, 8.6, 8.9, 9.2, 9.5, 9.8, 10.1, 10.4, 10.7, 11, 11.3, 11.6, 11.9, 12.2, 12.5, 12.8, 13.1, 13.4, 13.7, 14, 14.3, 14.6, 14.9, 15.2, 15.5, 15.8, 16.1, 16.4, 16.7, 17, 17.3, 17.6, 17.9, 18.2, 18.5, 18.8, 19.1, 19.4, 19.7]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)

# 万象风龙阵
# mage_male/swift_master/0b8db1e10b3abbd24d38564e708675d5
# a5ccbaf5538981c6ef99b236c0a60b73/0b8db1e10b3abbd24d38564e708675d5
class Skill32(ActiveSkill):
    """
    召唤飓风， 将地面上的所有敌人横扫一空。 飓风飞速旋转并粉碎敌人。
    """
    name = "万象风龙阵"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [600, 5040]
    uuid = "0b8db1e10b3abbd24d38564e708675d5"
    hasVP = False
    hasUP = False

    # 飓风攻击力 : {value0}%
    # REMOVE: data0 = [0, 868, 1069, 1270, 1472, 1673, 1874, 2076, 2277, 2478, 2679, 2881, 3082, 3283, 3484, 3686, 3887, 4088, 4289, 4491, 4692, 4893, 5094, 5296, 5497, 5698, 5900, 6101, 6302, 6503, 6705, 6906, 7107, 7308, 7510, 7711, 7912, 8113, 8315, 8516, 8717, 8918, 9120, 9321, 9522, 9724, 9925, 10126, 10327, 10529, 10730]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 飓风爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 15560, 19168, 22776, 26384, 29992, 33600, 37208, 40816, 44424, 48032, 51640, 55248, 58856, 62464, 66072, 69681, 73289, 76897, 80505, 84113, 87721, 91329, 94937, 98545, 102153, 105761, 109369, 112977, 116585, 120193, 123801, 127409, 131017, 134625, 138234, 141842, 145450, 149058, 152666, 156274, 159882, 163490, 167098, 170706, 174314, 177922, 181530, 185138, 188746, 192354]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 飓风多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56, 56]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 飓风爆炸次数 : {value3}次
    # REMOVE: data3 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

# 疾风瞬影闪
# mage_male/swift_master/dcb31a63ef58954f44ff2070c42a9a98
# a5ccbaf5538981c6ef99b236c0a60b73/dcb31a63ef58954f44ff2070c42a9a98
class Skill33(ActiveSkill):
    """
    生成风之剑， 向前突进并疯狂砍伤敌人。 被风刃割伤的敌人， 会追加受到疾风的伤害。 按向前方向键时， 可以增加突进距离。
    """
    name = "疾风瞬影闪"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [220, 1320]
    uuid = "dcb31a63ef58954f44ff2070c42a9a98"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 风之剑攻击力 : {value0}%
    # REMOVE: data0 = [0, 6054, 6668, 7282, 7897, 8511, 9125, 9739, 10353, 10967, 11582, 12196, 12810, 13424, 14038, 14652, 15267, 15881, 16495, 17109, 17723, 18337, 18952, 19566, 20180, 20794, 21408, 22023, 22637, 23251, 23865, 24479, 25093, 25708, 26322, 26936, 27550, 28164, 28778, 29393, 30007, 30621, 31235, 31849, 32463, 33078, 33692, 34306, 34920, 35534, 36149]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 风之剑多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)

    def vp_1(self):
        """
        [疾风瞬影闪]\n
        在原地生成疾风\n
         - 总攻击力相同\n
        生成疾风后可以移动
        """
        ...

    def vp_2(self):
        """
        [疾风瞬影闪]\n
        按向前方向键时， 移动距离 +100%\n
        施放时间 -20%\n
        大小 +50%
        """
        ...

# 风卷残云
# mage_male/swift_master/8572675ec6a1f50b6eff6a867376c2de
# a5ccbaf5538981c6ef99b236c0a60b73/8572675ec6a1f50b6eff6a867376c2de
class Skill34(ActiveSkill):
    """
    在自身周围生成强力的风暴后， 向前抛出。 周围的敌人会吸附到风暴中心。\n
    向前方抛出的风暴持续一定时间后爆炸。 按方向键时， 可以抛出更远的距离。
    """
    name = "风卷残云"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [551, 3305]
    uuid = "8572675ec6a1f50b6eff6a867376c2de"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 旋转风暴攻击力 : {value0}%
    # REMOVE: data0 = [0, 5751, 6335, 6918, 7502, 8085, 8668, 9252, 9835, 10419, 11002, 11586, 12169, 12753, 13336, 13919, 14503, 15086, 15670, 16253, 16837, 17420, 18004, 18587, 19171, 19754, 20337, 20921, 21504, 22088, 22671, 23255, 23838, 24422, 25005, 25588, 26172, 26755, 27339, 27922, 28506, 29089, 29673, 30256, 30840, 31423, 32006, 32590, 33173, 33757, 34340]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 旋转爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 19171, 21115, 23060, 25005, 26950, 28895, 30840, 32784, 34729, 36674, 38619, 40564, 42509, 44453, 46398, 48343, 50288, 52233, 54178, 56122, 58067, 60012, 61957, 63902, 65847, 67791, 69736, 71681, 73626, 75571, 77516, 79460, 81405, 83350, 85295, 87240, 89185, 91129, 93074, 95019, 96964, 98909, 100854, 102798, 104743, 106688, 108633, 110578, 112523, 114467]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 旋转风暴多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [风卷残云]\n
        删除强控敌人效果\n
        大小 +50%\n
        - 追加雷电风暴攻击\n
        攻击时间 -30%
        """
        ...

    def vp_2(self):
        """
        [风卷残云]\n
        旋转风暴持续时间增加\n
        每次攻击恢复2%的魔法值
        """
        ...

# 风神诀
# mage_male/swift_master/b5e3d014f75f3d17abdea52cca57f7e9
# a5ccbaf5538981c6ef99b236c0a60b73/b5e3d014f75f3d17abdea52cca57f7e9
class Skill35(PassiveSkill):
    """
    攻击时造成额外的多段伤害。
    """
    name = "风神诀"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "b5e3d014f75f3d17abdea52cca57f7e9"
    hasVP = False
    hasUP = False

    # 追加伤害比率 : {value0}%
    # REMOVE: data0 = [0, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118, 120, 122]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 游龙惊风破
# mage_male/swift_master/d110449993fb973f1a62c62c695003db
# a5ccbaf5538981c6ef99b236c0a60b73/d110449993fb973f1a62c62c695003db
class Skill36(ActiveSkill):
    """
    向前方抛出压缩后的飓风， 然后利用超强的旋转力量引发巨大的爆炸。 若飓风没有触碰到敌人， 角色则不会突进， 飓风将自动爆炸。
    """
    name = "游龙惊风破"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "d110449993fb973f1a62c62c695003db"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 3262, 3593, 3924, 4255, 4586, 4917, 5248, 5579, 5910, 6241, 6572, 6903, 7234, 7565, 7896, 8227, 8558, 8888, 9219, 9550, 9881, 10212, 10543, 10874, 11205, 11536, 11867, 12198, 12529, 12860, 13191, 13522, 13853, 14184, 14515, 14846, 15177, 15508, 15839, 16169, 16500, 16831, 17162, 17493, 17824, 18155, 18486, 18817, 19148, 19479]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 53773, 59228, 64683, 70138, 75594, 81049, 86504, 91959, 97415, 102870, 108325, 113780, 119235, 124691, 130146, 135601, 141056, 146511, 151967, 157422, 162877, 168332, 173787, 179243, 184698, 190153, 195608, 201064, 206519, 211974, 217429, 222884, 228340, 233795, 239250, 244705, 250160, 255616, 261071, 266526, 271981, 277436, 282892, 288347, 293802, 299257, 304713, 310168, 315623, 321078]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [游龙惊风破]\n
        追击最强大的敌人， 使用浓缩的风暴之力攻击地面并引发爆炸\n
         - 探索范围内不存在追击对象时， 不激活技能\n
         - 可以在空中施放\n
         - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [游龙惊风破]\n
        投掷自动旋转的风暴\n
        可以发动风暴旋转的距离 +25%\n
        可以强制中断施放后僵直， 并施放[狂风冲刺]
        """
        ...

# 九霄风雷
# mage_male/swift_master/b799700ee73e99e0ac27aaa307492033
# a5ccbaf5538981c6ef99b236c0a60b73/b799700ee73e99e0ac27aaa307492033
class Skill37(ActiveSkill):
    """
    和龙卷风合为一体， 攻击指定位置的敌人。施放时， 可以指定龙卷风降临的位置， 然后和龙卷风合为一体给予敌人多段伤害并引发爆炸造成巨大伤害。 龙卷风降临的位置只能选择角色前方。 选择位置过程中， 再次按攻击键 (x) 或技能键可以立即开始冲撞。 可以在空中施放该技能。
    """
    name = "九霄风雷"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [800, 6000]
    uuid = "b799700ee73e99e0ac27aaa307492033"
    hasVP = True
    hasUP = True
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 3180, 3503, 3825, 4148, 4470, 4793, 5116, 5438, 5761, 6083, 6406, 6729, 7051, 7374, 7697, 8019, 8342, 8664, 8987, 9310, 9632, 9955, 10277, 10600, 10923, 11245, 11568, 11890, 12213, 12536, 12858, 13181, 13503, 13826, 14149, 14471, 14794, 15117, 15439, 15762, 16084, 16407, 16730, 17052, 17375, 17697, 18020, 18343, 18665, 18988]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 爆炸攻击力 : {value1}%
    # REMOVE: data1 = [0, 66808, 73586, 80363, 87141, 93918, 100696, 107474, 114251, 121029, 127806, 134584, 141362, 148139, 154917, 161695, 168472, 175250, 182027, 188805, 195583, 202360, 209138, 215915, 222693, 229471, 236248, 243026, 249804, 256581, 263359, 270136, 276914, 283692, 290469, 297247, 304025, 310802, 317580, 324357, 331135, 337913, 344690, 351468, 358245, 365023, 371801, 378578, 385356, 392134, 398911]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 多段攻击次数 : {value2}次
    # REMOVE: data2 = [0, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # [范围信息]
    # 大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)

    def vp_1(self):
        """
        [九霄风雷]\n
        风暴降临后可以移动\n
        攻击时间 -30%
        """
        ...

    def vp_2(self):
        """
        [九霄风雷]\n
        可以强制中断部分技能的僵直， 并施放[九霄风雷]\n
        强制中断后技能结束时， 被击所损失生命值的25%由魔法值代偿， 效果持续15秒
        """
        ...

# 无限风域
# mage_male/swift_master/5ece7efb92358406e59338ef66479010
# a5ccbaf5538981c6ef99b236c0a60b73/5ece7efb92358406e59338ef66479010
class Skill38(ActiveSkill):
    """
    借助狂风之力， 在风暴中心内快速飞行并攻击敌人。 被命中的敌人处于僵直状态， 最后向范围内最强的敌人(领主 > 稀有 > 深渊 > 普通怪物)施展最后一击。 攻击期间， 若连续按攻击键或技能键， 会减少攻击时间。 可以在空中施放该技能。
    """
    name = "无限风域"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [1500, 5000]
    uuid = "5ece7efb92358406e59338ef66479010"
    hasVP = False
    hasUP = False

    # 狂风攻击力 : {value0}%
    # REMOVE: data0 = [0, 22579, 27815, 33051, 38287, 43523, 48758, 53994, 59230, 64466, 69702, 74937, 80173, 85409, 90645, 95881, 101116, 106352, 111588, 116824, 122060, 127295, 132531, 137767, 143003, 148239, 153474, 158710, 163946, 169182, 174418, 179653, 184889, 190125, 195361, 200597, 205833, 211068, 216304, 221540, 226776, 232012, 237247, 242483, 247719, 252955, 258191, 263426, 268662, 273898, 279134]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 飞行攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 8467, 10431, 12394, 14358, 16321, 18284, 20248, 22211, 24175, 26138, 28102, 30065, 32028, 33992, 35955, 37919, 39882, 41846, 43809, 45772, 47736, 49699, 51663, 53626, 55590, 57553, 59516, 61480, 63443, 65407, 67370, 69333, 71297, 73260, 75224, 77187, 79151, 81114, 83077, 85041, 87004, 88968, 90931, 92895, 94858, 96821, 98785, 100748, 102712, 104675]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 最后刺击攻击力 : {value2}%
    # REMOVE: data2 = [0, 45159, 55630, 66102, 76574, 87045, 97517, 107988, 118460, 128932, 139403, 149875, 160346, 170818, 181290, 191761, 202233, 212704, 223176, 233648, 244119, 254591, 265063, 275534, 286006, 296477, 306949, 317421, 327892, 338364, 348835, 359307, 369779, 380250, 390722, 401193, 411665, 422137, 432608, 443080, 453551, 464023, 474495, 484966, 495438, 505909, 516381, 526853, 537324, 547796, 558267]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 最后爆炸攻击力 : {value3}%
    # REMOVE: data3 = [0, 90318, 111261, 132204, 153147, 174090, 195034, 215977, 236920, 257863, 278807, 299750, 320693, 341636, 362579, 383523, 404466, 425409, 446352, 467295, 488239, 509182, 530125, 551068, 572011, 592955, 613898, 634841, 655784, 676728, 697671, 718614, 739557, 760500, 781444, 802387, 823330, 844273, 865216, 886160, 907103, 928046, 948989, 969932, 990876, 1011819, 1032762, 1053705, 1074649, 1095592, 1116535]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 飞行攻击多段攻击次数 : {value4}次
    # REMOVE: data4 = [0, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 初始之风
# mage_male/swift_master/05ee4433394678e5014c67dafee798ff
# a5ccbaf5538981c6ef99b236c0a60b73/05ee4433394678e5014c67dafee798ff
class Skill39(PassiveSkill):
    """
    知源·逐风者将黑暗之眼的力量在体内同化， 与风化为一体， 展现撕裂一切、 不被任何东西束缚的危险而自由的力量。\n
    增加基本攻击力和转职技能攻击力， 部分技能效果变更并获得新的能力。\n
    [游离之风]\n
    旋风击中敌人时引发巨大风暴， 攻击大范围的敌人。\n
    [狂风冲刺]\n
    被攻击或倒地状态下施放时， 可以躲避敌人的攻击。 (存在单独冷却时间)\n
    施放过程中， 按方向键可以指定躲避方向。
    """
    name = "初始之风"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 3
    uuid = "05ee4433394678e5014c67dafee798ff"
    hasVP = False
    hasUP = False

    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)

# 怒风狂涌
# mage_male/swift_master/29c0b8b3eed7252b3bdcddc2b4e9e3a0
# a5ccbaf5538981c6ef99b236c0a60b73/29c0b8b3eed7252b3bdcddc2b4e9e3a0
class Skill40(ActiveSkill):
    """
    逐风者在天空中呼唤飓风， 与风暴同化， 向四面八方呼啸而过， 将命中的敌人拉到中央， 生成狂乱气流。\n
    然后， 逐风者再次现身， 使气流汇聚成风暴后升空， 与台风的碰撞， 引发强烈爆炸。\n
    逐风者再次现身后才能强制中断技能； 强制中断技能后， 已经生成的气流和风暴不会消失。 
    """
    name = "怒风狂涌"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [773, 6000]
    uuid = "29c0b8b3eed7252b3bdcddc2b4e9e3a0"
    hasVP = False
    hasUP = False

    # 狂乱气流风暴攻击力 : {value0}%
    # REMOVE: data0 = [0, 5961, 6565, 7170, 7775, 8379, 8984, 9589, 10193, 10798, 11403, 12008, 12612, 13217, 13822, 14426, 15031, 15636, 16240, 16845, 17450, 18055, 18659, 19264, 19869, 20473, 21078, 21683, 22287, 22892, 23497, 24102, 24706, 25311, 25916, 26520, 27125, 27730, 28334, 28939, 29544, 30149, 30753, 31358, 31963, 32567, 33172, 33777, 34381, 34986, 35591]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 气流风暴多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 龙卷风攻击力 : {value2}%
    # REMOVE: data2 = [0, 13411, 14772, 16132, 17493, 18854, 20214, 21575, 22935, 24296, 25656, 27017, 28378, 29738, 31099, 32459, 33820, 35180, 36541, 37902, 39262, 40623, 41983, 43344, 44705, 46065, 47426, 48786, 50147, 51507, 52868, 54229, 55589, 56950, 58310, 59671, 61031, 62392, 63753, 65113, 66474, 67834, 69195, 70555, 71916, 73277, 74637, 75998, 77358, 78719, 80079]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 龙卷风多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)
    # 终结爆炸攻击力 : {value4}%
    # REMOVE: data4 = [0, 89409, 98479, 107550, 116620, 125691, 134761, 143832, 152902, 161973, 171043, 180114, 189184, 198255, 207325, 216396, 225466, 234537, 243607, 252678, 261748, 270819, 279889, 288960, 298030, 307100, 316171, 325241, 334312, 343382, 352453, 361523, 370594, 379664, 388735, 397805, 406876, 415946, 425017, 434087, 443158, 452228, 461299, 470369, 479440, 488510, 497581, 506651, 515721, 524792, 533862]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4, lambda x = None: x)

# 风之极·永坠
# mage_male/swift_master/e0578e280d5de3aa6d59b9ec7498a19b
# a5ccbaf5538981c6ef99b236c0a60b73/e0578e280d5de3aa6d59b9ec7498a19b
class Skill41(ActiveSkill):
    """
    逐风者化身风暴， 升至空中， 俯瞰地面， 随后向地面俯冲， 脚下生成强烈狂风， 粉碎一切抵抗风暴之神的愚蠢敌人， 不留一丝痕迹。\n
    [三次觉醒技能]\n
    使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
    若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "风之极·永坠"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4028, 8056]
    uuid = "e0578e280d5de3aa6d59b9ec7498a19b"
    hasVP = False
    hasUP = False

    # 跳跃攻击力 : {value0}%
    # REMOVE: data0 = [0, 61547, 75819, 90091, 104363, 118634, 132906, 147178, 161450, 175722, 189994, 204265, 218537, 232809, 247081, 261353, 275624, 289896, 304168, 318440, 332712, 346983, 361255, 375527, 389799, 404071, 418343, 432614, 446886, 461158, 475430, 489702, 503973, 518245, 532517, 546789, 561061, 575333, 589604, 603876, 618148, 632420, 646692, 660963, 675235, 689507, 703779, 718051, 732322, 746594, 760866]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0, lambda x = None: x)
    # 地面攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 92321, 113729, 135136, 156544, 177952, 199359, 220767, 242175, 263583, 284990, 306398, 327806, 349213, 370621, 392029, 413437, 434844, 456252, 477660, 499068, 520475, 541883, 563291, 584698, 606106, 627514, 648922, 670329, 691737, 713145, 734552, 755960, 777368, 798776, 820183, 841591, 862999, 884407, 905814, 927222, 948630, 970037, 991445, 1012853, 1034261, 1055668, 1077076, 1098484, 1119891, 1141299]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1, lambda x = None: x)
    # 狂风多段攻击力 : {value2}%
    # REMOVE: data2 = [0, 18464, 22746, 27027, 31309, 35590, 39872, 44153, 48435, 52717, 56998, 61280, 65561, 69843, 74124, 78406, 82687, 86969, 91250, 95532, 99814, 104095, 108377, 112658, 116940, 121221, 125503, 129784, 134066, 138347, 142629, 146910, 151192, 155474, 159755, 164037, 168318, 172600, 176881, 181163, 185444, 189726, 194007, 198289, 202571, 206852, 211134, 215415, 219697, 223978, 228260]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2, lambda x = None: x)
    # 狂风多段攻击次数 : {value3}次
    # REMOVE: data3 = [0, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3, lambda x = None: x)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'swift_master'
        self.nameCN = '知源·逐风者'
        self.role = 'mage_male'
        self.角色 = '魔法师(男)'
        self.职业 = '逐风者'
        self.jobId = 'a5ccbaf5538981c6ef99b236c0a60b73'
        self.jobGrowId = 'c9b492038ee3ca8d27d7004cf58d59f3'

        self.武器选项 = [] # TODO
        self.输出类型选项 = [] # TODO
        self.输出类型 = '' # TODO
        self.防具精通属性 = [''] # TODO
        self.防具类型 = ''
        self.buff = ... # TODO

        super().__init__(equVersion, __name__)
