#0c1b401bb09241570d364420b3ba3fd7
from core.basic.skill import PassiveSkill, ActiveSkill, get_data
from core.basic.character import Character
prefix = "priest_female/sorceress/cn/skillDetail"

# 升空斩
# priest_female/sorceress/3c5604bdbb0240b8f130f59ab40509c3
# 0c1b401bb09241570d364420b3ba3fd7/3c5604bdbb0240b8f130f59ab40509c3
class Skill0(ActiveSkill):
    """
        使用巨兵挥击敌人， 使敌人浮空。\n
        浮空力随技能等级的增加而增加。\n
        转职为光明骑士时， 技能类型变为独立攻击力。
    """
    name = "升空斩"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 4 #TODO
    rangeLv = 3
    cd = 2
    uuid = "3c5604bdbb0240b8f130f59ab40509c3"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 180, 209, 237, 266, 295, 323, 352, 381, 410, 438, 467, 496, 524, 553, 582, 610, 639, 668, 697, 725]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 浮空力比率 : {value1}%
    # REMOVE: data1 = [0, 131.4, 132.8, 134, 135.4, 136.5, 138, 139.1, 140.5, 141.7, 143.1, 147.7, 152.2, 157.1, 162, 166.5, 171.4, 176.2, 180.8, 185.7, 190.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 审判锤击
# priest_female/sorceress/c9664191611af31142e052dfaef84530
# 0c1b401bb09241570d364420b3ba3fd7/c9664191611af31142e052dfaef84530
class Skill1(ActiveSkill):
    """
        向巨兵凝聚神圣之力， 锤击前方。\n
        被命中的敌人会浮空。
    """
    name = "审判锤击"
    learnLv = 1
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 4
    mp = [15, 154]
    uuid = "c9664191611af31142e052dfaef84530"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}
    # REMOVE: data0 = [0, 3006, 3311, 3616, 3921, 4226, 4531, 4836, 5141, 5446, 5751, 6056, 6361, 6665, 6970, 7275, 7580, 7885, 8190, 8495, 8800, 9105, 9410, 9715, 10020, 10325, 10630, 10935, 11240, 11545, 11850, 12155, 12460, 12765, 13070, 13375, 13679, 13984, 14289, 14594, 14899, 15204, 15509, 15814, 16119, 16424, 16729, 17034, 17339, 17644, 17949, 18254, 18559, 18864, 19169, 19474, 19779, 20084, 20389, 20693, 20998, 21303, 21608, 21913, 22218, 22523, 22828, 23133, 23438, 23743, 24048]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 后跳
# priest_female/sorceress/7822d6d52e10964a6755f142c666b494
# 0c1b401bb09241570d364420b3ba3fd7/7822d6d52e10964a6755f142c666b494
class Skill2(ActiveSkill):
    """
        使自身向后方小跳并避开敌人的攻击。
    """
    name = "后跳"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 3 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "7822d6d52e10964a6755f142c666b494"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

# 基础精通
# priest_female/sorceress/5a56514f35cf0270ae8d6c65f8fefd78
# 0c1b401bb09241570d364420b3ba3fd7/5a56514f35cf0270ae8d6c65f8fefd78
class Skill3(PassiveSkill):
    """
        增加基本攻击、 前冲攻击、 跳跃攻击、 [升空斩]的攻击力。\n
        在决斗场中， 增益/减益技能、 被动技能的技能攻击力增加效果对[基础精通]无影响。
    """
    name = "基础精通"
    learnLv = 1
    masterLv = 115
    maxLv = 200
    position = 1 #TODO
    rangeLv = 1
    uuid = "5a56514f35cf0270ae8d6c65f8fefd78"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 基本攻击力变化率 : {value0}%
    # REMOVE: data0 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 前冲攻击力变化率 : {value1}%
    # REMOVE: data1 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 跳跃攻击力变化率 : {value2}%
    # REMOVE: data2 = [0, 150, 158.7, 167.3, 176, 184.5, 193.2, 201.8, 210.5, 219.2, 227.7, 236.4, 245, 253.7, 262.2, 270.9, 284.3, 297.6, 311, 324.3, 337.7, 350.9, 364.2, 377.6, 390.9, 404.3, 417.6, 431, 444.3, 457.7, 471, 484.2, 497.6, 510.9, 524.3, 537.6, 551, 564.3, 577.7, 591, 604.4, 617.7, 630.9, 644.3, 657.6, 671, 684.3, 697.7, 711, 724.4, 737.7, 751.1, 764.3, 777.6, 791, 804.3, 817.7, 831, 844.4, 857.7, 871.1, 884.4, 897.8, 911, 924.3, 937.7, 951, 964.4, 977.7, 991.1, 1004.4, 1017.8, 1031.1, 1044.5, 1057.7, 1071, 1084.4, 1097.7, 1111.1, 1124.4, 1137.8, 1151.1, 1164.5, 1177.8, 1191, 1204.4, 1217.7, 1231.1, 1244.4, 1257.8, 1271.1, 1284.5, 1297.8, 1311.2, 1324.5, 1337.7, 1351.1, 1364.4, 1377.8, 1391.1, 1404.5, 1417.8, 1431.2, 1444.5, 1457.9, 1471.2, 1484.6, 1497.9, 1511.3, 1524.6, 1538, 1551.3, 1564.7, 1578, 1591.4, 1604.7, 1618.1, 1631.4, 1644.8, 1658.1, 1671.5, 1684.8, 1698.2, 1711.5, 1724.9, 1738.2, 1751.6, 1764.9, 1778.3, 1791.6, 1805, 1818.3, 1831.7, 1845, 1858.4, 1871.7, 1885.1, 1898.4, 1911.8, 1925.1, 1938.5, 1951.8, 1965.2, 1978.5, 1991.9, 2005.2, 2018.6, 2031.9, 2045.3, 2058.6, 2072, 2085.3, 2098.7, 2112, 2125.4, 2138.7, 2152.1, 2165.4, 2178.8, 2192.1, 2205.5, 2218.8, 2232.2, 2245.5, 2258.9, 2272.2, 2285.6, 2298.9, 2312.3, 2325.6, 2339, 2352.3, 2365.7, 2379, 2392.4, 2405.7, 2419.1, 2432.4, 2445.8, 2459.1, 2472.5, 2485.8, 2499.2, 2512.5, 2525.9, 2539.2, 2552.6, 2565.9, 2579.3, 2592.6, 2606, 2619.3, 2632.7, 2646, 2659.4, 2672.7, 2686.1, 2699.4, 2712.8, 2726.1, 2739.5]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 受身蹲伏
# priest_female/sorceress/ce26c6b69d02a440a81b552bec94f03b
# 0c1b401bb09241570d364420b3ba3fd7/ce26c6b69d02a440a81b552bec94f03b
class Skill4(ActiveSkill):
    """
        使自身在倒地状态下迅速起身并采取蹲伏姿势； 蹲伏状态下， 自身会进入无敌状态， 效果持续一定时间。
    """
    name = "受身蹲伏"
    learnLv = 1
    masterLv = 10
    maxLv = 20
    position = 2 #TODO
    rangeLv = 1
    cd = 5
    mp = [1, 1]
    uuid = "ce26c6b69d02a440a81b552bec94f03b"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 蹲伏姿势最短无敌时间 : {value0}秒
    # REMOVE: data0 = [0, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3, 0.3]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 蹲伏姿势最长无敌时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 4.5, 6, 7.5, 9, 10.5, 12, 13.5, 15, 16.5, 18, 19.5, 21, 22.5, 24, 25.5, 27, 28.5, 30, 31.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 起身时霸体时间 : {value2}秒
    # REMOVE: data2 = [0, 0.3, 0.33, 0.36, 0.4, 0.43, 0.46, 0.5, 0.53, 0.56, 0.6, 0.63, 0.66, 0.7, 0.73, 0.76, 0.8, 0.83, 0.86, 0.9, 0.93]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 防具精通
# priest_female/sorceress/892ef624d8bf3d7fc045f84825fd6104
# 0c1b401bb09241570d364420b3ba3fd7/892ef624d8bf3d7fc045f84825fd6104
class Skill5(PassiveSkill):
    """
        穿戴防具时， 可以增加各种属性。\n
        穿戴的防具越多， 效果越强； 可根据转职， 增加不同的属性种类及数值。
    """
    name = "防具精通"
    learnLv = 1
    masterLv = 1
    maxLv = 1
    position = 0 #TODO
    rangeLv = 1
    uuid = "892ef624d8bf3d7fc045f84825fd6104"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501

# 空中锤击
# priest_female/sorceress/9dda3f4a849dba1a288dd65e116860f2
# 0c1b401bb09241570d364420b3ba3fd7/9dda3f4a849dba1a288dd65e116860f2
class Skill6(ActiveSkill):
    """
        从空中快速向地面俯冲并用巨兵锤击地面， 向后跳跃。\n
        只能在一定高度以上时才能使用。
    """
    name = "空中锤击"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 3 #TODO
    rangeLv = 2
    cd = 4
    mp = [10, 120]
    uuid = "9dda3f4a849dba1a288dd65e116860f2"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1606, 1769, 1932, 2095, 2258, 2421, 2584, 2747, 2910, 3072, 3235, 3398, 3561, 3724, 3887, 4050, 4213, 4376, 4539, 4702, 4865, 5028, 5191, 5353, 5516, 5679, 5842, 6005, 6168, 6331, 6494, 6657, 6820, 6983, 7146, 7309, 7472, 7635, 7797, 7960, 8123, 8286, 8449, 8612, 8775, 8938, 9101, 9264, 9427, 9590, 9753, 9916, 10079, 10241, 10404, 10567, 10730, 10893, 11056, 11219, 11382, 11545, 11708, 11871, 12034, 12197, 12360, 12523, 12685, 12848]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 冲击波攻击力 : {value1}%%
    # REMOVE: data1 = [0, 1418, 1562, 1706, 1850, 1993, 2137, 2281, 2425, 2569, 2713, 2856, 3000, 3144, 3288, 3432, 3576, 3720, 3863, 4007, 4151, 4295, 4439, 4583, 4727, 4870, 5014, 5158, 5302, 5446, 5590, 5733, 5877, 6021, 6165, 6309, 6453, 6597, 6740, 6884, 7028, 7172, 7316, 7460, 7604, 7747, 7891, 8035, 8179, 8323, 8467, 8610, 8754, 8898, 9042, 9186, 9330, 9474, 9617, 9761, 9905, 10049, 10193, 10337, 10481, 10624, 10768, 10912, 11056, 11200, 11344]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 可以施放技能的最小高度 : {value2}px
    # REMOVE: data2 = [0, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70, 70]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 冲击波大小 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 治愈祈祷
# priest_female/sorceress/0969cd4054d93da07708108c0cc1c4b5
# 0c1b401bb09241570d364420b3ba3fd7/0969cd4054d93da07708108c0cc1c4b5
class Skill7(ActiveSkill):
    """
        向神明祷告， 治疗自身的伤势， 恢复生命值。\n
        转职成为光明骑士时， 可以治疗队友， 并增加治疗量。\n
        学习[大天使的庇护]后， 施放[勇气颂歌]、 [新生颂歌]过程中可以使用该技能。
    """
    name = "治愈祈祷"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 1 #TODO
    rangeLv = 3
    cd = 10
    mp = [15, 154]
    uuid = "0969cd4054d93da07708108c0cc1c4b5"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 生命值恢复量 : {value0}
    # REMOVE: data0 = [0, 468, 1170, 1824, 2433, 3135, 3743, 4444, 5052, 5707, 6363, 7018, 7672, 8328, 8983, 9637, 10292, 10948, 11603, 12257, 12912, 13568, 14222, 14877, 15533, 16140, 16842, 17451, 18105, 18807, 19929, 21099, 21894, 22738, 23531, 24375, 25216, 26059, 26901, 27742, 28586, 29427, 30223, 31064, 31907, 32749, 33590, 34434, 35275, 36117, 36912, 37755, 38597, 39438, 40282, 41123, 41965, 42808, 43603, 44445, 45286, 46130, 46971, 47813, 48656, 49497, 50293, 51134, 51978, 52819, 53661]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 转职成为光明骑士时， 生命值恢复量比率 : {value1}%
    # REMOVE: data1 = [0, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150, 150]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 治愈范围 : {value2}px
    # REMOVE: data2 = [0, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900, 900]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 钩颈斩
# priest_female/sorceress/cfacda0647b9a0f595df2c2aad30c18d
# 0c1b401bb09241570d364420b3ba3fd7/cfacda0647b9a0f595df2c2aad30c18d
class Skill8(ActiveSkill):
    """
        大幅度挥动巨兵， 勾起敌人后砸向地面。\n
        对可抓取的敌人成功勾起后， 进入无敌状态。 随后按下向后键， 可将敌人扔向后方。\n
        对无法抓取的敌人不适用控制效果。\n
        堕落的七宗罪状态下使用时， 将被勾起的敌人拉到角色位置后砸向地面。\n
        转职为光明骑士后， 技能类型变为独立攻击力。
    """
    name = "钩颈斩"
    learnLv = 5
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 5
    mp = [10, 120]
    uuid = "cfacda0647b9a0f595df2c2aad30c18d"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 勾拽攻击力 : {value0}%
    # REMOVE: data0 = [0, 2822, 3108, 3395, 3681, 3967, 4253, 4540, 4826, 5112, 5399, 5685, 5971, 6257, 6544, 6830, 7116, 7403, 7689, 7975, 8262, 8548, 8834, 9120, 9407, 9693, 9979, 10266, 10552, 10838, 11124, 11411, 11697, 11983, 12270, 12556, 12842, 13128, 13415, 13701, 13987, 14274, 14560, 14846, 15132, 15419, 15705, 15991, 16278, 16564, 16850, 17136, 17423, 17709, 17995, 18282, 18568, 18854, 19141, 19427, 19713, 19999, 20286, 20572, 20858, 21145, 21431, 21717, 22003, 22290, 22576]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 下劈攻击力 : {value1}%
    # REMOVE: data1 = [0, 2822, 3108, 3395, 3681, 3967, 4253, 4540, 4826, 5112, 5399, 5685, 5971, 6257, 6544, 6830, 7116, 7403, 7689, 7975, 8262, 8548, 8834, 9120, 9407, 9693, 9979, 10266, 10552, 10838, 11124, 11411, 11697, 11983, 12270, 12556, 12842, 13128, 13415, 13701, 13987, 14274, 14560, 14846, 15132, 15419, 15705, 15991, 16278, 16564, 16850, 17136, 17423, 17709, 17995, 18282, 18568, 18854, 19141, 19427, 19713, 19999, 20286, 20572, 20858, 21145, 21431, 21717, 22003, 22290, 22576]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 武器格挡
# priest_female/sorceress/eb71e1d82d92c7e1d40500a0dcd77aa6
# 0c1b401bb09241570d364420b3ba3fd7/eb71e1d82d92c7e1d40500a0dcd77aa6
class Skill9(ActiveSkill):
    """
        竖起武器， 抵挡来自前方的攻击， 减少所受伤害。\n
        按住技能键可以维持防御姿态。 抵挡前方的攻击后， 可以强制使用其他技能。
    """
    name = "武器格挡"
    learnLv = 10
    masterLv = 5
    maxLv = 15
    position = 3 #TODO
    rangeLv = 5
    cd = 2
    mp = [3, 4]
    uuid = "eb71e1d82d92c7e1d40500a0dcd77aa6"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 所受伤害减少率 (物理) : {value0}%
    # REMOVE: data0 = [0, 14, 20, 27, 34, 41, 41, 41, 41, 41, 41, 41, 41, 41, 41, 41]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 所受伤害减少率 (魔法) : {value1}%
    # REMOVE: data1 = [0, 14, 20, 27, 34, 41, 41, 41, 41, 41, 41, 41, 41, 41, 41, 41]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 净化
# priest_female/sorceress/4655101518604f874721b3cc249aae10
# 0c1b401bb09241570d364420b3ba3fd7/4655101518604f874721b3cc249aae10
class Skill10(ActiveSkill):
    """
        使范围内的所有队员消除异常状态。
    """
    name = "净化"
    learnLv = 10
    masterLv = 1
    maxLv = 11
    position = 1 #TODO
    rangeLv = 5
    cd = 15
    mp = [22, 238]
    uuid = "4655101518604f874721b3cc249aae10"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 异常状态消除数量上限 : {value0}个
    # REMOVE: data0 = [0, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # [净化]适用范围 : {value1}px
    # REMOVE: data1 = [0, 1530, 1530, 1530, 1530, 1530, 1530, 1530, 1530, 1530, 1530, 1530]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 罪业加身
# priest_female/sorceress/f2fb27162beb0b87a7cb9af7900e95f2
# 0c1b401bb09241570d364420b3ba3fd7/f2fb27162beb0b87a7cb9af7900e95f2
class Skill11(ActiveSkill):
    """
        向前方发出蕴含原罪之力的冲击波攻击。\n
        在[七宗罪]增益效果状态下攻击成功时， 恢复生命值和魔法值， 并使敌人进入强制控制状态。\n
        [我甘愿承担这些罪业。]
    """
    name = "罪业加身"
    learnLv = 10
    masterLv = 60
    maxLv = 70
    position = 8 #TODO
    rangeLv = 2
    cd = 6
    mp = [30, 252]
    uuid = "f2fb27162beb0b87a7cb9af7900e95f2"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 冲击波攻击力 : {value0}%
    # REMOVE: data0 = [0, 5902, 6501, 7100, 7698, 8297, 8896, 9495, 10093, 10692, 11291, 11890, 12488, 13087, 13686, 14285, 14883, 15482, 16081, 16680, 17278, 17877, 18476, 19075, 19673, 20272, 20871, 21470, 22068, 22667, 23266, 23865, 24463, 25062, 25661, 26260, 26858, 27457, 28056, 28655, 29253, 29852, 30451, 31050, 31648, 32247, 32846, 33445, 34043, 34642, 35241, 35840, 36438, 37037, 37636, 38235, 38833, 39432, 40031, 40630, 41228, 41827, 42426, 43025, 43623, 44222, 44821, 45420, 46018, 46617, 47216]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # [范围信息]
    # 范围比率 : {value1}%
    # REMOVE: data1 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 强化 - 后跳
# priest_female/sorceress/2b340542e776818b78f3212af184bd6b
# 0c1b401bb09241570d364420b3ba3fd7/2b340542e776818b78f3212af184bd6b
class Skill12(PassiveSkill):
    """
    施放技能期间、 被击或倒地的状态下， 可以施放无敌状态的[后跳]。\n
    该能力适用与[后跳]不同的冷却时间， 并且不受冷却时间减少效果的影响。\n
    根据施放情况的不同(强制中断技能和被敌人攻击)， 进入不同冷却时间。\n
    无法强制中断觉醒技能和跳跃超过一定高度的技能。
    """
    name = "强化 - 后跳"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    cd = 30
    uuid = "2b340542e776818b78f3212af184bd6b"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 强制中断技能时的冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 被击或倒地期间施放时的冷却时间 : {value1}秒
    # REMOVE: data1 = [0, 30]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 跃翔
# priest_female/sorceress/1fea5a626f15230237946a11a9d11582
# 0c1b401bb09241570d364420b3ba3fd7/1fea5a626f15230237946a11a9d11582
class Skill13(ActiveSkill):
    """
        增加自身20%的跳跃力， 效果持续一定时间。\n
        效果持续期间内， 再次按技能键可以结束。
    """
    name = "跃翔"
    learnLv = 10
    masterLv = 1
    maxLv = 1
    position = 6 #TODO
    rangeLv = 3
    cd = 5
    mp = [13, 13]
    uuid = "1fea5a626f15230237946a11a9d11582"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 持续时间 : {value0}秒
    # REMOVE: data0 = [0, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 唤雷符
# priest_female/sorceress/45442bbbe33540b4deeec29437dae70c
# 0c1b401bb09241570d364420b3ba3fd7/45442bbbe33540b4deeec29437dae70c
class Skill14(ActiveSkill):
    """
        使用符咒在前方召唤落雷。\n
    [转职为驱魔师后附加效果]\n
    - 增加落雷大小\n
    - 使命中的敌人撞地反弹。 \n
    [学习乾坤之境后]\n
    - 可以探索施放者周围的350px内的敌人后发动攻击。\n
    - 周围没有敌人时无法施放。\n
    - 无法攻击物体。\n
    - 最多攻击12名敌人。\n
    - 对每名敌人攻击1次。
    """
    name = "唤雷符"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cd = 5
    mp = [30, 252]
    uuid = "45442bbbe33540b4deeec29437dae70c"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 落雷攻击力 : {value0}%
    # REMOVE: data0 = [0, 5414, 5963, 6512, 7062, 7611, 8160, 8709, 9259, 9808, 10357, 10906, 11456, 12005, 12554, 13103, 13653, 14202, 14751, 15300, 15850, 16399, 16948, 17497, 18047, 18596, 19145, 19694, 20244, 20793, 21342, 21891, 22441, 22990, 23539, 24088, 24638, 25187, 25736, 26285, 26835, 27384, 27933, 28482, 29032, 29581, 30130, 30679, 31229, 31778, 32327, 32876, 33426, 33975, 34524, 35073, 35623, 36172, 36721, 37270, 37820, 38369, 38918, 39467, 40017, 40566, 41115, 41664, 42214, 42763, 43312]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 落雷距离 : {value1}px
    # REMOVE: data1 = [0, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230, 230]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 落雷大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 念珠连射
# priest_female/sorceress/0232c151ef3731c2dede51931a374723
# 0c1b401bb09241570d364420b3ba3fd7/0232c151ef3731c2dede51931a374723
class Skill15(ActiveSkill):
    """
        发射念珠。\n
    发射过程中， 按方向键， 可以调整为向上/向下发射， 发射时， 可以使用其他技能。\n
        连按技能键可以连续发射念珠， 可以在空中使用该技能。\n
        根据[基础精通]增加攻击力， 施放使用念珠的技能后， 无法使用[念珠连射]。
    """
    name = "念珠连射"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 4 #TODO
    rangeLv = 1
    mp = [1, 1]
    uuid = "0232c151ef3731c2dede51931a374723"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 念珠冷却时间 : {value0}秒
    # REMOVE: data0 = [0, 0.7]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 木槵子经
# priest_female/sorceress/d2c6df5105577fb59fb92529a36165a0
# 0c1b401bb09241570d364420b3ba3fd7/d2c6df5105577fb59fb92529a36165a0
class Skill16(ActiveSkill):
    """
        在空中排列念珠后， 一同射向前方。\n
        念珠会击退敌人并造成伤害。\n
        敌人离得越近， 击退距离越远。 处于远处的敌人不会被击退。
    """
    name = "木槵子经"
    learnLv = 15
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 4
    mp = [30, 252]
    uuid = "d2c6df5105577fb59fb92529a36165a0"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 788, 867, 947, 1027, 1107, 1187, 1267, 1347, 1427, 1507, 1586, 1666, 1746, 1826, 1906, 1986, 2066, 2146, 2226, 2305, 2385, 2465, 2545, 2625, 2705, 2785, 2865, 2945, 3024, 3104, 3184, 3264, 3344, 3424, 3504, 3584, 3664, 3743, 3823, 3903, 3983, 4063, 4143, 4223, 4303, 4383, 4463, 4542, 4622, 4702, 4782, 4862, 4942, 5022, 5102, 5182, 5261, 5341, 5421, 5501, 5581, 5661, 5741, 5821, 5901, 5980, 6060, 6140, 6220, 6300]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 念珠连射出数量 : {value1}个
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 发射体前进距离比率 : {value2}%
    # REMOVE: data2 = [0, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400, 400]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 缩地成寸
# priest_female/sorceress/e0a072e8cef2d77893aad5f68aeed56a
# 0c1b401bb09241570d364420b3ba3fd7/e0a072e8cef2d77893aad5f68aeed56a
class Skill17(ActiveSkill):
    """
        使用法力缩小地形， 快速移动远距离。\n
        输入方向键时向该位置移动， 未输入时向后移动。\n
        到达地点后引发冲击波使敌人浮空。\n
        在决斗场中， [缩地成寸]没有浮空功能。
    """
    name = "缩地成寸"
    learnLv = 15
    masterLv = 1
    maxLv = 1
    position = 8 #TODO
    rangeLv = 2
    cd = 4
    mp = [30, 30]
    uuid = "e0a072e8cef2d77893aad5f68aeed56a"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # X轴移动距离 : {value0}px
    # REMOVE: data0 = [0, 300]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # Y轴移动距离 : {value1}px
    # REMOVE: data1 = [0, 100]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)

# 束灵符
# priest_female/sorceress/de3fea2d65c597f4d55c70a02b97fc79
# 0c1b401bb09241570d364420b3ba3fd7/de3fea2d65c597f4d55c70a02b97fc79
class Skill18(ActiveSkill):
    """
        抛出符咒， 束缚敌人。\n
        符咒前行一定距离后， 生成束缚领域， 触碰到的敌人受到魔法伤害， 并使敌人进入短暂的强制控制状态； 可以在空中使用。\n
        [驱魔的方法有殴打法、 辟火法、 光明法、 阴阳法、 符咒法等。]
    """
    name = "束灵符"
    learnLv = 20
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cd = 7
    mp = [40, 300]
    uuid = "de3fea2d65c597f4d55c70a02b97fc79"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 7411, 8163, 8915, 9667, 10418, 11170, 11922, 12674, 13426, 14178, 14929, 15681, 16433, 17185, 17937, 18689, 19440, 20192, 20944, 21696, 22448, 23200, 23951, 24703, 25455, 26207, 26959, 27711, 28463, 29214, 29966, 30718, 31470, 32222, 32974, 33725, 34477, 35229, 35981, 36733, 37485, 38236, 38988, 39740, 40492, 41244, 41996, 42748, 43499, 44251, 45003, 45755, 46507, 47259, 48010, 48762, 49514, 50266, 51018, 51770, 52521, 53273, 54025, 54777, 55529, 56281, 57032, 57784, 58536, 59288]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 束缚持续时间 : {value1}秒
    # REMOVE: data1 = [0, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 护符爆炸大小比率 : {value2}%
    # REMOVE: data2 = [0, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182, 182]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 神谕之祈愿
# priest_female/sorceress/c61f5a010370101402b05b21916c2071
# 0c1b401bb09241570d364420b3ba3fd7/c61f5a010370101402b05b21916c2071
class Skill19(ActiveSkill):
    """
        向神龙祈祷， 给自身降下神谕。\n
        受到神谕后， 增加驱魔师的基本攻击力和技能攻击力， 并增加物理/魔法防御力。\n
        [用虔诚的心传承意志吧。]
    """
    name = "神谕之祈愿"
    learnLv = 20
    masterLv = 20
    maxLv = 30
    position = 2 #TODO
    rangeLv = 3
    cd = 5
    uuid = "c61f5a010370101402b05b21916c2071"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 物理防御力增加 : {value1}
    # REMOVE: data1 = [0, 672, 1344, 2016, 2685, 3357, 4029, 4701, 5373, 6045, 6714, 7386, 8058, 8730, 9402, 10074, 10743, 11415, 12087, 12759, 13431, 14103, 14772, 15444, 16116, 16788, 17460, 18132, 18801, 19473, 20145]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 魔法防御力增加 : {value2}
    # REMOVE: data2 = [0, 672, 1344, 2016, 2685, 3357, 4029, 4701, 5373, 6045, 6714, 7386, 8058, 8730, 9402, 10074, 10743, 11415, 12087, 12759, 13431, 14103, 14772, 15444, 16116, 16788, 17460, 18132, 18801, 19473, 20145]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 增益效果持续时间 : {value3}秒
    # REMOVE: data3 = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 暴击
# priest_female/sorceress/fc1262c19f3d0477ee8eda47b8db8696
# 0c1b401bb09241570d364420b3ba3fd7/fc1262c19f3d0477ee8eda47b8db8696
class Skill20(PassiveSkill):
    """
        集中精神， 提升物理/魔法暴击率。
    """
    name = "暴击"
    learnLv = 20
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "fc1262c19f3d0477ee8eda47b8db8696"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 物理/魔法暴击率增加 : {value0}%
    # REMOVE: data0 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 驱邪咒
# priest_female/sorceress/202edb928046f4fa6dedf6337377efd5
# 0c1b401bb09241570d364420b3ba3fd7/202edb928046f4fa6dedf6337377efd5
class Skill21(ActiveSkill):
    """
        念出驱魔咒语， 击退敌人。\n
        施放过程中可以移动， 连按攻击键将以更快的速度发射。\n
        按跳跃键会终止该技能， 按Z键会转换方向。\n
        无苦集灭道， 无智亦无得。\n
        [学习乾坤之境后]\n
        额外生成除灵符， 对更大范围的敌人进行攻击。 
    """
    name = "驱邪咒"
    learnLv = 25
    masterLv = 60
    maxLv = 70
    position = 4 #TODO
    rangeLv = 2
    cd = 12
    mp = [35, 350]
    uuid = "202edb928046f4fa6dedf6337377efd5"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 攻击力 : {value0}%
    # REMOVE: data0 = [0, 1277, 1406, 1536, 1665, 1795, 1924, 2054, 2184, 2313, 2443, 2572, 2702, 2831, 2961, 3090, 3220, 3349, 3479, 3608, 3738, 3867, 3997, 4126, 4256, 4386, 4515, 4645, 4774, 4904, 5033, 5163, 5292, 5422, 5551, 5681, 5810, 5940, 6069, 6199, 6328, 6458, 6588, 6717, 6847, 6976, 7106, 7235, 7365, 7494, 7624, 7753, 7883, 8012, 8142, 8271, 8401, 8531, 8660, 8790, 8919, 9049, 9178, 9308, 9437, 9567, 9696, 9826, 9955, 10085, 10214]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 咒语发射数量 : {value1}字
    # REMOVE: data1 = [0, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 发射间隔 : {value2}秒
    # REMOVE: data2 = [0, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1, 0.1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 文字大小比率 : {value3}%
    # REMOVE: data3 = [0, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85, 85]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 祈雨祭
# priest_female/sorceress/e1f72ce0c2592e738f711345efd8e25d
# 0c1b401bb09241570d364420b3ba3fd7/e1f72ce0c2592e738f711345efd8e25d
class Skill22(PassiveSkill):
    """
        作为被神龙选择的龙女， 拥有祈愿下雨的能力。\n
        增加驱魔师的基本攻击力和转职技能攻击力。
    """
    name = "祈雨祭"
    learnLv = 25
    masterLv = 10
    maxLv = 20
    position = 6 #TODO
    rangeLv = 3
    uuid = "e1f72ce0c2592e738f711345efd8e25d"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 和合之玉
# priest_female/sorceress/2a3c96b88d02372505692da0a8b54743
# 0c1b401bb09241570d364420b3ba3fd7/2a3c96b88d02372505692da0a8b54743
class Skill23(ActiveSkill):
    """
        将念珠的力量汇聚成一个球体发射出去。\n
        和合之玉会穿透敌人， 达到一定距离后回到驱魔师位置。
    """
    name = "和合之玉"
    learnLv = 30
    masterLv = 60
    maxLv = 70
    position = 6 #TODO
    rangeLv = 2
    cd = 12
    mp = [150, 420]
    uuid = "2a3c96b88d02372505692da0a8b54743"
    hasVP = False
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 前进时球体攻击力 : {value0}%
    # REMOVE: data0 = [0, 11552, 12724, 13896, 15068, 16240, 17412, 18583, 19755, 20927, 22099, 23271, 24443, 25615, 26787, 27959, 29131, 30303, 31475, 32647, 33819, 34991, 36162, 37334, 38506, 39678, 40850, 42022, 43194, 44366, 45538, 46710, 47882, 49054, 50226, 51398, 52570, 53741, 54913, 56085, 57257, 58429, 59601, 60773, 61945, 63117, 64289, 65461, 66633, 67805, 68977, 70148, 71320, 72492, 73664, 74836, 76008, 77180, 78352, 79524, 80696, 81868, 83040, 84212, 85384, 86556, 87727, 88899, 90071, 91243, 92415]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 返回时球体攻击力 : {value1}%
    # REMOVE: data1 = [0, 4946, 5448, 5950, 6451, 6953, 7455, 7957, 8459, 8960, 9462, 9964, 10466, 10967, 11469, 11971, 12473, 12975, 13476, 13978, 14480, 14982, 15483, 15985, 16487, 16989, 17491, 17992, 18494, 18996, 19498, 19999, 20501, 21003, 21505, 22007, 22508, 23010, 23512, 24014, 24515, 25017, 25519, 26021, 26523, 27024, 27526, 28028, 28530, 29031, 29533, 30035, 30537, 31039, 31540, 32042, 32544, 33046, 33547, 34049, 34551, 35053, 35555, 36056, 36558, 37060, 37562, 38063, 38565, 39067, 39569]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 球体大小比率 : {value2}%
    # REMOVE: data2 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 神术强化
# priest_female/sorceress/b8f4966608e4ebb3cc80ba4eac3649bb
# 0c1b401bb09241570d364420b3ba3fd7/b8f4966608e4ebb3cc80ba4eac3649bb
class Skill24(PassiveSkill):
    """
        提升驱魔师的法力， 增加暴击伤害、 暴击率、 命中率和施放速度。\n
        [在我面前放肆， 会得到刻骨铭心的教训！]
    """
    name = "神术强化"
    learnLv = 30
    masterLv = 10
    maxLv = 20
    position = 5 #TODO
    rangeLv = 3
    uuid = "b8f4966608e4ebb3cc80ba4eac3649bb"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 暴击伤害增加率 : {value0}%
    # REMOVE: data0 = [0, 6.5, 8, 9.5, 11, 12.5, 14, 15.5, 17, 18.5, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 暴击率增加 : {value1}%
    # REMOVE: data1 = [0, 6.5, 8, 9.5, 11, 12.5, 14, 15.5, 17, 18.5, 20, 21.5, 23, 24.5, 26, 27.5, 29, 30.5, 32, 33.5, 35]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 命中率增加 : {value2}%
    # REMOVE: data2 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 施放速度增加 : {value3}%
    # REMOVE: data3 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 聚魂吸星符
# priest_female/sorceress/b163d099c8cc27fdb6fd3639c2ee6df9
# 0c1b401bb09241570d364420b3ba3fd7/b163d099c8cc27fdb6fd3639c2ee6df9
class Skill25(ActiveSkill):
    """
        向前方发射神符， 吸附周围的邪恶之人。\n
        神符前进一定距离后， 吸附敌人并造成多段伤害。
    """
    name = "聚魂吸星符"
    learnLv = 35
    masterLv = 60
    maxLv = 70
    position = 7 #TODO
    rangeLv = 2
    cube = 1
    cd = 15
    mp = [200, 850]
    uuid = "b163d099c8cc27fdb6fd3639c2ee6df9"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 939, 1034, 1129, 1224, 1320, 1415, 1510, 1605, 1701, 1796, 1891, 1986, 2081, 2177, 2272, 2367, 2462, 2558, 2653, 2748, 2843, 2938, 3034, 3129, 3224, 3319, 3415, 3510, 3605, 3700, 3796, 3891, 3986, 4081, 4176, 4272, 4367, 4462, 4557, 4653, 4748, 4843, 4938, 5034, 5129, 5224, 5319, 5414, 5510, 5605, 5700, 5795, 5891, 5986, 6081, 6176, 6271, 6367, 6462, 6557, 6652, 6748, 6843, 6938, 7033, 7129, 7224, 7319, 7414, 7509]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 符咒持续时间 : {value1}秒
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 多段攻击间隔 : {value2}秒
    # REMOVE: data2 = [0, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 吸星符球体大小比率 : {value3}%
    # REMOVE: data3 = [0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80, 80]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [聚魂吸星符]\n
        球体更强力地吸附周围敌人\n
        - 周围敌人吸附范围 +30%\n
        - 周围敌人吸附力 +30%\n
        球体大小 +30%
        """
        ...

    def vp_2(self):
        """
        [聚魂吸星符]\n
        存在被束灵符命中的敌人时， 在该敌人的位置生成球体\n
        - 可以在部分转职技能施放过程中施放， 使用该功能时可以无施法动作立即施放 (觉醒技能除外)
        """
        ...

# 龙魂之怒
# priest_female/sorceress/bc11d28c04e01923a093d65752c55516
# 0c1b401bb09241570d364420b3ba3fd7/bc11d28c04e01923a093d65752c55516
class Skill26(ActiveSkill):
    """
        将神龙的一部分力量具象化， 攻击前方一定范围内的敌人。\n
        [南无三曼多勃驮喃 喃舵 诃 喃舵 娑婆诃]
    """
    name = "龙魂之怒"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 2 #TODO
    rangeLv = 2
    cube = 1
    cd = 20
    mp = [250, 1260]
    uuid = "bc11d28c04e01923a093d65752c55516"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 技能攻击力 : {value0}%
    # REMOVE: data0 = [0, 25286, 27851, 30416, 32982, 35547, 38112, 40677, 43243, 45808, 48373, 50938, 53504, 56069, 58634, 61199, 63765, 66330, 68895, 71460, 74026, 76591, 79156, 81721, 84287, 86852, 89417, 91982, 94548, 97113, 99678, 102243, 104809, 107374, 109939, 112504, 115070, 117635, 120200, 122765, 125331, 127896, 130461, 133026, 135592, 138157, 140722, 143287, 145853, 148418, 150983, 153548, 156114, 158679, 161244, 163809, 166375, 168940, 171505, 174070, 176636, 179201, 181766, 184331, 186897, 189462, 192027, 194592, 197158, 199723, 202288]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 降落距离 : {value1}px
    # REMOVE: data1 = [0, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330, 330]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [范围信息]
    # 爆炸大小比率 : {value2}%
    # REMOVE: data2 = [0, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156, 156]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

    def vp_1(self):
        """
        [龙魂之怒]\n
        施放时， 驱魔师与神龙一起升空后猛击地面， 造成大范围伤害\n
        - 施放过程中所受伤害 -70%\n
        [唤雷符]\n
        施放[龙魂之怒]时， 自动施放强化版[唤雷符]\n
        - 强化版[唤雷符]攻击力为原[唤雷符]的350%\n
        - 无法使用普通[唤雷符]
        """
        ...

    def vp_2(self):
        """
        [龙魂之怒]\n
        施放时， 破开前方的天空， 随后在该位置降下神龙猛击\n
        - 可以在部分转职技能施放过程中施放， 使用该功能时可以无施放动作立即施放 (觉醒技能除外)
        """
        ...

# 百八念珠
# priest_female/sorceress/faf9cd66281078b51be2ee0b0f6c5530
# 0c1b401bb09241570d364420b3ba3fd7/faf9cd66281078b51be2ee0b0f6c5530
class Skill27(ActiveSkill):
    """
        集中神力， 生成多个念珠射向敌人。\n
    生成的念珠在碰到敌人后爆炸， 给单个目标造成很高的伤害。\n
    当发现被[束灵符]束缚的敌人时， 念珠会追击该敌人。\n
        如果持续按住技能键， 将射出可穿透敌人的念珠， 在地面形成大量的爆炸， 给范围内的所有敌人造成大范围爆炸伤害。\n
        可以在空中施放， 但是无法使用大范围爆炸。\n
        在决斗场中， 念珠不会向被[束灵符]束缚的敌人移动。\n
        [文楹当知， 四众龙神， 瞻察仁者， 为说何等]
    """
    name = "百八念珠"
    learnLv = 40
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 1
    cd = 25
    mp = [250, 1260]
    uuid = "faf9cd66281078b51be2ee0b0f6c5530"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # [百八念珠]攻击力 : {value0}%
    # REMOVE: data0 = [0, 1911, 2105, 2299, 2493, 2686, 2880, 3074, 3268, 3462, 3656, 3850, 4044, 4237, 4431, 4625, 4819, 5013, 5207, 5401, 5595, 5788, 5982, 6176, 6370, 6564, 6758, 6952, 7145, 7339, 7533, 7727, 7921, 8115, 8309, 8503, 8696, 8890, 9084, 9278, 9472, 9666, 9860, 10054, 10247, 10441, 10635, 10829, 11023, 11217, 11411, 11604, 11798, 11992, 12186, 12380, 12574, 12768, 12962, 13155, 13349, 13543, 13737, 13931, 14125, 14319, 14513, 14706, 14900, 15094, 15288]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 念珠射出数量 : {value1}个
    # REMOVE: data1 = [0, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20, 20]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 范围爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 2379, 2621, 2862, 3103, 3345, 3586, 3827, 4069, 4310, 4552, 4793, 5034, 5276, 5517, 5758, 6000, 6241, 6482, 6724, 6965, 7207, 7448, 7689, 7931, 8172, 8413, 8655, 8896, 9137, 9379, 9620, 9862, 10103, 10344, 10586, 10827, 11068, 11310, 11551, 11793, 12034, 12275, 12517, 12758, 12999, 13241, 13482, 13723, 13965, 14206, 14448, 14689, 14930, 15172, 15413, 15654, 15896, 16137, 16379, 16620, 16861, 17103, 17344, 17585, 17827, 18068, 18309, 18551, 18792, 19034]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 范围多段攻击次数 : {value3}
    # REMOVE: data3 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # [范围信息]
    # 念珠大小比率 : {value4}%
    # REMOVE: data4 = [0, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120, 120]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 范围爆炸攻击范围比率 : {value5}%
    # REMOVE: data5 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

    def vp_1(self):
        """
        [百八念珠]\n
        - 普通施放时， 念珠会追踪驱魔师前方一定范围内最近的敌人， 并追加飞向敌人的功能\n
        - 施放时， 念珠速度 +30%\n
        - 施放时， 念珠大小 +10%\n
        施放范围爆炸时， 生成无数念珠， 对驱魔师周围大范围进行最多5次的多段攻击\n
        - 施放时， 念珠速度 +30%\n
        - 施放时， 爆炸范围 +10%
        """
        ...

    def vp_2(self):
        """
        [百八念珠]\n
        普通施放时， 10秒内所有速度 +10%\n
        施放范围爆炸时， 10秒内回避率 +10%\n
        变更为可填充2次的技能\n
        - 每次填充冷却时间 : 12.5秒\n
        - 单次攻击力 -50%
        """
        ...

# 不动珠箔阵
# priest_female/sorceress/d296043df164385a14cb973c8c7c4d07
# 0c1b401bb09241570d364420b3ba3fd7/d296043df164385a14cb973c8c7c4d07
class Skill28(ActiveSkill):
    """
        生成可以困住敌人的阵法后， 移动念珠攻击敌人。\n
        阵法内的敌人无法出去， 阵法外的敌人也无法进来。\n
        多段攻击时， 按跳跃键会立即施放最后一击。\n
        在决斗场中， 按跳跃键不会立即施放最后一击。
    """
    name = "不动珠箔阵"
    learnLv = 45
    masterLv = 60
    maxLv = 70
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 45
    mp = [250, 2500]
    uuid = "d296043df164385a14cb973c8c7c4d07"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 念珠多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 1184, 1304, 1425, 1545, 1665, 1785, 1905, 2025, 2145, 2266, 2386, 2506, 2626, 2746, 2866, 2987, 3107, 3227, 3347, 3467, 3587, 3707, 3828, 3948, 4068, 4188, 4308, 4428, 4548, 4669, 4789, 4909, 5029, 5149, 5269, 5389, 5510, 5630, 5750, 5870, 5990, 6110, 6231, 6351, 6471, 6591, 6711, 6831, 6951, 7072, 7192, 7312, 7432, 7552, 7672, 7792, 7913, 8033, 8153, 8273, 8393, 8513, 8633, 8754, 8874, 8994, 9114, 9234, 9354, 9474]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 念珠旋转次数 : {value1}次
    # REMOVE: data1 = [0, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24, 24]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 最后一击攻击力 : {value2}%
    # REMOVE: data2 = [0, 18981, 20906, 22832, 24757, 26683, 28608, 30534, 32460, 34385, 36311, 38236, 40162, 42087, 44013, 45938, 47864, 49790, 51715, 53641, 55566, 57492, 59417, 61343, 63269, 65194, 67120, 69045, 70971, 72896, 74822, 76747, 78673, 80599, 82524, 84450, 86375, 88301, 90226, 92152, 94078, 96003, 97929, 99854, 101780, 103705, 105631, 107557, 109482, 111408, 113333, 115259, 117184, 119110, 121035, 122961, 124887, 126812, 128738, 130663, 132589, 134514, 136440, 138366, 140291, 142217, 144142, 146068, 147993, 149919, 151844]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 魔法阵大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [不动珠箔阵]\n
        [不动珠箔阵]发动后结束施放动作\n
        - 攻击范围 +20%
        """
        ...

    def vp_2(self):
        """
        [不动珠箔阵]\n
        施放技能时进入无敌状态\n
        - 使攻击中的目标进入强制控制状态
        """
        ...

# 神龙如意珠
# priest_female/sorceress/6e33d47e6622ce03b6defdd912140270
# 0c1b401bb09241570d364420b3ba3fd7/6e33d47e6622ce03b6defdd912140270
class Skill29(PassiveSkill):
    """
        吸收神龙的力量， 攻击时造成额外的魔法伤害， 并增加驱魔师的基本攻击和所有技能攻击力。\n
        在决斗场中， 攻击时不造成额外的魔法伤害。
    """
    name = "神龙如意珠"
    learnLv = 48
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 3
    uuid = "6e33d47e6622ce03b6defdd912140270"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 基本攻击力和技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 13, 14.5, 16, 17.5, 19, 20.5, 22, 23.5, 25, 26.5, 28, 29.5, 31, 32.5, 34, 35.5, 37, 38.5, 40, 41.5, 43, 44.5, 46, 47.5, 49, 50.5, 52, 53.5, 55, 56.5, 58, 59.5, 61, 62.5, 64, 65.5, 67, 68.5, 70, 71.5, 73, 74.5, 76, 77.5, 79, 80.5, 82, 83.5, 85, 86.5]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 追加攻击攻击力 : {value1}%
    # REMOVE: data1 = [0, 552, 640, 728, 816, 904, 992, 1080, 1168, 1256, 1344, 1432, 1520, 1608, 1696, 1784, 1872, 1960, 2048, 2136, 2224, 2312, 2400, 2488, 2576, 2664, 2752, 2840, 2928, 3016, 3104, 3192, 3280, 3368, 3456, 3544, 3632, 3720, 3808, 3896, 3984, 4072, 4160, 4248, 4336, 4424, 4512, 4600, 4688, 4776, 4864]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 追加攻击冷却时间 : {value2}秒
    # REMOVE: data2 = [0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 追加打击大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 神谕 : 神龙雷雨祭
# priest_female/sorceress/ca75c965f20a150f99f54155a37400df
# 0c1b401bb09241570d364420b3ba3fd7/ca75c965f20a150f99f54155a37400df
class Skill30(ActiveSkill):
    """
        驱魔师通过神谕， 使神龙降临到现世。\n
        神龙会制造铺天盖地的乌云和强烈的雷雨， 惩罚世上的一切罪恶。\n
        [神龙大人！ 拯救这些受苦的人吧！]
    """
    name = "神谕 : 神龙雷雨祭"
    learnLv = 50
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 5
    cube = 5
    cd = 145
    mp = [900, 7559]
    uuid = "ca75c965f20a150f99f54155a37400df"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 雷雨多段攻击力 : {value0}%
    # REMOVE: data0 = [0, 4267, 5256, 6246, 7235, 8225, 9214, 10204, 11193, 12183, 13172, 14162, 15151, 16140, 17130, 18119, 19109, 20098, 21088, 22077, 23067, 24056, 25046, 26035, 27024, 28014, 29003, 29993, 30982, 31972, 32961, 33951, 34940, 35930, 36919, 37908, 38898, 39887, 40877, 41866, 42856, 43845, 44835, 45824, 46814, 47803, 48793, 49782, 50771, 51761, 52750]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 雷雨持续时间 : {value1}秒
    # REMOVE: data1 = [0, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4, 2.4]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 雷雨多段攻击间隔 : {value2}秒
    # REMOVE: data2 = [0, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15, 0.15]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 最后一击攻击力 : {value3}%
    # REMOVE: data3 = [0, 29260, 36044, 42829, 49614, 56399, 63184, 69969, 76753, 83538, 90323, 97108, 103893, 110678, 117462, 124247, 131032, 137817, 144602, 151387, 158171, 164956, 171741, 178526, 185311, 192096, 198880, 205665, 212450, 219235, 226020, 232805, 239589, 246374, 253159, 259944, 266729, 273514, 280298, 287083, 293868, 300653, 307438, 314223, 321007, 327792, 334577, 341362, 348147, 354932, 361717]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

# 因果业火符
# priest_female/sorceress/1721e94897e9961d5c98130a13392f17
# 0c1b401bb09241570d364420b3ba3fd7/1721e94897e9961d5c98130a13392f17
class Skill31(ActiveSkill):
    """
        抛出减速周围敌人， 并在被击时爆炸的符咒。\n
        符咒前进一定距离后生成阵法， 减速阵法内的敌人。 当驱魔师用转职技能攻击符咒时， 符咒会爆炸， 给周围的敌人造成伤害。\n
        达到爆炸次数上限、 追加技能操作， 或者符咒持续时间结束后， 引起最后一次爆炸。\n
        利用ON/OFF可以开启或关闭减速敌人的功能， 施放时可以通过前方向键来增加放置距离。\n
        [神龙赐予的灵力和龙女虔诚的心与意志凝聚而成的神气， 虽无形体， 却可通过符咒留下自己的痕迹。]
    """
    name = "因果业火符"
    learnLv = 60
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 1
    cd = 30
    mp = [400, 1620]
    uuid = "1721e94897e9961d5c98130a13392f17"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 范围内的敌人移动速度减少 : {value0}%
    # REMOVE: data0 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 范围内的敌人攻击速度减少 : {value1}%
    # REMOVE: data1 = [0, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 打击时爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 4149, 4570, 4990, 5411, 5832, 6253, 6674, 7095, 7516, 7937, 8357, 8778, 9199, 9620, 10041, 10462, 10883, 11304, 11725, 12145, 12566, 12987, 13408, 13829, 14250, 14671, 15092, 15512, 15933, 16354, 16775, 17196, 17617, 18038, 18459, 18880, 19300, 19721, 20142, 20563, 20984, 21405, 21826, 22247, 22667, 23088, 23509, 23930, 24351, 24772]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 爆炸最大次数 : {value3}次
    # REMOVE: data3 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 护符最大持续时间 : {value4}秒
    # REMOVE: data4 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 最后一击爆炸攻击力 : {value5}%
    # REMOVE: data5 = [0, 15644, 17231, 18818, 20406, 21993, 23580, 25167, 26754, 28341, 29928, 31515, 33102, 34689, 36276, 37864, 39451, 41038, 42625, 44212, 45799, 47386, 48973, 50560, 52147, 53734, 55322, 56909, 58496, 60083, 61670, 63257, 64844, 66431, 68018, 69605, 71193, 72780, 74367, 75954, 77541, 79128, 80715, 82302, 83889, 85476, 87063, 88651, 90238, 91825, 93412]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)
    # [范围信息]
    # 大小比率 : {value6}%
    # REMOVE: data6 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data6 = get_data(f'{prefix}/{uuid}', 6)

    def vp_1(self):
        """
        [因果业火符]\n
        魔法阵碰到敌人时， 强制控制敌人2秒\n
        爆炸攻击次数上限变更为3次\n
        - 总攻击力相同\n
        范围大小 +10%
        """
        ...

    def vp_2(self):
        """
        [因果业火符]\n
        投掷因果业火符后立即爆炸\n
        - 在被爆炸攻击到的所有敌人的身体上， 附着可以爆炸7次的因果业火符\n
        - 附着的因果业火符持续10秒， 在持续期间赋予与[束灵符]相同的技能追踪功能
        """
        ...

# 夺命大念阵
# priest_female/sorceress/51a08fd0c90f0a5276cd552047fac93d
# 0c1b401bb09241570d364420b3ba3fd7/51a08fd0c90f0a5276cd552047fac93d
class Skill32(ActiveSkill):
    """
        驱魔师将法力注入念珠， 在前方画出夺命大念阵。\n
        赋予法力的念珠会击退敌人， 稍后阵法会爆炸， 对范围内的所有敌人造成伤害。
    """
    name = "夺命大念阵"
    learnLv = 70
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 2
    cube = 2
    cd = 50
    mp = [800, 1680]
    uuid = "51a08fd0c90f0a5276cd552047fac93d"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 念珠撞击攻击力 : {value0}%
    # REMOVE: data0 = [0, 5337, 5878, 6419, 6961, 7502, 8044, 8585, 9126, 9668, 10209, 10751, 11292, 11833, 12375, 12916, 13458, 13999, 14540, 15082, 15623, 16165, 16706, 17247, 17789, 18330, 18872, 19413, 19954, 20496, 21037, 21579, 22120, 22661, 23203, 23744, 24286, 24827, 25369, 25910, 26451, 26993, 27534, 28076, 28617, 29158, 29700, 30241, 30783, 31324, 31865]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 念珠撞击多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 阵法爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 48030, 52903, 57775, 62648, 67520, 72393, 77266, 82138, 87011, 91883, 96756, 101629, 106501, 111374, 116247, 121119, 125992, 130864, 135737, 140610, 145482, 150355, 155227, 160100, 164973, 169845, 174718, 179590, 184463, 189336, 194208, 199081, 203953, 208826, 213699, 218571, 223444, 228317, 233189, 238062, 242934, 247807, 252680, 257552, 262425, 267297, 272170, 277043, 281915, 286788]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 爆炸大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [夺命大念阵]\n
        施放时在地面生成魔法阵， 升天的神龙对范围内所有敌人进行多段攻击后爆炸\n
        - 魔法阵在驱魔师周围500px内最强敌人的位置生成\n
        - 仅在攻击范围内存在敌人时可以使用\n
        最终爆炸范围 +10%
        """
        ...

    def vp_2(self):
        """
        [夺命大念阵]\n
        [夺命大念阵]施放速度 +40%\n
        [缩地成寸]\n
        施放[夺命大念阵]时， 初始化[缩地成寸]的冷却时间\n
        [夺命大念阵]念珠发射后， 可以施放[缩地成寸]
        """
        ...

# 龙神之力
# priest_female/sorceress/2c9d9a36c8401bddff6cdb80fab8dc24
# 0c1b401bb09241570d364420b3ba3fd7/2c9d9a36c8401bddff6cdb80fab8dc24
class Skill33(PassiveSkill):
    """
        龙神之力赋予御龙仙女强大的力量， 在攻击时造成附加伤害， 提高念珠射出的攻击力， 减少神龙如意珠附加伤害的冷却时间。\n
        被击时一段时间内增加物理/魔法防御力。
    """
    name = "龙神之力"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 3 #TODO
    rangeLv = 3
    uuid = "2c9d9a36c8401bddff6cdb80fab8dc24"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 附加伤害 : {value0}%
    # REMOVE: data0 = [0, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99, 101, 103, 105, 107, 109, 111, 113, 115, 117, 119, 121, 123]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 念珠射出攻击力增加率 : {value1}%
    # REMOVE: data1 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # [神龙如意珠]附加伤害冷却时间减少率 : {value2}%
    # REMOVE: data2 = [0, 40, 42, 44, 46, 48, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 51, 51, 52, 52, 52, 52, 52, 52, 52, 52]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 物理/魔法防御力增加量 : {value3}
    # REMOVE: data3 = [0, 10792, 11622, 12452, 13282, 14112, 14942, 15772, 16602, 17432, 18263, 19093, 19923, 20753, 21583, 22413, 23243, 24073, 24903, 25734, 26564, 27394, 28224, 29054, 29884, 30714, 31544, 32375, 33205, 34035, 34865, 35695, 36525, 37355, 38185, 39015, 39846, 40676, 41506, 42336, 43166, 43996, 44826, 45656, 46486, 47317, 48147, 48977, 49807, 50637, 51467]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 所受伤害减少效果持续时间 : {value4}秒
    # REMOVE: data4 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)
    # 所受伤害减少效果冷却时间 : {value5}秒
    # REMOVE: data5 = [0, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30]# noqa: E501
    data5 = get_data(f'{prefix}/{uuid}', 5)

# 退魔阴阳符
# priest_female/sorceress/b89c9ab317bc0a443f6497b7cca2f6a8
# 0c1b401bb09241570d364420b3ba3fd7/b89c9ab317bc0a443f6497b7cca2f6a8
class Skill34(ActiveSkill):
    """
        在前方形成多个退魔符， 然后射出退魔阴阳玉攻击敌人。\n
        阴阳玉把敌人击退， 然后用退魔符进行多段攻击。
    """
    name = "退魔阴阳符"
    learnLv = 75
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 3
    cd = 40
    mp = [580, 4500]
    uuid = "b89c9ab317bc0a443f6497b7cca2f6a8"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 击退念珠攻击力 : {value0}%
    # REMOVE: data0 = [0, 916, 1009, 1102, 1195, 1288, 1381, 1474, 1566, 1659, 1752, 1845, 1938, 2031, 2124, 2217, 2310, 2403, 2496, 2589, 2682, 2774, 2867, 2960, 3053, 3146, 3239, 3332, 3425, 3518, 3611, 3704, 3797, 3890, 3983, 4075, 4168, 4261, 4354, 4447, 4540, 4633, 4726, 4819, 4912, 5005, 5098, 5191, 5283, 5376, 5469]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 弹射打击攻击力 : {value1}%
    # REMOVE: data1 = [0, 7557, 8323, 9090, 9857, 10623, 11390, 12157, 12923, 13690, 14457, 15223, 15990, 16756, 17523, 18290, 19056, 19823, 20590, 21356, 22123, 22890, 23656, 24423, 25189, 25956, 26723, 27489, 28256, 29023, 29789, 30556, 31323, 32089, 32856, 33622, 34389, 35156, 35922, 36689, 37456, 38222, 38989, 39756, 40522, 41289, 42055, 42822, 43589, 44355, 45122]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 弹射次数 : {value2}次
    # REMOVE: data2 = [0, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 攻击范围比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [退魔阴阳符]\n
        使用符咒生成魔魂爆炎阵\n
        弹射攻击结束后， 引发魔魂爆炎阵爆炸\n
        - 总攻击力相同\n
        攻击范围 +35%
        """
        ...

    def vp_2(self):
        """
        [退魔阴阳符]\n
        施放时， 退魔阴阳符攻击更大的范围， 并自动使用[驱邪咒]\n
        - 在前方召唤[驱邪咒]并发射\n
        - [驱邪咒]在冷却时间内时， 不发动该效果\n
        基本冷却时间变更为24秒\n
        - 总攻击力 -40%\n
        [驱邪咒]\n
        [驱邪咒]发射次数变更为6次\n
        - 总攻击力相同
        """
        ...

# 天坠阴阳玉
# priest_female/sorceress/7cf17936a039b418660424125dc968d7
# 0c1b401bb09241570d364420b3ba3fd7/7cf17936a039b418660424125dc968d7
class Skill35(ActiveSkill):
    """
        召唤超大型阴阳玉， 将前方区域炙烤成一片焦土。\n
        阴阳玉坠落时， 可以利用前方方向键调整降落位置； 可以在空中施放。
    """
    name = "天坠阴阳玉"
    learnLv = 80
    masterLv = 40
    maxLv = 50
    position = 4 #TODO
    rangeLv = 2
    cube = 5
    cd = 45
    mp = [580, 4500]
    uuid = "7cf17936a039b418660424125dc968d7"
    hasVP = True
    hasUP = True
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    vps = get_data(f'{prefix}/{uuid}', "vps") # noqa: E501

    # 下降打击攻击力 : {value0}%
    # REMOVE: data0 = [0, 6000, 6609, 7218, 7827, 8435, 9044, 9653, 10261, 10870, 11479, 12088, 12696, 13305, 13914, 14523, 15131, 15740, 16349, 16957, 17566, 18175, 18784, 19392, 20001, 20610, 21219, 21827, 22436, 23045, 23654, 24262, 24871, 25480, 26088, 26697, 27306, 27915, 28523, 29132, 29741, 30350, 30958, 31567, 32176, 32784, 33393, 34002, 34611, 35219, 35828]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 下降最多打击次数 : {value1}
    # REMOVE: data1 = [0, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 70893, 78085, 85277, 92469, 99661, 106853, 114045, 121237, 128429, 135621, 142813, 150005, 157197, 164389, 171582, 178774, 185966, 193158, 200350, 207542, 214734, 221926, 229118, 236310, 243502, 250694, 257886, 265078, 272270, 279462, 286654, 293846, 301038, 308230, 315422, 322614, 329806, 336998, 344190, 351383, 358575, 365767, 372959, 380151, 387343, 394535, 401727, 408919, 416111, 423303]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # [范围信息]
    # 念珠大小比率 : {value3}%
    # REMOVE: data3 = [0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100, 100]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)

    def vp_1(self):
        """
        [天坠阴阳玉]\n
        下降速度增加； 并且删除下降攻击， 立即爆炸\n
        - 下降速度 +25%\n
        - 总攻击力相同
        """
        ...

    def vp_2(self):
        """
        [天坠阴阳玉]\n
        施放时破开天空， 一定时间内自动向驱魔师周围最强敌人掉落念珠\n
        - 小型念珠掉落结束后或破开天空状态下再次按技能键时， 召唤巨型阴阳玉\n
        - 无法在空中施放\n
        - 有被束灵符]束缚的目标时， 念珠会优先追踪目标\n
        - 基本冷却时间变更为67.5秒\n
        总攻击力 +50%
        """
        ...

# 龙威如狱·龙恩如海
# priest_female/sorceress/7f80b887a09e88e2c4728c898bd73654
# 0c1b401bb09241570d364420b3ba3fd7/7f80b887a09e88e2c4728c898bd73654
class Skill36(ActiveSkill):
    """
        神龙现身这个世界解救众生。 御龙仙女与神龙合为一体惩戒世上的邪恶， 随后升天消失。\n
        被打击的敌人处于强制控制状态并且受到伤害。\n
    <连按效果>\n
        连续按技能快捷键或<X>攻击键， 可以加快技能施放速度。
    """
    name = "龙威如狱·龙恩如海"
    learnLv = 85
    masterLv = 40
    maxLv = 50
    position = 6 #TODO
    rangeLv = 5
    cube = 10
    cd = 180
    mp = [2500, 5000]
    uuid = "7f80b887a09e88e2c4728c898bd73654"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 神龙移动攻击力 : {value0}%
    # REMOVE: data0 = [0, 6391, 7872, 9354, 10836, 12318, 13800, 15282, 16764, 18246, 19727, 21209, 22691, 24173, 25655, 27137, 28619, 30101, 31582, 33064, 34546, 36028, 37510, 38992, 40474, 41955, 43437, 44919, 46401, 47883, 49365, 50847, 52329, 53810, 55292, 56774, 58256, 59738, 61220, 62702, 64184, 65665, 67147, 68629, 70111, 71593, 73075, 74557, 76039, 77520, 79002]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # 神龙移动多段攻击次数 : {value1}次
    # REMOVE: data1 = [0, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 升天多段攻击攻击力 : {value2}%
    # REMOVE: data2 = [0, 9589, 11813, 14036, 16260, 18483, 20707, 22930, 25154, 27377, 29601, 31825, 34048, 36272, 38495, 40719, 42942, 45166, 47389, 49613, 51836, 54060, 56284, 58507, 60731, 62954, 65178, 67401, 69625, 71848, 74072, 76295, 78519, 80743, 82966, 85190, 87413, 89637, 91860, 94084, 96307, 98531, 100755, 102978, 105202, 107425, 109649, 111872, 114096, 116319, 118543]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 升天多段攻击次数 : {value3}
    # REMOVE: data3 = [0, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # 最后一击攻击力 : {value4}%
    # REMOVE: data4 = [0, 76732, 94524, 112317, 130110, 147903, 165696, 183489, 201281, 219074, 236867, 254660, 272453, 290246, 308038, 325831, 343624, 361417, 379210, 397003, 414795, 432588, 450381, 468174, 485967, 503759, 521552, 539345, 557138, 574931, 592724, 610516, 628309, 646102, 663895, 681688, 699481, 717273, 735066, 752859, 770652, 788445, 806238, 824030, 841823, 859616, 877409, 895202, 912995, 930787, 948580]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)

# 乾坤之境
# priest_female/sorceress/5806440d21e7546d50007a5ba11f8024
# 0c1b401bb09241570d364420b3ba3fd7/5806440d21e7546d50007a5ba11f8024
class Skill37(PassiveSkill):
    """
        作为行使神龙之力的代行者， 获得掌控天空气息的权能。 增加基本攻击力和技能攻击力， 部分技能附加特殊效果。\n
    [唤雷符] : 可以探索施放者周围的350px内的敌人后施放， 最多向12名敌人召唤落雷。 闪电对每名敌人最多造成1次伤害。\n
    [驱邪咒] : 生成除灵符， 对更大范围的敌人进行攻击。 
    """
    name = "乾坤之境"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 3
    uuid = "5806440d21e7546d50007a5ba11f8024"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 基本攻击力和转职技能攻击力增加率 : {value0}%
    # REMOVE: data0 = [0, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100, 102, 104, 106, 108, 110, 112, 114, 116, 118]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)

# 天泽神龙阵
# priest_female/sorceress/d429147c372b549c3dadcabcba50787f
# 0c1b401bb09241570d364420b3ba3fd7/d429147c372b549c3dadcabcba50787f
class Skill38(ActiveSkill):
    """
        使用蕴含神力的符咒画出阵法后， 通过阵法释放神龙气息。 随后， 投掷符咒并将其引爆。
    """
    name = "天泽神龙阵"
    learnLv = 95
    masterLv = 40
    maxLv = 50
    position = 7 #TODO
    rangeLv = 2
    cube = 7
    cd = 60
    mp = [870, 6750]
    uuid = "d429147c372b549c3dadcabcba50787f"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 神龙的气息攻击力 : {value0}% X {value1}
    # REMOVE: data0 = [0, 11732, 12923, 14113, 15303, 16493, 17684, 18874, 20064, 21254, 22445, 23635, 24825, 26015, 27205, 28396, 29586, 30776, 31966, 33157, 34347, 35537, 36727, 37918, 39108, 40298, 41488, 42679, 43869, 45059, 46249, 47440, 48630, 49820, 51010, 52200, 53391, 54581, 55771, 56961, 58152, 59342, 60532, 61722, 62913, 64103, 65293, 66483, 67674, 68864, 70054]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # REMOVE: data1 = [0, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 符咒爆炸攻击力 : {value2}%
    # REMOVE: data2 = [0, 66281, 73006, 79730, 86454, 93178, 99902, 106627, 113351, 120075, 126799, 133523, 140248, 146972, 153696, 160420, 167144, 173869, 180593, 187317, 194041, 200765, 207490, 214214, 220938, 227662, 234386, 241111, 247835, 254559, 261283, 268007, 274732, 281456, 288180, 294904, 301628, 308353, 315077, 321801, 328525, 335249, 341974, 348698, 355422, 362146, 368870, 375595, 382319, 389043, 395767]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)

# 神龙之舞·天一
# priest_female/sorceress/7ec521d063d2190e1fcc5bd229af9bcf
# 0c1b401bb09241570d364420b3ba3fd7/7ec521d063d2190e1fcc5bd229af9bcf
class Skill39(ActiveSkill):
    """
        光启·驱魔师翩翩起舞， 与神龙化为一体， 将蕴含神力的念珠和神龙一起升至空中， 然后向敌人降下天罚。\n
       最后念珠化为神龙如意珠， 与神龙一起歼灭地上的敌人。\n
    [三次觉醒技能]\n
        使用三次觉醒技能时， 与关联的技能共享冷却时间。\n
        若关联的技能还在冷却中， 则无法使用三次觉醒技能。
    """
    name = "神龙之舞·天一"
    learnLv = 100
    masterLv = 40
    maxLv = 50
    position = 5 #TODO
    rangeLv = 5
    cube = 15
    cd = 290
    mp = [4000, 8000]
    uuid = "7ec521d063d2190e1fcc5bd229af9bcf"
    hasVP = False
    hasUP = False
    custom = get_data(f'{prefix}/{uuid}', "custom") # noqa: E501
    # 念珠碰撞攻击力 : {value0}% x {value1}
    # REMOVE: data0 = [0, 35168, 43322, 51477, 59632, 67787, 75942, 84096, 92251, 100406, 108561, 116716, 124870, 133025, 141180, 149335, 157490, 165644, 173799, 181954, 190109, 198263, 206418, 214573, 222728, 230883, 239037, 247192, 255347, 263502, 271657, 279811, 287966, 296121, 304276, 312431, 320585, 328740, 336895, 345050, 353205, 361359, 369514, 377669, 385824, 393979, 402133, 410288, 418443, 426598, 434753]# noqa: E501
    data0 = get_data(f'{prefix}/{uuid}', 0)
    # REMOVE: data1 = [0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]# noqa: E501
    data1 = get_data(f'{prefix}/{uuid}', 1)
    # 如意珠碰撞攻击力 : {value2}%
    # REMOVE: data2 = [0, 117225, 144408, 171591, 198773, 225956, 253138, 280321, 307504, 334686, 361869, 389052, 416234, 443417, 470600, 497782, 524965, 552148, 579330, 606513, 633696, 660878, 688061, 715244, 742426, 769609, 796792, 823974, 851157, 878340, 905522, 932705, 959888, 987070, 1014253, 1041435, 1068618, 1095801, 1122983, 1150166, 1177349, 1204531, 1231714, 1258897, 1286079, 1313262, 1340445, 1367627, 1394810, 1421993, 1449175]# noqa: E501
    data2 = get_data(f'{prefix}/{uuid}', 2)
    # 如意珠爆炸多段攻击力 : {value3}% x {value4}
    # REMOVE: data3 = [0, 41866, 51574, 61282, 70990, 80699, 90407, 100115, 109823, 119531, 129239, 138947, 148655, 158363, 168071, 177779, 187488, 197196, 206904, 216612, 226320, 236028, 245736, 255444, 265152, 274860, 284568, 294277, 303985, 313693, 323401, 333109, 342817, 352525, 362233, 371941, 381649, 391357, 401066, 410774, 420482, 430190, 439898, 449606, 459314, 469022, 478730, 488438, 498146, 507855, 517563]# noqa: E501
    data3 = get_data(f'{prefix}/{uuid}', 3)
    # REMOVE: data4 = [0, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7]# noqa: E501
    data4 = get_data(f'{prefix}/{uuid}', 4)


class classChange(Character):
    def __init__(self, equVersion):

        self.name = 'sorceress'
        self.nameCN = '神启·巫女'
        self.role = 'priest_female'
        self.角色 = '圣职者(女)'
        self.职业 = '巫女'
        self.jobId = '0c1b401bb09241570d364420b3ba3fd7'
        self.jobGrowId = '6d459bc74ba73ee4fe5cdc4655400193'

        self.武器选项 = [] # TODO
        self.输出类型选项 = [] # TODO
        self.输出类型 = '' # TODO
        self.防具精通属性 = [''] # TODO
        self.防具类型 = ''
        self.buff = ... # TODO

        super().__init__(equVersion, __name__)
